{"title":"P.S. I Love You (2007)  Marjan TBS","uid":6071328,"size":4682626549,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0095e59ae7e756ba794fd3e920e501be1c3684c2&amp;dn=P.S.+I+Love+You+%282007%29++Marjan+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Marjanb","files":32,"time":1293632418,"description":"P.S. I Love You (2007)       \n   \nVerenigde Staten\nDrama / Romantiek\n126 minuten\n\ngeregisseerd door Richard LaGravenese\nmet Hilary Swank, Gerard Butler en Kathy Bates\n\n\n\nAl zijn zij het niet altijd met elkaar eens, Gerry en Holly lijken voor elkaar gemaakt te zijn. Wanneer Gerry komt te overlijden, is Holly ontroostbaar en sluit zichzelf af. Totdat ze een brief in haar post vindt met Gerry's handschrift, die aan haar is geadresseerd. In de brief zegt Gerry dat dit de eerste van in totaal twaalf brieven is, die zij een jaar lang elke maand zal krijgen, en waarin hij haar instructies geeft die zij moet opvolgen. Haar eerste taak: naar buiten gaan en een killer disco outfit kopen. Zo begint voor Holly een jaar vol avonturen, van karaokeavonden met vrienden tot een reis naar Ierland, allemaal zorgvuldig voorbereid door Gerry, en vormgegeven aan de hand van de letters P.S. I love you...\n\n\nEnglish\n\nHolly Kennedy is beautiful, smart and married to the love of her life - a passionate, funny, and impetuous Irishman named Gerry. So when Gerry's life is taken by an illness, it takes the life out of Holly. The only one who can help her is the person who is no longer there. Nobody knows Holly better than Gerry. So it's a good thing he planned ahead. Before he died, Gerry wrote Holly a series of letters that will guide her, not only through her grief, but in rediscovering herself. The first message arrives on Holly's 30th birthday in the form of a cake, and to her utter shock, a tape recording from Gerry, who proceeds to tell her to get out and &quot;celebrate herself&quot;. In the weeks and months that follow, more letters from Gerry are delivered in surprising ways, each sending her on a new adventure and each signing off in the same way; P.S. I Love You. Holly's mother and best friends begin to worry that Gerry's letters are keeping Holly tied to the past, but in fact, each letter is pushing her further into a new future. With Gerry's words as her guide, Holly embarks on a journey of rediscovery in a story about marriage, friendship and how a love so strong can turn the finality of death into a new beginning for life. \n\n &lt;a href=&quot; http://moviemeter.nl/film/42547&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://moviemeter.nl/film/42547&lt;/a&gt; \n &lt;a href=&quot; http://www.imdb.com/title/tt0431308&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0431308&lt;/a&gt;\n\n\nBron: Retail\nAudio: Eng 5.1 DD\nSubs: Ned\nMenu: Ja\nCategorie : Beeld \nFormaat : DVD5  \nOndertitels : Nederlands (instelbaar) \nGenre : Drama\nRomantiek\nCover/label :Yes\n \n\nEnjoy Marjan","torrent":{"xt":"urn:btih:0095e59ae7e756ba794fd3e920e501be1c3684c2","amp;dn":"P.S.+I+Love+You+%282007%29++Marjan+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0095e59ae7e756ba794fd3e920e501be1c3684c2","infoHashBuffer":{"type":"Buffer","data":[0,149,229,154,231,231,86,186,121,79,211,233,32,229,1,190,28,54,132,194]},"announce":[],"urlList":[]}}