{"title":"Carbon Dioxide Utilisation - Closing the Carbon Cycle","uid":14424862,"size":24879066,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01f5091ee8dc382717791142537759ff54a3a59b&amp;dn=Carbon+Dioxide+Utilisation+-+Closing+the+Carbon+Cycle&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1461557536,"description":"Carbon Dioxide Utilisation - Closing the Carbon Cycle - Peter Styring et al. (Elsevier, 2015).pdf\r\n\r\nISBN 978-0-444-62746-9\r\n\r\nCarbon Dioxide Utilisation: Closing the Carbon Cycle explores areas of application such as conversion to fuels, mineralization, conversion to polymers, and artificial photosynthesis as well as assesses the potential industrial suitability of the various processes. After an introduction to the thermodynamics, basic reactions, and physical chemistry of carbon dioxide, the book proceeds to examine current commercial and industrial processes, and the potential for carbon dioxide as a green and sustainable resource.\r\n\r\nWhile carbon dioxide is generally portrayed as a &quot;bad&quot; gas, a waste product, and a major contributor to global warming, a new branch of science is developing to convert this &quot;bad&quot; gas into useful products. This book explores the science behind converting CO2 into fuels for our cars and planes, and for use in plastics and foams for our homes and cars, pharmaceuticals, building materials, and many more useful products.\r\n\r\nCarbon dioxide utilization is a rapidly expanding area of research that holds a potential key to sustainable, petrochemical-free chemical production and energy integration.\r\n\r\n\r\nAccessible and balanced between chemistry, engineering, and industrial applications\r\nInformed by blue-sky thinking and realistic possibilities for future technology and applications\r\nEncompasses supply chain sustainability and economics, processes, and energy integration","torrent":{"xt":"urn:btih:01f5091ee8dc382717791142537759ff54a3a59b","amp;dn":"Carbon+Dioxide+Utilisation+-+Closing+the+Carbon+Cycle","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01f5091ee8dc382717791142537759ff54a3a59b","infoHashBuffer":{"type":"Buffer","data":[1,245,9,30,232,220,56,39,23,121,17,66,83,119,89,255,84,163,165,155]},"announce":[],"urlList":[]}}