{"title":"Angels Walking Series - Karen Kingsbury","uid":12927263,"size":8885453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:024a8de4f3daf0f79045d8f680db03593c7f666d&amp;dn=Angels+Walking+Series+-+Karen+Kingsbury&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":6,"time":1449484161,"description":"01. Angels Walking [Angels Walking, #01] - Karen Kingsbury\r\n\r\n\r\n\r\nFrom #1 New York Times bestselling author Karen Kingsbury comes the first in a brand-new series about second chances—a dramatic story about a washed up baseball player, the love he left behind, and the miracles that might save them both.\r\n\r\nWhen former national baseball star Tyler Ames suffers a career-ending injury, all he can think about is putting his life back together the way it was before. He has lost everyone he loves on his way to the big leagues. Then just when things seem to be turning around, Tyler hits rock bottom. Across the country, Tyler’s one true love Sami Dawson has moved on.\r\n\r\nA series of small miracles leads Tyler to a maintenance job at a retirement home and a friendship with Virginia Hutcheson, an old woman with Alzheimer’s who strangely might have the answers he so desperately seeks.\r\n\r\nA team of Angels Walking take on the mission to restore hope for Tyler, Sami, and Virginia. Can such small and seemingly insignificant actions of the unseen bring healing and redemption? And can the words of a stranger rekindle lost love? Every journey begins with a step.\r\n\r\nIt is time for the mission to begin…\r\n\r\n02. Chasing Sunsets [Angels Walking, #02] - Karen Kingsbury\r\n\r\n\r\n\r\nFrom #1 New York Times bestselling author Karen Kingsbury comes the second novel in the Angels Walking series about divine intervention and second chances—the dramatic story of a woman desperate to find deeper meaning in her life.\r\n\r\nGrowing up in a comfortable home, Mary Catherine wanted for nothing. Though she loves her wealthy parents, their lifestyle never appealed to her. Instead, Mary Catherine pursues meaning through charity work, giving away a part of herself but never giving away her heart.\r\n\r\nMary Catherine lives in Los Angeles with her roommate, Sami, and volunteers at a local youth center with coach Tyler Ames and LA Dodger Marcus Dillinger. Despite Mary Catherine’s intention to stay single, she finds herself drawing close to Marcus, and their budding romance offers an exciting life she never dreamed of. That is, until she receives devastating news from her doctor. News that alters her future and forces her to make a rash decision.\r\n\r\nInspirational and moving, Chasing Sunsets is the story of one woman’s deep longings of the soul, and the sacrifices she’s willing to make in search of healing","torrent":{"xt":"urn:btih:024a8de4f3daf0f79045d8f680db03593c7f666d","amp;dn":"Angels+Walking+Series+-+Karen+Kingsbury","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"024a8de4f3daf0f79045d8f680db03593c7f666d","infoHashBuffer":{"type":"Buffer","data":[2,74,141,228,243,218,240,247,144,69,216,246,128,219,3,89,60,127,102,109]},"announce":[],"urlList":[]}}