{"title":"FakeAgentUK - Taylor Shay (Massive Facial for South African Babe","uid":12813343,"size":753806109,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:03517bb3945117e103f21b545065789aaafc2ab7&amp;dn=FakeAgentUK+-+Taylor+Shay+%28Massive+Facial+for+South+African+Babe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1448205812,"description":"I always find an angle to work on when trying to make a girl think she's more suited to porn. Today it was height. This stunning South African babe came in to see me and at 5ft 5, she could have possible had done catwalk, but I told her she was a tiny bit too short, and would be much more suited to doing porno's. Luckily for me she was quite open to the idea of spreading her legs for a huge wad of cash. What a figure! This chick was mint, blonde, blue eyes, very pretty, beautiful skin tone and of course perfect tits and arse! I was about to be dining at a Michelin star restaurant. No grotty roadside cafe for me today, this chick was fucking mint I tell you. As I was getting this chick warmed up I tried slotting two digits in her slick pussy. No chance! This pussy was tighter than a bulldogs bite! So I eased in one finger... This was tight too!!! Fuck me, how the fuck was I supposed to get my cock in there? Anyway, after getting getting enough spit on my cock to lubricate a jumbo jet, I guided my cock in. Oh my God it felt good, it was so tight! It felt like every 10-15 strokes I wanted to fill her pussy with my man batter. After holding off as long as I possibly could I got her onto her knees and let rip all over her mouth and face. This chick's pussy had done me in, I couldn't think straight. Proper fucked. Enjoy.\r\nTags: Deep Throat, Blowjob, Ball Licking, Cum in Mouth, Big Tits, Casting, POV, Hardcore\r\n \nhttp://imgdone.com/viewer.php?file=43473380130930248076.jpg\r\n \nhttp://imgdone.com/viewer.php?file=66667081913318585375.jpg","torrent":{"xt":"urn:btih:03517bb3945117e103f21b545065789aaafc2ab7","amp;dn":"FakeAgentUK+-+Taylor+Shay+%28Massive+Facial+for+South+African+Babe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03517bb3945117e103f21b545065789aaafc2ab7","infoHashBuffer":{"type":"Buffer","data":[3,81,123,179,148,81,23,225,3,242,27,84,80,101,120,154,170,252,42,183]},"announce":[],"urlList":[]}}