{"title":"Britney Spears - The Singles Collection (CD Rip)","uid":9690400,"size":156233395,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:03be67865d232b409c3bd94932d6807373921e36&amp;dn=Britney+Spears+-+The+Singles+Collection+%28CD+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"MusicFanatic98","files":-1,"time":1393807391,"description":"Britney: The Singles Collection is the second greatest hits album of American singer Britney Spears. It was released on November 10, 2009, by Jive Records, to commemorate her ten-year anniversary since entering the music industry. The compilation was released in many different formats, including a one-disc edition, a CD+DVD edition and a box set, which contained twenty-nine singles, each packaged in its own slip case with original cover art. The CD+DVD edition as well as the box set contained a DVD with Spears's music videos. The album included one new track, &quot;3&quot;, produced by Max Martin and Shellback. The Singles Collection was praised by contemporary critics, who noted Spears's impact and influence on pop music during her first decade within the music industry. The album entered the top forty in Australia, Japan, Mexico, New Zealand and the United States as well as in a number of European countries. &quot;3&quot; was released as the lead single from the album. In the United States, it debuted at number one on the Billboard Hot 100, becoming her first song to do so.","torrent":{"xt":"urn:btih:03be67865d232b409c3bd94932d6807373921e36","amp;dn":"Britney+Spears+-+The+Singles+Collection+%28CD+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03be67865d232b409c3bd94932d6807373921e36","infoHashBuffer":{"type":"Buffer","data":[3,190,103,134,93,35,43,64,156,59,217,73,50,214,128,115,115,146,30,54]},"announce":[],"urlList":[]}}