{"title":"Dishonored.Real.Proper-Crack Only-RELOADED","uid":7713569,"size":15694332,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:03d20f5ac67a7b440076c4830604183437d67ac2&amp;dn=Dishonored.Real.Proper-Crack+Only-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tikasukaz","files":-1,"time":1349829246,"description":"nERv\n\nDishonored Real Proper (c) Bethesda Softworks\n\n10/2012 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action, Adventure\n\nNote: FLT's release doesn't save options. Ours does. Enjoy\n\n\n\nDishonored is an immersive first-person action game that casts you as a\nsupernatural assassin driven by revenge.  With Dishonored's flexible combat\nsystem, creatively eliminate your targets as you combine the supernatural\nabilities, weapons and unusual gadgets at your disposal. Pursue your enemies\nunder the cover of darkness or ruthlessly attack them head on with weapons\ndrawn. The outcome of each mission plays out based on the choices you make.\n\nDishonored is set in Dunwall, an industrial whaling city where strange\nsteampunk- inspired technology and otherworldly forces coexist in the\nshadows. You are the once-trusted bodyguard of the beloved Empress. Framed\nfor her murder, you become an infamous assassin, known only by the disturbing\nmask that has become your calling card. In a time of uncertainty, when the\ncity is besieged by plague and ruled by a corrupt government armed with\nindustrial technologies, dark forces conspire to bestow upon you abilities\nbeyond those of any common man  but at what cost? The truth behind your\nbetrayal is as murky as the waters surrounding the city, and the life you\nonce had is gone forever.\n\n\nFeatures\nImprovise and Innovate\nApproach each assassination with your own style of play. Use shadow and\nsound to your advantage to make your way silently through levels unseen\nby foes, or attack enemies head-on as they respond to your aggression.\nThe flexible combat system allows you to creatively combine your\nabilities, supernatural powers and gadgets as you make your way through\nthe levels and dispatch your targets. Improvise and innovate to define\nyour play style.\nSupernatural Abilities\nTeleport for stealth approaches, possess any living creature, or stop\ntime itself to orchestrate unearthly executions Combining your suite of\nsupernatural abilities and weapons opens up even more ways to overcome\nobstacles and eliminate targets.  The game's upgrade system allows for\nthe mastery of deadly new abilities and devious gadgets\n\n\nInstallation Notes:\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Copy over the cracked content from the Crack dir on the disc to your\ninstallBinariesWin32 dir\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT","torrent":{"xt":"urn:btih:03d20f5ac67a7b440076c4830604183437d67ac2","amp;dn":"Dishonored.Real.Proper-Crack+Only-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03d20f5ac67a7b440076c4830604183437d67ac2","infoHashBuffer":{"type":"Buffer","data":[3,210,15,90,198,122,123,68,0,118,196,131,6,4,24,52,55,214,122,194]},"announce":[],"urlList":[]}}