{"title":"R.A.T.M (Stabos)","uid":7485476,"size":150622330,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:042f0b6c0b80bddf7de2ef584e390a1fb3374685&amp;dn=R.A.T.M+%28Stabos%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Stabos","files":22,"time":1343573935,"description":"Rage Against the Machine is an American rock band from Los Angeles, California. Formed in 1991, the group consists of vocalist Zack de la Rocha, bassist and backing vocalist Tim Commerford, guitarist Tom Morello and drummer Brad Wilk. They draw inspiration from early heavy metal instrumentation, as well as rap acts such as Afrika Bambaataa, Public Enemy, the Beastie Boys and Dutch crossover band Urban Dance Squad. As of 2010, they have sold over 16 million records worldwide.\nIn 1992, the band released its self-titled debut album, which became a commercial success, leading to a slot in the 1993 Lollapalooza festival, and is often cited by critics as one of the greatest and most influential albums of all time. In 2003, the album was ranked number 368 on Rolling Stone magazine's list of the 500 greatest albums of all time. The band did not release a follow-up record until 1996, with Evil Empire. The band's third album, The Battle of Los Angeles, followed in 1999. In 2003, the album was ranked number 426 on Rolling Stone magazine's list of the 500 greatest albums of all time. During their initial nine-year run, they became one of the most popular and influential bands in music history, according to music journalist Colin Devenish. They were also ranked #33 on VH1's 100 Greatest Artists of Hard Rock. The band had a large influence on the nu metal genre which emerged during the mid to late 1990s.\nIn 2000, the band released the cover album Renegades. The same year, Rage Against the Machine disbanded after De la Rocha unexpectedly quit the group. De la Rocha started a low-key solo career in One Day as a Lion; the rest of the band formed the rock supergroup Audioslave with Chris Cornell, then-former front-man of Soundgarden, which disbanded in 2007. That April, Rage Against the Machine performed together for the first time in seven years at the Coachella Valley Music and Arts Festival. They have continued to perform at many live venues and festivals around the world since 2007, although as of 2012 the band has yet to record any new material.","torrent":{"xt":"urn:btih:042f0b6c0b80bddf7de2ef584e390a1fb3374685","amp;dn":"R.A.T.M+%28Stabos%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"042f0b6c0b80bddf7de2ef584e390a1fb3374685","infoHashBuffer":{"type":"Buffer","data":[4,47,11,108,11,128,189,223,125,226,239,88,78,57,10,31,179,55,70,133]},"announce":[],"urlList":[]}}