{"title":"Glee - S01E04 - Preggers [Np]","uid":5938720,"size":366554018,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:04a88abc7143f159b6ca11433b176b6c2427bccb&amp;dn=Glee+-+S01E04+-+Preggers+%5BNp%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoahPuckerman","files":1,"time":1289057085,"description":"Name: Glee\nSeason: 1\nEpisode: 4\nEpisode Name: Preggers\nOriginal Air Date on TV: September 23, 2009\n\n\nEpisode Plot\n(Via: Wikipedia)\n\nGlee club member Kurt Hummel is caught dancing to BeyoncÃƒÂ© Knowles's &quot;Single Ladies&quot; by his father Burt, and claims that it is a football exercise, and that he is now part of the team. Fellow glee club member and football quarterback Finn Hudson helps Kurt to practice, and finds him to be a skilled kicker. Finn convinces coach Ken Tanaka (Patrick Gallagher) to let Kurt try out for the team. Ken is delighted to find such an asset for the team and adds Kurt as the kicker. When Finn's girlfriend Quinn tells him she is pregnant, Finn worries that his future prospects will be diminished by fatherhood. He asks glee club director Will Schuester to coach the football team at dancing, believing it will help them to improve, increasing his chances of securing a football scholarship. Finn confides Quinn's news to his best friend Puck, who later confronts Quinn, claiming to be the baby's father, since she said she was a virgin when they had sex. Quinn rejects Puck, calling him a &quot;Lima loser&quot; who could never support her and the baby like Finn. Will's wife Terri (Jessalyn Gilsig) reveals to her sister Kendra (Jennifer Aspen) that she experienced a hysterical pregnancy and is not really carrying Will's baby. Kendra suggests that they acquire a baby, and when Terri learns of Quinn's pregnancy from Will, she confronts her, asking questions about her prenatal care.\n\nCheerleading coach Sue Sylvester approaches former glee club director Sandy Ryerson and enlists him in her plan to sabotage the club. She blackmails Principal Figgins (Iqbal Theba) into appointing Sandy as the school's new Arts director, and together they hold auditions for a school production of Cabaret, hoping to entice away the glee club's star, Rachel Berry. Rachel feels slighted when Will awards Tina (Jenna Ushkowitz) a solo song, so auditions for the musical and is given the lead role. When Will refuses to reassign the solo song to Rachel, she quits the club.\n\nThe football team puts their dance training into practice by performing the &quot;Single Ladies&quot; routine in the middle of a game, confusing and distracting the opposition, and with Kurt's help is able to win. Buoyed on by his success, Kurt comes out to his father, who tells him he knew all along and loves him just the same.\n\nI Will Be Uploading All Glee Episodes As Single Files Then All Together (:\nI Will Also Be Uploading All Albums To Each Season (:\n\nEnjoy (: &amp; Please Seed \n\nThanks\n\n- [Np]","torrent":{"xt":"urn:btih:04a88abc7143f159b6ca11433b176b6c2427bccb","amp;dn":"Glee+-+S01E04+-+Preggers+%5BNp%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04a88abc7143f159b6ca11433b176b6c2427bccb","infoHashBuffer":{"type":"Buffer","data":[4,168,138,188,113,67,241,89,182,202,17,67,59,23,107,108,36,39,188,203]},"announce":[],"urlList":[]}}