{"title":"Graveworm - Fragments Of Death (2011) Metal","uid":6762274,"size":127208233,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:04d29df55da3093053c99c784ffe511c215956e5&amp;dn=Graveworm+-+Fragments+Of+Death+%282011%29+Metal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":13,"time":1319245969,"description":"01. Insomnia (4:55) \n02. Only Dead In Your Wake (4:01) \n03. Absence Of Faith (3:55) \n04. Living Nightmare (4:13) \n05. The World Will Die In Flames (4:34) \n06. Anxiety (4:33) \n07. See No Future (5:02) \n08. The Prophecy (3:21) \n09. Remembrance (3:24) \n10. Old Forgotten Song (4:41) \n11. Where Angels Do Not Fly (3:52) \n12. Awake (Bonus Track) (6:11) \n\n\n\n\n320 kbps\n\n\n\n\n\nBefore Graveworm even released a demo, they were signed by Serenades Records after a performance close to their hometown of Bruneck (Brunico), northern Italy. Graveworm was signed to Serenades Records in 1997, releasing their first EP, Eternal Winds, in that same year. During their first tour together with Crematory, Therion and Lake of Tears, the band promoted the album When Daylight's Gone.\n\nIn 1998, the EP Underneath the Crescent Moon was released, featuring Sarah Jezebel Deva (Cradle of Filth, Therion) in the track &quot;Awake...Thy Angels Of Sorrow&quot;. Graveworm also performed at the Wacken Open Air (Germany) with bands such as Children of Bodom, Cradle of Filth and Vader.\n\nThe second album As the Angels Reach the Beauty was finished in 1999, and followed by a European tour with Agathodaimon. Scourge of Malice was released in 2001, which allowed the band their first headlining tour together with Dornenreich, Vintersorg and Darkwell. In 2002, they changed to the German Nuclear Blast label. At this point, Didi Schraffel (bass) left the band and Harry Klenk (guitars) was replaced by Eric Treffel. Treffel soon left the band in the same year and was replaced by Eric Righi on guitar.\n\nTogether with Righi, they produced Engraved in Black, which was finished in 2003, and enhanced with a feature of R.E.M.'s &quot;Losing My Religion&quot;. Shortly after the release, Stefan Unterpertinger (guitar) quit and Lukas Flarer joined the band. Also, Harry Klenk, former guitarist and now bassist, re-joined the band.\n\nIn 2004, Graveworm played on the X-Mass Festival tour together with Destruction, Kataklysm, and many others. Martin Innerbichler (drums) took a break to study and was temporarily replaced by Moritz Neuner (previously the Darkwell and Shadowcast drummer).\n\nThe album (N)utopia was released in 2005.\n\nLukas Flarer (guitarist) later left the band for personal reasons, and was replaced by Orgler &quot;Stirz&quot; Thomas.\n\nIn 2006, Graveworm embarked on a North American tour with Kataklysm, Destruction, The Absence, and Vader.\n\nOn April 10, 2007, the promo of the latest Graveworm album, Collateral Defect, was leaked on the web. The album was launched in Europe on May 25 via Massacre Records and June 5 in North America through Nuclear Blast. It was produced by Andy Classen at Stage One studios in Borgentreich, Germany.\n\nGraveworm's album Diabolical Figures was released on June 19, 2009 and features Karsten JÃƒÂ¤ger as a guest musician.\n\n","torrent":{"xt":"urn:btih:04d29df55da3093053c99c784ffe511c215956e5","amp;dn":"Graveworm+-+Fragments+Of+Death+%282011%29+Metal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04d29df55da3093053c99c784ffe511c215956e5","infoHashBuffer":{"type":"Buffer","data":[4,210,157,245,93,163,9,48,83,201,156,120,79,254,81,28,33,89,86,229]},"announce":[],"urlList":[]}}