{"title":"MassageRooms - Gina, Emyli (Gina on Emyli) NEW April 06, 2014","uid":9903141,"size":551258492,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0725cc8e041383e49ae756e71c3672d2a1f22d57&amp;dn=MassageRooms+-+Gina%2C+Emyli+%28Gina+on+Emyli%29+NEW+April+06%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"codho","files":1,"time":1396802394,"description":"Tall and beautiful with short blonde hair and dream like pale skin with accompanying piercing eyes, this was Gina's next client the stunning 22 year old Emyli. Gina held the towel for her as she got undressed her eyes stayed firmly to the floor keeping a professional attitude as always, although out the corner of her eye she noticed a cluster of tattooed stars on Emyli's back leading Gina to think that she may have an adventurous side to her.\nEmyli's feet were first to get the attentions of Gina's experienced oil laden hands and her soft calves were next, now Gina could see her sexy tattoo in full as she massaged her shoulders and back, Emyli feeling quite tranquil and relaxed.\nGina slipped her hands in-between the towel and Emyli's soft bum cheeks rubbing them with oil until she was ready to remove the towel and start a firm massage of her juicy butt. As she did so she parted Emyli's beautiful cheeks and rubbed oil into her hidden pussy lips as they lay snuggled in between. The rubbing of the pussy became more vigorous and the response was of grateful acceptance from her sexy client.\nEmyli was turned over and her pearlescent white body glimmered in the light, vulnerable to the sexy touch it was about to receive. Gina wasted not a moment in massaging the big breasts she had sitting before her, rubbing and squeezing them whilst oiled dripped down onto Emyli's firm stomach.\nThis was mearly the start of their rememerable sexual encounter together as soon both were partaking in a very sexy 69 position followed by both girls making sure the other was totally satisfied and made to feel special, both were getting more and more into each other forming a relationship that will continue for a while to come.\n\n\nScreens :\n &lt;a href=&quot;\nhttp://imgdope.com/viewer.php?file=89421465649352183819.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdope.com/viewer.php?file=89421465649352183819.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdope.com/viewer.php?file=09379994672856750194.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdope.com/viewer.php?file=09379994672856750194.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0725cc8e041383e49ae756e71c3672d2a1f22d57","amp;dn":"MassageRooms+-+Gina%2C+Emyli+%28Gina+on+Emyli%29+NEW+April+06%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0725cc8e041383e49ae756e71c3672d2a1f22d57","infoHashBuffer":{"type":"Buffer","data":[7,37,204,142,4,19,131,228,154,231,86,231,28,54,114,210,161,242,45,87]},"announce":[],"urlList":[]}}