{"title":"Mien Kampf - Adolf Hitler (The Stalag Edition) [EN PDF]","uid":12785950,"size":2379283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:078c14169bd9d66ec66dc28ef2d118d096e99739&amp;dn=Mien+Kampf+-+Adolf+Hitler+%28The+Stalag+Edition%29+%5BEN+PDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"perfect_stan","files":1,"time":1447865905,"description":"Mein Kampf\r\nThe Stalag Edition: The Only Complete and Officially Authorised English Translation Ever Issued \r\n\r\nby Adolf Hitler\r\n\r\nWith Original title page of a copy of the only official English translation of Mein Kampf ever issued, complete with Stalag camp number 357 stamp. Stalag 357 was located in  Kopernikus, Poland, until September 1944, when it was moved to the old site of the former Stalag XI-D, near the town of Falling bostel in Lower Saxony, in north-western Germany. Its internees included British air crews, and later, British soldiers captured at the Battle of Arnhem. \r\n\r\nJames Murphy created a translation into English for the Nazi government in 1936-37 while he stayed in Germany. He had some sympathies for their politics and because of this the propaganda ministry hired him to create the English translation of Mein Kampf. Over time, Murphy's opinions about the Nazi government changed. The German government decided they no longer cared for him after he made some critical remarks and told him he had to leave. He left quickly without his translation into English or any notes. Later he sent his wife back and she was able to obtain a copy from his German secretary. The German government edited and published the Murphy version which was completed for them, in English, and it was printed within Germany from the presses of the Nazi printing office. Very few copies are known to \r\nhave been printed, but the of the ones which were printed, some were sent to POW camps in Germany for British and American POW's. A very rare version of this official Nazi English edition has recently been re-discovered republished for the first time since it was printed by the Nazi government and is available here. It is very interesting to compare this translation to both Murphy's later translation and to the new Ford translation to compare the differences.\r\n\r\nThe Nazi version is filled with grammar errors, spelling errors, and astonishing punctuation errors. This printing preserves every error exactly as it was published in Germany. Nothing has been altered.\r\n\r\nPlease SEED!!!","torrent":{"xt":"urn:btih:078c14169bd9d66ec66dc28ef2d118d096e99739","amp;dn":"Mien+Kampf+-+Adolf+Hitler+%28The+Stalag+Edition%29+%5BEN+PDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"078c14169bd9d66ec66dc28ef2d118d096e99739","infoHashBuffer":{"type":"Buffer","data":[7,140,20,22,155,217,214,110,198,109,194,142,242,209,24,208,150,233,151,57]},"announce":[],"urlList":[]}}