{"title":"Latoya Jackson - Heart Don't Lie","uid":4972319,"size":130955268,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:09adf02709c03eb1bcd130bf0242117db69a4442&amp;dn=Latoya+Jackson+-+Heart+Don%5C%27t+Lie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1245832599,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Heart Don't Lie&quot; is a single by American singer La Toya Jackson. Her biggest hit ever, this was her second single from the successful album Heart Don't Lie. It is a duet with Howard Hewett, although he receives no credit for his vocals in the liner notes and does not appear in the music video. Musical Youth also provides vocals in the track.\n\nThe single reached #56 on the Billboard Hot 100 charts, and is La Toya's most successful single to date. A 7&quot; single was released with the track &quot;Without You&quot; for a B-side; the 12&quot; maxi single included a Club Version and Dub Mix.\n\nIt is notable that this is the first song out of four by La Toya Jackson to have an accompanying music video. The music video features Jackson in a very colorful and cartoon-like high school setting, despite her being in her late 20s at the time.\n\nHeart Don't Lie is the third album released by singer La Toya Jackson. It is her most critically acclaimed and commercially successful album to date, peaking at #149 on the Billboard 200. The album includes a cover version of Prince's &quot;Private Joy&quot; and features a plethora of musical guests, including Shalamar's Howard Hewett and reggae-pop group Musical Youth on the title track, musicians from Kool &amp; the Gang on several tracks throughout the album, and collaborations with her siblings, including Marlon, Janet, and Tito, who co-produced the track &quot;Frustration&quot;.\n\nMany consider this to be Jackson's finest musical effort, with Allmusic commenting &quot;...a handful of guilty pleasures here that are, if not much else, very catchy, making this a wise investment for anyone curious about the music of the Jackson family &quot;outcast.&quot;&quot;\n\nJackson and Amir Bayyan, the producer of the album, wrote the song &quot;Reggae Nights&quot; for this album, which was not released on Heart Don't Lie but ended up being a Grammy-nominated single for Jimmy Cliff. She recorded the song herself for her 1991 album No Relations.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:09adf02709c03eb1bcd130bf0242117db69a4442","amp;dn":"Latoya+Jackson+-+Heart+Don%5C%27t+Lie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09adf02709c03eb1bcd130bf0242117db69a4442","infoHashBuffer":{"type":"Buffer","data":[9,173,240,39,9,192,62,177,188,209,48,191,2,66,17,125,182,154,68,66]},"announce":[],"urlList":[]}}