{"title":"Shout Out Louds - Optica (2013) [FLAC]","uid":8197411,"size":375016795,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0a220e61d242287aed1b26817ec0be8c2b1c36e7&amp;dn=Shout+Out+Louds+-+Optica+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1361943286,"description":"\n  Shout Out Louds - Optica (2013) [FLAC]\n\n  Released: 2013\n  Genre: Pop/Rock\n  Style: Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Sugar \n  02 Illusions \n  03 Blue Ice\n  04 14th Of July\n  05 Burn \n  06 Walking In Your Footsteps\n  07 Glasgow \n  08 Where You Come In\n  09 Hermila \n  10 Chasing The Sinking Sun \n  11 Circles \n  12 Destroy\n\n  Ever since the energetic thrill ride of their debut album Howl Howl Gaff Gaff, Shout Out Louds have applied a coat of icy polish to each successive album, pasting over some of the wild-eyed desperation with a more measured yet no less emotional approach. Released in 2010, Work almost took it too far, with the Phil Ek production verging on bland. For 2013's album Optica, the bandmembers took over the production themselves, and while it's not as lively as their debut, the sound is much punchier and sounds more like the logical follow-up to Our Ill Wills than Work does. The songs are stronger too, with more variety and some bouncy tracks to break the gloomy mood the band seemed stuck in previously. Along with this, there are plenty of nice touches that make the sound come to life -- the chirpy flutes on the very catchy &quot;Walking in Your Footsteps,&quot; the super cute backing vocals on &quot;Glasgow,&quot; the shuffling disco tempo and percussion on &quot;Illusions,&quot; the super cheesy synths on the otherwise very chilly Bebban Stenborg-sung &quot;Hermila.&quot; For anyone who may be worried that Shout Out Louds may have sorted out all their problems and are all happy and well-adjusted, there are some heavy midtempo heartbreak ballads (like &quot;Where You Come In,&quot; &quot;Circles,&quot; and &quot;Blue Ice&quot;) on hand to balance out the slivers of sunshine. Honestly, even the happy-sounding songs are pretty melancholy at their core. It's a trick the Cure were always able to pull off, and Shout Out Louds have learned it well. The album-opening &quot;Sugar&quot; conjures up very strong impressions of the Cure and may be the best song here. Thanks to the production, the overall strength of the songs, and the quietly intense energy the bandmembers put into their performances (not forgetting Adam Olenius' typically impressive lead vocals), Optica is a welcome return to form and solidifies Shout Out Louds' position as one of the best indie pop bands of their era.","torrent":{"xt":"urn:btih:0a220e61d242287aed1b26817ec0be8c2b1c36e7","amp;dn":"Shout+Out+Louds+-+Optica+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a220e61d242287aed1b26817ec0be8c2b1c36e7","infoHashBuffer":{"type":"Buffer","data":[10,34,14,97,210,66,40,122,237,27,38,129,126,192,190,140,43,28,54,231]},"announce":[],"urlList":[]}}