{"title":"Sport and Recreation in Ancient Greece: A Sourcebook With Transl","uid":11732511,"size":22089405,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0bc17734345cd9c361da8680aba90a9833cf1ff4&amp;dn=Sport+and+Recreation+in+Ancient+Greece%3A+A+Sourcebook+With+Transl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425430848,"description":"Aimed at readers of all levels--from student to classics buff to serious scholars--this sourcebook looks at sport and recreation in ancient Greece through translated accounts of ancient Greek and Latin authors. It examines such diversions as the ancient Olympic Games, athletic clothing, women in sports, dining, dancing, and fishing. Sport and Recreation in Ancient Greece offers a wide range of topics geared to students' interests, new translations into readable English that facilitate their introduction to the subject, and a rich assortment of illustrations. The questions following each translation help students understand the passages, while the presentation of contradictory evidence challenges them to evaluate different points of view, both in the study of ancient culture and in their own daily lives. Successfully tested in college classrooms for a ten years, this book provides an excellent springboard for the study of ancient Greek history, classical literature, or sports history","torrent":{"xt":"urn:btih:0bc17734345cd9c361da8680aba90a9833cf1ff4","amp;dn":"Sport+and+Recreation+in+Ancient+Greece%3A+A+Sourcebook+With+Transl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bc17734345cd9c361da8680aba90a9833cf1ff4","infoHashBuffer":{"type":"Buffer","data":[11,193,119,52,52,92,217,195,97,218,134,128,171,169,10,152,51,207,31,244]},"announce":[],"urlList":[]}}