{"title":"Constructor working on XP and Vista no emulation needed","uid":4678685,"size":249725440,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0c395065067ee08d20997dc123c756a1cf0e845e&amp;dn=Constructor+working+on+XP+and+Vista+no+emulation+needed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Holyfreak","files":1,"time":1232993547,"description":" &lt;a href=&quot;http://en.wikipedia.org/wiki/Constructor_(video_game)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://en.wikipedia.org/wiki/Constructor_(video_game)&lt;/a&gt;\n\n&quot; Constructor lets players choose from what they call four different &quot;goal paradigms.&quot; The four paradigms are Financial, Ego Mania, World Domination and Utopian State. The Financial paradigm is centered around trying to become filthy rich. To do this you need to create a huge empire that has the right mix of high-class housing and great tenant records. You also need to dominate the land/space arena to have enough people around to bring in great amounts of money.\n\nThe Ego Mania paradigm is a twist on the typical Constructor game where your main goal is to build one of everything in the game. This has its positives and negatives, and requires a different strategy than trying to dominate everything financially. The third paradigm, World Dominion, is where you try to take over the entire world. To do this you must conquer everything in sight by purchasing and using other tactics to control all of the land. Thefinal paradigm, and one of the more difficult ones, is the Utopian State paradigm. This challenge puts you to the task of making a perfect world where everything is stress free. To do this you have to pay careful attention to everyone living in your houses and make sure there are no problems brewing in the background. This might sound easy, but it becomes very difficult as your territory grows.\n\nWith a twist of humor and well-balanced gameplay, Acclaim has created a great looking and playing real estate simulation in the form of Constructor. What really sets Constructor apart from similar games is the wide variety of characters and structures that offer different challenges that change depending on how you play. Constructor should be a welcome addition for any simulation and strategy gaming fan! &quot;","torrent":{"xt":"urn:btih:0c395065067ee08d20997dc123c756a1cf0e845e","amp;dn":"Constructor+working+on+XP+and+Vista+no+emulation+needed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c395065067ee08d20997dc123c756a1cf0e845e","infoHashBuffer":{"type":"Buffer","data":[12,57,80,101,6,126,224,141,32,153,125,193,35,199,86,161,207,14,132,94]},"announce":[],"urlList":[]}}