{"title":"Crime and Punishment - Part 3  (Channel 4  2009)","uid":6118437,"size":736030720,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0ccd55ddf555b4c06f36d3a02f5ad3a865525a47&amp;dn=Crime+and+Punishment+-+Part+3++%28Channel+4++2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Lucy1948","files":1,"time":1295654607,"description":"TIME TEAM's Tony Robinson explores the history of our laws, where they came from and how they were enforced. From the fascinating to the inexplicable, this journey through the nation's criminal past sheds a surprising light on how we punish society's wrong-doers today.\n\n\n\nTony Robinson goes on a fascinating and sometimes bizarre journey to discover the origins of our laws and what we do to people when they break them. From trials by boiling water, through the decapitation of a king, to the emergence of our modern democracy, it is a journey that starts two thousand years ago and remains unfinished today.\n\nWe find out how the Normans created the first surveillance society, how today's compensation culture was started by the Anglo Saxons and how a man whose body was kept in a London cupboard inspired us to stop stringing up people and start locking them up instead.\n\n\n1) Feud Glorious Feud\nTony looks at the first millennium AD and the waves of foreign invaders that left their indelible mark on the way that we organise ourselves and sort out disputes; from Anglo Saxon family blood feuds in which it was perfectly legal to bump off a rival who had done you wrong, to a surprisingly sophisticated system of courts and written laws under King Alfred.\n\n2) Guilty as Charred\nTony gets medieval and finds out how a turbulent hundred and fifty years left us with professional judges, trial by jury and a set of laws for the entire country. He demonstrates trial by flesh burning, visits a town where Norman ideas have inspired punishments for modern day ASBO offenders and discovers how a muddy field in Surrey changed the course of international legal history.\n\n3) New King on the Block\nTony's journey has reached the 16th Century, and the reign of Henry VIII whose marital problems cast Britain adrift from Europe and changed the course of our legal history. He also finds out why judges wear wigs, how a tyrant ripped up the legal rule book and why parliament cut a king's head off to prove that no one was above the law.\n\n4) Have I Got Noose for You\nWe've reached the 18th Century, a golden age for business when property was king but the fear of crime meant that 200 offences, including pick-pocketing, were punishable by the death. Tony relives the theatre of a public execution, but also finds a London cupboard containing the preserved body of a man who inspired us to stop stringing people up and start locking up instead. He also looks at how the industrious Victorians turned Parliament into a factory for law making and how decisions that affect us all were finally put in the hands of every British adult.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:0ccd55ddf555b4c06f36d3a02f5ad3a865525a47","amp;dn":"Crime+and+Punishment+-+Part+3++%28Channel+4++2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ccd55ddf555b4c06f36d3a02f5ad3a865525a47","infoHashBuffer":{"type":"Buffer","data":[12,205,85,221,245,85,180,192,111,54,211,160,47,90,211,168,101,82,90,71]},"announce":[],"urlList":[]}}