{"title":"Stoneheart Alpha 13 Developmental Branch 2717","uid":12835360,"size":325166700,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0e0f2e1bf6b7785c4160dd1b50477697cdecb03a&amp;dn=Stoneheart+Alpha+13+Developmental+Branch+2717&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spiderban","files":1,"time":1448442483,"description":"Alpha 13 (develop-2697) is now available on the Steam latest (unstable) branch. Hooray!This release features the long-awaited Hearthling Therapist as well as a host of other goodies.The Rayya's Children kingdom (along with the brand-new desert biome) will be debuting with Alpha 13 but is not included in this particular release... stay tuned! \r\n\r\nThe Potter (who plays an important role with Rayya's Children) is now available as a playable class. Potters are harder to attain in the Ascendancy Kingdom. \r\n\r\nHere's what you'll find in this release: \r\n\r\n&quot;Hearthling Therapist&quot;\r\n\r\nThe citizens UI has been overhauled and redesigned! In addition to showing portraits and attributes for the hearthlings, you can now select which jobs the hearthling should be able to undertake. This makes it a lot easier to decide who to promote and control what jobs should be performed in your town.There is currently a known issue with Hearthling Therapist where some hearthlings which are instructed only to mine fail to do so. Also, in this iteration of HT, some specialized hearthlings are able to perform tasks which previously were not available to them (e.g. farmers can be instructed to mine).Both of these issues will be addressed in subsequent releases. \r\n\r\nOther Changes\r\nThe potter class has now been added! Mine clay from the earth and conver it to clay lamps and pots\r\nStructures that have been completed can now be torn down. Select the structure in build mode 'b' and press the 'Remove' button. Note that this doesn't work for buildings that used the insta-build console command.\r\nItems now fall off ladders.\r\nThe drop rate of stone when mining dirt has been reduced.\r\nClay now drops when mining dirt.\r\nBy popular demand, added the Gilded Crimson Rug to the game.\r\nThe Quickstart button has been disabled.\r\nDetect and notify the player when Lavasoft Ad-Aware crashes Stonehearth.\r\n\r\nLadies and gentlemen, we present to you: Rayya's Children.This latest iteration of Alpha 13 (develop-2710) is now available on the Steam Latest (unstable) branch.It features Rayya's Children, the second kingdom to debut in the world of Stonehearth, as well as their native environment -- the desert biome. Lots of new things to explore!Additionally, there is an all-new &quot;storybook&quot; start screen where you select the basic components of the adventure you are about to experience. \r\n\r\nNew Biome\r\nWelcome to the desert! Eat prickly pears and husband your wood; it's beautiful but bleak out there. \r\n\r\nNew Playable Kingdom\r\n?Rayya's Children is now available for play-testing!\r\nTheir default starting talisman is the Potter's Cutter.\r\nMake clay bricks to build shelter in the desert.\r\nFour brand new desert-themed housing templates.\r\nNew desert-themed UI skin, supported by the hot-loading mods feature.\r\nNew trading encounters.\r\nMake lots of items to sell for necessities and talismans.\r\n?Rayya's Children's basic systems are in place, but still need a lot of tuning, so write us with your feedback. \r\n\r\nNew Roof Editor\r\nWe've added more options to the roof editor. You can now make flat roofs, control the height of the walls below the roof, and the amount of roof overhang in each direction","torrent":{"xt":"urn:btih:0e0f2e1bf6b7785c4160dd1b50477697cdecb03a","amp;dn":"Stoneheart+Alpha+13+Developmental+Branch+2717","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e0f2e1bf6b7785c4160dd1b50477697cdecb03a","infoHashBuffer":{"type":"Buffer","data":[14,15,46,27,246,183,120,92,65,96,221,27,80,71,118,151,205,236,176,58]},"announce":[],"urlList":[]}}