{"title":"Epic Leftovers (epic Comics)","uid":8245792,"size":546530576,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0e2ef64c5f8d5c9f85499acbf6b3ad30b9c2fa45&amp;dn=Epic+Leftovers+%28epic+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ichthypod_Crane","files":17,"time":1363055463,"description":"\nHere we are, the last of 49 torrent from my epic Comics Upload Project (I dub thee &quot;eCUP&quot;!). This torrent is the scraps - though not the dregs - that didn't fit anywhere else, primarily one-shots and a few graphic novels. Among the entrants are: 'Someplace Strange' by Ann Nocenti and John Bolton; 'The Everyman' with early art from Michael Allred; a couple of translated GNs from 'Akira' creator, Katsuhiro Otomo; 'The Complete Alfred Bester's &quot;The Stars My Destination&quot;', with art by Howard Chaykin; 'Harvey Kurtzman's Strange Adventures'; and '67 Seconds', containing early work from James &quot;Starman&quot; Robinson and Steve &quot;Zenith&quot; Yowell.\n\nRegarding 'eCUP', there are several series I did not upload because they already exist on TPB in one form or other and look to be well-seeded. Said series are: \n\nAkira\nAlien Legion\nBlood: A Tale\nCoyote\nDreadstar\nElektra: Assassin\nElfQuest\nEpic Illustrated\nGroo the Wanderer\nMetropol\nMoonshadow\nPlastic Forks\nStarstruck\n\nI also skipped most of the existing Marvel properties (Wolverine, etc.) that dabbled in epic, with my inclusion of the Silver Surfer story, 'Parable', in the Moebius torrent being a notable exception.\n\nHope you found some things you'd never heard of and reconnected with a youthful favorite or two. Please keep these torrents alive so that others may enjoy them!\n\nGot an oddity or two to upload next, another Marvel project after that, and then some small publisher projects, like Eclipse and First. I'll be asking for help on those two, tracking down titles that no longer seem to be around on the interwebs. So if you have any lesser-known series from those two burned to disc or languishing on an external drive, OR access to sites that I can't get to, please make notes and between us, we'll see if we can't shine a light on some old favorites.\n","torrent":{"xt":"urn:btih:0e2ef64c5f8d5c9f85499acbf6b3ad30b9c2fa45","amp;dn":"Epic+Leftovers+%28epic+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e2ef64c5f8d5c9f85499acbf6b3ad30b9c2fa45","infoHashBuffer":{"type":"Buffer","data":[14,46,246,76,95,141,92,159,133,73,154,203,246,179,173,48,185,194,250,69]},"announce":[],"urlList":[]}}