{"title":"MJ O'Shea Rock Bay Series 1-3 plus Catch My Breath (fixed)","uid":10583074,"size":923792973,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0ecfbdeb553e4a1cfdefe2d86b14ef20355554bb&amp;dn=MJ+O%27Shea+Rock+Bay+Series+1-3+plus+Catch+My+Breath+%28fixed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"katelynor","files":5,"time":1405714243,"description":"Coming Home: Rock Bay, Book 1\n\nTallis Carrington ruled Rock Bay with his gang of jocks and an iron fist-until a scandal destroyed his family's name. Ten years later Tallis is dead broke, newly homeless, and on the walk of shame to end all walks of shame.\n\nHe needs money and needs it fast, and Rock Bay is the only home he knows. But the people of Rock Bay haven't forgotten him-or the spoiled brat he used to be. The only person in town willing to overlook his past is Lex, the new coffee shop owner, who offers Tally a job even though he appears to despise Tally based on his reputation alone.\n\n\nLetting Go: Rock Bay, Book 2 \n\n\nDrew McAuliffe has lived in the small town of Rock Bay most of his adult life. He'd like to be happy, but not at the cost of having his private life under his nosy neighbors' microscope, so he keeps his bisexuality under wraps. After a messy breakup that caused him to pack up and move to Astoria, on the Oregon coast, Mason Anderson decides to avoid drama of the romantic kind. All he wants is to start over - alone...\n\nFinding Shelter: Rock Bay, Book 3 \n\nJustin Foster has 19 years of nothing but trouble behind him. After escaping his abusive father, he finds himself in Rock Bay, Washington, with his cousin Travis. Justin is bruised and has a hard time trusting, but with the help of his family and the small town, he might be able to heal. Logan O'Brien is also new in town, hoping he can finally get away from his past and the memories of the girlfriend who shattered his heart. It doesn't take him long to realize Rock Bay can be more than safe harbor: It can also be home. \n\nCatch My Breath\n\nDanny Bright was born to entertain. He just needs his big break. So when he hears that Blue Horizon Records is holding auditions looking for the next big thing, Danny jumps at the chance. It doesn't turn out exactly as he imagined, though. Instead of getting solo contracts, Danny and four other guys are put into a boy band. Innocent, idealistic Elliot Price thinks he's headed for college. An impulsive decision to sing in the local talent search changes all that. A bigwig producer happens to see him, hands him a business card, and turns Elliot's life upside down. ","torrent":{"xt":"urn:btih:0ecfbdeb553e4a1cfdefe2d86b14ef20355554bb","amp;dn":"MJ+O%27Shea+Rock+Bay+Series+1-3+plus+Catch+My+Breath+%28fixed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ecfbdeb553e4a1cfdefe2d86b14ef20355554bb","infoHashBuffer":{"type":"Buffer","data":[14,207,189,235,85,62,74,28,253,239,226,216,107,20,239,32,53,85,84,187]},"announce":[],"urlList":[]}}