{"title":"Key's To Tulsa [1996] Cameron Diaz Deborah Unger","uid":6600734,"size":736029569,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:10035c8291ea95d93717cbb6a0a239f36adaadbb&amp;dn=Key%5C%27s+To+Tulsa+%5B1996%5D+Cameron+Diaz+Deborah+Unger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Hard2Find2","files":5,"time":1313194189,"description":"Plot- The story revolves around a perpetual loser named Richter Boudreau (Eric Stoltz). Richter is from a privileged background in Tulsa, Oklahoma and works as a movie reviewer at a local newspaper only because his sour mother Cynthia (Mary Tyler Moore) pulled strings for him to land the job. He is dissatisfied with the direction that his life has taken; he is about to be fired from his job because he can't meet deadlines, lives in a dilapidated farmhouse, does drugs behind the scenes, and is so behind on his bills that his electricity has been cut off.\n\nRichter also owes money to Ronnie Stover (James Spader), an abusive drug dealer. Ronnie is married to Vicky (Deborah Kara Unger), a beautiful woman who was disowned by her socially prominent family for her involvement with Ronnie. Richter is still in love with Vicky despite having ended their relationship years before. Vicky is the sister of Keith (Michael Rooker), a misogynistic alcoholic whose large inheritance fails to soothe his anger, loneliness, and depression. Cherry (Joanna Going) is an exotic dancer from Chicago who buys drugs from Ronnie and gets romantically involved with Richter.\n\nRonnie plans to blackmail Bedford Shaw (Marco Perella), the son of a socially prominent businessman named Harmon Shaw (James Coburn), after Cherry tells him that Shaw murdered her friend, a stripper/prostitute, in a motel room and that she took photographs. Ronnie attempts to involve Richter by having him hold onto a mysterious black pouch and by exploiting Richter's newspaper connections. Richter wants no part of the blackmail scheme. But he gets in over his head when Keith discovers that Richter has been sleeping with Vicky. Source:DVD File type: AVI/XVIDResolution: 528x400 English with *NO* Subs included In Stereo Tested with VLC and WDTV player\n\n","torrent":{"xt":"urn:btih:10035c8291ea95d93717cbb6a0a239f36adaadbb","amp;dn":"Key%5C%27s+To+Tulsa+%5B1996%5D+Cameron+Diaz+Deborah+Unger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10035c8291ea95d93717cbb6a0a239f36adaadbb","infoHashBuffer":{"type":"Buffer","data":[16,3,92,130,145,234,149,217,55,23,203,182,160,162,57,243,106,218,173,187]},"announce":[],"urlList":[]}}