{"title":"Rabab El-Mahdi - Egypt. The Moment of Change [2009][A]","uid":10397470,"size":1775530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10e3c3b50cd8840d5952c530192f16c423258ecd&amp;dn=Rabab+El-Mahdi+-+Egypt.+The+Moment+of+Change+%5B2009%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1403287462,"description":"Description\nProduct Details\nBook Title: Egypt: The Moment of Change\t\nBook Author: Rabab El Mahdi, Philip Marfleet\nHardcover: 208 pages\nPublisher: Zed Books (December 8, 2009)\nLanguage: English\nISBN-10: 1848130201\nISBN-13: 978-1848130203\n\n===================================================================================\nBook Description\nRelease date: December 8, 2009 | ISBN-10: 1848130201 | ISBN-13: 978-1848130203\nMillions of Egyptians have demonstrated in Cairo's Tahrir Square to claim freedom after 30 years of oppression and autocracy, while Western commentators marvel about the timing and causes of what will soon be known as the Egyptian Revolution of 2011.\nWith remarkable foresight, Zed authors Rabab El-Mahdi and Philip Marfleet compiled a book in late 2009 explaining not only what political, economic, and societal factors led to the current uprising, but also why it is no coincidence that it happens now. Prophetically entitled Egypt: The Moment of Change, it meticulously describes the growing internal pressures the Mubarak regime faced over the last years, including chapters on the omnipresent torture, the role of Islamism in the society, and the budding social movements for democratic change in Egypt.\nNow that the change is happening, Egypt: The Moment of Change is the only book on the market to accessibly examine contemporary Egyptian society. With many of the chapters written by Egyptian academics and activists who are now on the very first line of the barricades, this is the one book that has all the answers.\n\n===================================================================================\nReviews\n'Combines passion, scholarship and vision - a focused snapshot of this troubled moment in Egypt's history with a competent resume of how we got here. Its passion, clarity of thought and its vision should be an important contribution to the change we Egyptians know we have to make happen.' - Ahdaf Soueif\n\n'Egypt is often referred to in the Western media as &quot;a moderate Arab state&quot; solely on the grounds of its friendly relations with the United States and Israel. But there is nothing moderate about its poverty, corruption, and political repression, as this book so ably demonstrates. Egypt: The Moment of Change is a valuable contribution to understanding the uncertain predicament of this important country.' - Talal Asad, City University of New York, Graduate Center\n\n'The Editors produced an excellent and needed work, on that will certainly fill a void in the literature. In highlighting the basic issues in a straightforward manner and bringing these distinguished scholars together under one cover while at the same time, keeping their aims and discourse clear throughout the text, all involved in this project deserve our appreciation. This is one of the most up to date, critical, but academic, and well balanced work on today's Egypt. For anyone and everyone interested in Egyptian or Middle Eastern politics and society, this is the book to read.' - Tareq Ismael, Professor of Political Science, University of Calgary\n\n===================================================================================\nAbout the Author\nRabab El Mahdi is Assistant Professor of Political Science at The American University in Cairo.\nPhilip Marfleet is Reader in Social Sciences at the University of East London.\n===================================================================================","torrent":{"xt":"urn:btih:10e3c3b50cd8840d5952c530192f16c423258ecd","amp;dn":"Rabab+El-Mahdi+-+Egypt.+The+Moment+of+Change+%5B2009%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10e3c3b50cd8840d5952c530192f16c423258ecd","infoHashBuffer":{"type":"Buffer","data":[16,227,195,181,12,216,132,13,89,82,197,48,25,47,22,196,35,37,142,205]},"announce":[],"urlList":[]}}