{"title":"Encyclopedia of Computer Science and Technology","uid":4716580,"size":9208416,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10f83d4bca083873555ce5b5a7d4bfb2b16286af&amp;dn=Encyclopedia+of+Computer+Science+and+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":1,"time":1234301905,"description":"This encyclopedia focuses on computers and issues related to computers. More than 400 entries, arranged alphabetically, provide information on hardware, software, computer languages, operating systems, applications, the Internet, key individuals, and social issues such as the digital divide. With a limited number of entries, topic selection appears based on popularity. For example, Microsoft Windows gets a three-page main entry, while the Macintosh operating system is only mentioned within articles related to Macintosh (e.g., Jobs, Steven Paul). \nArticles average about a page in length. The longest, History of computing, stretches to just over four pages. All articles have a list of further readings, usually two to eight items, often including Web sites. Citations for books and articles are current, with several from 2002. \nArticles on various computer languages might be too technical for the novice computer user. For example, the article on C++ provides sample code. On the other hand, articles on hardware seem tailored for the beginner. Mouse traces the development of the mouse, includes a diagram of a mechanical mouse, and has statements such as &quot;Activating a button is called clicking.&quot; As a result, both beginners and more experienced computer users should find this resource helpful. \nThe 167 black-and-white illustrations include charts, drawings, flowcharts, photographs, and screen shots. Four appendixes include a list of bibliographic guides (both print and Web based) to the computer field, a chronology of computing, important awards, and computer-related organizations. The encyclopedia also offers a listing of entries by general category in the front and a keyword index in the back. \nThe strength of this resource is its currency. It makes a nice supplement to older works such as the Encyclopedia of Computers and Computer History (Fitzroy Dearborn, 2001), the Encyclopedia of Computer Science (4th ed., Grove's Dictionaries, 2000), and the World of Computer Science (Gale, 2002). Recommended for high-school, public, and academic libraries.","torrent":{"xt":"urn:btih:10f83d4bca083873555ce5b5a7d4bfb2b16286af","amp;dn":"Encyclopedia+of+Computer+Science+and+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10f83d4bca083873555ce5b5a7d4bfb2b16286af","infoHashBuffer":{"type":"Buffer","data":[16,248,61,75,202,8,56,115,85,92,229,181,167,212,191,178,177,98,134,175]},"announce":[],"urlList":[]}}