{"title":"Legend [PAL][SLES-00730] (PS1)","uid":11150113,"size":511495812,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:1107bdf47d256a1a2de9a1990a9a2b31a650025e&amp;dn=Legend+%5BPAL%5D%5BSLES-00730%5D+%28PS1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TerminatorFan","files":19,"time":1412328824,"description":"Official Title: Legend\nCommon Title: Legend\nSerial Number(s): SLES-00730\nRegion: PAL\nLanguages: English\nGenre / Style: Beat'em up\nDeveloper: Toka\nPublisher: Funsoft\nDate Released: 15 December 1998\n\nLegend is a 3D Beat-em-up game released on the Sony Playstation in 1998. It is a remake of the Super Nintendo game of the same name, Legend. It was developed by Toka, which included the same two key members who created the original Legend, Carlo Perconti and Lyes Belaidouni.\n\nSTORY:\n\nThere is chaos and despair in the kingdom of Tovakia. The King's felonious brother has been exiled to live as an outlaw in the outer rims of the world after several violent attempts of assassinating the King and take over the throne. Saturated with hate and greed the brother will not remain in oblivion for long. He attends a Dark Sorcerer to learn the powers of evil and black magic. The King shall not feel safe for long. \n\nAfter years of studies the evil brother himself becomes a Dark Sorceror and is ready to stand up against his brother which he hates with all of his cold heart. But he can not do it alone. He needs an army, a force of warriors to break through the defences of his brother. He therefore turns to Morlock the Soulthief for help and support. The evil demons agrees to the vicious schemes of the King's brother under one circumstance: All souls in the kingdom will for eternity belong to Morlock for his personal satisfaction. Being so Morlock and the evil brother become allies. Allies in blood. Already an evil and sinister plan was forming in the heads of the rulers of darkness. \n\nLater in the castle of the King the loyal life guards Axel, Tara and Karo stand guard in front of the door to the throne room. Suddenly they hear a deafening noise and the King's cry for help. Swiftly they turn around and knock the door open with their weapons just in time to see a hideous gargoyle standing with the King in its arms. As Axel moves forward to stop the gargoyle two monsters step out of the dark and attack the fearless trio. In the meantime the gargoyle gets away with the motionless body of the King. After a short bloody battle Axel, Tara and Karo are standing alone in the throne room of the King looking out of the scattered window where they can see the shape of the gargoyle vanishing in the horizon. \n\nDark times are coming and Axel, Tara and Karo prepare themselves for a quest. The quest to find the King and to destroy the evil alliance of the felonious brother and Morlock the Soulthief.\n\nCHARACTERS:\n\n* Axel: The average all-around character. Good with every weapon. \n* Tara: A fast character. Good with light weapons. \n* Karo: A strong but slow character. Good with heavy weapons.\n\nManufacturer's description:\n\nLet the legend begin.\nThe King has been kidnapped by Morlock the Soulthief an ally of the King's evil brother.You have to control the King's lifeguards Axel,Kara and Tano in an attempt to rescue the King from the clutches of evil and restore peace and order to the Kingdom of Tokavia.\n\nIncludes cover (front &amp; back)\nLoad cue with Imgburn and burn at 4x speed* \nBurn speed may depend on your brand of CD-R's and what your playstation will accept.\n\n\nThanks goes to skullz613 for providing us this copy.\n\n\nEnjoy &amp; Please Seed! (Extremely rare PS1 game!)","torrent":{"xt":"urn:btih:1107bdf47d256a1a2de9a1990a9a2b31a650025e","amp;dn":"Legend+%5BPAL%5D%5BSLES-00730%5D+%28PS1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1107bdf47d256a1a2de9a1990a9a2b31a650025e","infoHashBuffer":{"type":"Buffer","data":[17,7,189,244,125,37,106,26,45,233,161,153,10,154,43,49,166,80,2,94]},"announce":[],"urlList":[]}}