{"title":"Rampage - Veil of Mourn [FLAC + DVD]","uid":9455645,"size":4915598912,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:11290c33e363733f5d236c95b7739eda980567ce&amp;dn=Rampage+-+Veil+of+Mourn+%5BFLAC+%2B+DVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1389266344,"description":"Originally released in small quantities back in 1988 and long out of print for many years later, Rampage's sole LP &quot;Veil of Mourn&quot; was quite the sought after rarity for Thrash Metal enthusiasts and in 2011, Chinese record label AreaDeath Productions answered the call and released this glorious deluxe reissue for many to enjoy.\n\nContaining both a lossless rip of the expanded album and a burnable single layer DVD rip of the DVD, this torrent makes this reissue a lot easier for some to obtain, as well as to ensure this album continues to get exposure in the best quality available once this release goes out of print itself.\n\nThe CD was ripped in EAC and encoded in FLAC while the DVD was ripped in DVD Shrink and stripped of any unnecessary region coding in DVD Decryptor so many can burn it and watch the two ultra rare live performances of this band back when they existed in this mortal plane.\n\nAnyhow, enjoy this classic and look forward for more upcoming lossless rips including Florida based cult death metal band Dead's 2013 double disc compilation &quot;Hell's Morbid Disciples of Hate&quot; and a much needed lossless rip of Chakal's 2013 release '&quot;Destroy! Destroy! Destroy!&quot; in the upcoming weeks. They are must haves! \n\nI also have some other lossless rips I have yet to upload but have laying around in my PC, such as Japanese pressings of Shadows Falls' &quot;The Art of Balance&quot; and &quot;The War Within&quot; and the complete studio discography of the obscure German metal act Colour Trip, so be on the watch for those as well and more.\n\nNonetheless, ENJOY THE MUSIC!","torrent":{"xt":"urn:btih:11290c33e363733f5d236c95b7739eda980567ce","amp;dn":"Rampage+-+Veil+of+Mourn+%5BFLAC+%2B+DVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11290c33e363733f5d236c95b7739eda980567ce","infoHashBuffer":{"type":"Buffer","data":[17,41,12,51,227,99,115,63,93,35,108,149,183,115,158,218,152,5,103,206]},"announce":[],"urlList":[]}}