{"title":"Anorexia Nervosa - 2005.10.20 Live in Ostrava Prostor CZ","uid":4975904,"size":2106615808,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:113333041101f115436bad245d288c885b80a1e9&amp;dn=Anorexia+Nervosa+-+2005.10.20+Live+in+Ostrava+Prostor+CZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nocksu","files":9,"time":1245997450,"description":"Anorexia Nervosa was born in the middle of the '90s from the ashes of a death metal band called Necromancia whose line-up consisted of Stefan Bayle (guitar), Marc ZabÃƒÂ© (guitar), Pier Couquet (bass), Nilcas Vant (drums) and StÃƒÂ©phane Gerbaud (vocals). At that time, the band was playing industrial death metal with elements of dark wave which gave it ambiance.\n\nThe band produced their first demo, Garden of Delight, in 1993 when the band was still known as Necromancia. But it wasn't until 1995 when the band released their second demo, Nihil Negativum, that gave Anorexia Nervosa its place in the underground world. The demo featured the dark, industrial atmosphere that their album Exile was later known for. Twelve-hundred copies were sold.\n\nDuring a concert in the south of France, Michael Berberian, from Season of Mist Records, noticed the band and offered them a contract for an album.\n\nThe band's debut album, Exile, was released in 1997. Reminiscent of their previous work, Nihil Negativum, Exile had an eerily industrial sound to it, and often switched between fast tempos and thrashing guitars back to a slow, ambient style consisting of only a &quot;white noise&quot;-like sound lightly draped over grim vocals. Not only was the album unique in the history of the band, but in the entire black metal genre itself. Being a concept album, Exile based itself on themes of neurosis and experimentation on madness. Twenty-four hundred copies of the album were sold, allowing access to a larger audience and onto a series of concerts with Cradle of Filth, Absu, Misanthrope, etc.\n\nFollowing the release of Exile, the band began to take a new direction in their music, following the departure of StÃƒÂ©phane Gerbaud (Vocals) and Marc ZabÃƒÂ© (Guitar) in 1998 due to musical differences. The group then welcomed the charismatic Rose Hreidmarr (Vocals) and Neb Xort (Keyboard). They refined their style to be very fast, hysterical and powerfully orchestrated to reflect the true &quot;Dark Nihilistic Metal&quot;.\n\nIn 1999, the band recorded the Sodomizing the Archedangel EP at the band's own Drudenhaus Studio. This album was meant to be a preview of what was soon to come from the band, and allowed them to sign a contract with extreme metal label Osmose Productions.\n\nSoon afterwards, the band headed back to the studio to record their second album, Drudenhaus. The album, which proved to be a huge success for the band, was released in March 2000 and featured the violent style which was seen on the Sodomizing the Archedangel EP.\n\nFurther evolving the style was their 2001 release, New Obscurantis Order, which proved to be their most groundbreaking release to date, involving even faster tempos, more polished orchestrations and an all-around more violent sound.\n\nTheir fourth album, Redemption Process, was released in October 2004 after they switched to their new label, Listenable Records. The album is not as frantic as New Obscurantis Order, but features richer orchestrations and more of a &quot;raw&quot; sound. Redemption Process is a concept album that focuses on lyrics about finding redemption.\n\nApproximately one year later, the band released The September E.P. which features a director's cut of Sister September, three cover tracks, and four live tracks. The EP was released to be a &quot;goodie&quot; from the band until they are ready to record their next studio album.\n\nOn December 20, 2005, (Vocalist) Rose Hreidmarr quit the band. His statement on the matter reads as follows:\n\nLeaving Anorexia Nervosa was definitely not the easiest thing to do as we've shared so much during our time together as this band had become a vivid part of my daily life. For seven years, the band has been giving me so many opportunities on a musical and human level and has heavily contributed to become the person I'm today. Still, I honestly thought I had reached the end of a personal era with the album 'Redemption Process' and I now feel the need to take a different path. I'm also absolutely proud of what I have been able to achieve with the rest of the band members who will always remain my best friends and I wish them the very best for the future.\n\nSoon afterwards, the remaining band members held auditions for a new singer, but failure to find a replacement has caused (Guitarist) Stefan Bayle to put the band in &quot;stand-by&quot; mode, fearing the group may become &quot;some sort of parody&quot; of itself. It remains unknown when, or if the band may resurface.\n\nSince his departure from Anorexia Nervosa, Rose Hreidmarr has been singer for The Cosa Nostra Klub, a black/industrial metal band.","torrent":{"xt":"urn:btih:113333041101f115436bad245d288c885b80a1e9","amp;dn":"Anorexia+Nervosa+-+2005.10.20+Live+in+Ostrava+Prostor+CZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"113333041101f115436bad245d288c885b80a1e9","infoHashBuffer":{"type":"Buffer","data":[17,51,51,4,17,1,241,21,67,107,173,36,93,40,140,136,91,128,161,233]},"announce":[],"urlList":[]}}