{"title":"The.Vampire.Diaries.S01E17.H264[quark]","uid":5487648,"size":46491495,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1153be788e41152646f810613a1a645d72cee1b7&amp;dn=The.Vampire.Diaries.S01E17.H264%5Bquark%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twentyforty","files":1,"time":1270818637,"description":"EXPERIMENTAL, just to demonstrate now small file-size could be.\nDO NOT download if you watch on high resolution TV or monitors.\nNOT for handhelds or phones, just computers. \nPlayable in VLC, WMP and MPC with CoreCodec and DivX 7 AAC DShow filter, \nmplayer, KMplayer and of course, in QuckTime Player.\nHowever, picture is better than 90% of CAMs and definitely watchable.\nPLEASE, think about the ones who have Internet but cannot afford download of big files.\nEvery day I have 10% of my peers on dial-up and ancient hardware who need whole day to download a &quot;normal&quot; sized 350MB.\nPlease, I beg you for understanding of my work, let them through and if you can - help them by downloading and seeding afterward as long as you can. These people have slow download and it helps them a lot (please, be generous - on such file having ratio 15:1 is like 1:1 on normal-sized XviD).. \nThank you.\n\n*******************************************************************************\n\nQuarks are point particles (no size) unlike protons and neutrons. \nProtons and neutrons are made of quarks. Quarks come in different types. There are six different types: up, down, charm, strange, top and bottom. For example, a proton is comprised of two up quarks and one down quark. Quarks have electric charge, color charge, spin and mass. But they have no internal structure, they behave like mathematical points.\n\nElectrons are members of the lepton family. Like the quarks, leptons are also point particles. \n\n","torrent":{"xt":"urn:btih:1153be788e41152646f810613a1a645d72cee1b7","amp;dn":"The.Vampire.Diaries.S01E17.H264%5Bquark%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1153be788e41152646f810613a1a645d72cee1b7","infoHashBuffer":{"type":"Buffer","data":[17,83,190,120,142,65,21,38,70,248,16,97,58,26,100,93,114,206,225,183]},"announce":[],"urlList":[]}}