{"title":"Pippa Wright - Lizzy Harrison Loses Control - Barbie1710","uid":7799329,"size":843220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11bdaabc2cd8d3bbaf558264927406a532111b38&amp;dn=Pippa+Wright+-+Lizzy+Harrison+Loses+Control+-+Barbie1710&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Barbie1710","files":7,"time":1352238912,"description":"Pippa Wright - Lizzy Harrison Loses Control - ePub, MOBI - Barbie1710\n\n'Have you ever noticed that the modern romantic heroine can be, not to put too fine a point on it, a bit useless?' Lizzy Harrison has everything under control Lizzy Harrison isn't a romantic heroine. Not even close. She doesn't have a cat, owns no more shoes than the average person, and is in no way hopelessly scatty and disorganised. In fact her life is in perfect order, and that's just how she likes it. Okay, so she hasn't met the right man yet, but she really doesn't have the time what with her busy job in PR and her packed schedule of improving activities. Her diary is planned months in advance and she's determined that nothing spontaneous will force its way into her life...hasn't she? But when her best friend Lulu questions her need for control, Lizzy starts to wonder if she needs to let go a little. So when she's thrown into the arms of her boss' number one client, notorious comedian (and love-rat) Randy Jones, she reluctantly relaxes her hold on routine. Lizzy Harrison is about to find out that losing control could win her more than she had ever imagined.\n\n\nThis is a multi-tracker torrent.  Please check your Bit-Torrent client for the true number of seeds.  Enjoy &amp; Please Seed","torrent":{"xt":"urn:btih:11bdaabc2cd8d3bbaf558264927406a532111b38","amp;dn":"Pippa+Wright+-+Lizzy+Harrison+Loses+Control+-+Barbie1710","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11bdaabc2cd8d3bbaf558264927406a532111b38","infoHashBuffer":{"type":"Buffer","data":[17,189,170,188,44,216,211,187,175,85,130,100,146,116,6,165,50,17,27,56]},"announce":[],"urlList":[]}}