{"title":"Bach's Toccata in D Minor on Classic Organ and Bell Telephone","uid":3819805,"size":520331722,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:14909f026310fc7ef6cca39fdae7349551919ed0&amp;dn=Bach%5C%27s+Toccata+in+D+Minor+on+Classic+Organ+and+Bell+Telephone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"griffie","files":44,"time":1190765366,"description":"If you&amp;#039;ve recently downloaded this from another torrent site, please download this one and re-start. This torrent contains a new tracker to replace the one that is down.\n\nTwo unusual pieces from the LP age that will probably never show up on CD:\n\nJohann Sebastian Bach&amp;#039;s Toccata (and Fugue) in D Minor as played by E. Power Biggs on 14 notable European Organs of the past five centuries, and The Science of Sound as presented by the Bell Telephone Laboratories.\n\nToccata and Fugue in D Minor is probably one of the most recognizable pieces of music. The mad scientist always has a giant organ in his manor, and he always plays this piece while shouting &quot;Fools! I&amp;#039;ll Destroy Them All!!!&quot; Well, maybe not, but you can&amp;#039;t argue that this is a noteworthy piece of music. Here are 14 different versions, as played by E. Power Biggs on 14 different classical and modern cathedral organs in Sweden, Germany, Denmark, Holland and England. While they all may be the same piece, the differences in tonal quality and scaling (some to the point where it saturates the low end of the tape being used to record) make this album something that&amp;#039;s worth at least a listen to.\n\nThe Science of Sound, as presented by Bell Telephone Laboratories, is one of Ma Bell&amp;#039;s many contributions to the understanding of how we interact with and use sound in everyday living. Before AT&amp;T became nothing more than a creaky old shell of itself, it used to be a regulated giant that had to pour a lot of it&amp;#039;s profits back into research and development. Since Ma was interested in transmitting sound, she studied it a lot. This LP presents some of that research, such as how we hear, pitch and frequency relations, and the effects of filtering on music and speech comprehension. Still pretty relevant, even today, although the chances of Ma ever turning out something like this is as remote as the proverbial snowball&amp;#039;s chances in...well, you know where.\n\nPresented in Glorious &quot;Mega-Wav&quot; technology, these audio files are ripped directly from LP and brought to you. Enjoy. LP rip - .wav format.\n\n\n\n\nYou ever wonder how the mad scientist pays for all that equipment?","torrent":{"xt":"urn:btih:14909f026310fc7ef6cca39fdae7349551919ed0","amp;dn":"Bach%5C%27s+Toccata+in+D+Minor+on+Classic+Organ+and+Bell+Telephone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14909f026310fc7ef6cca39fdae7349551919ed0","infoHashBuffer":{"type":"Buffer","data":[20,144,159,2,99,16,252,126,246,204,163,159,218,231,52,149,81,145,158,208]},"announce":[],"urlList":[]}}