{"title":"NuruMassage - Jasmine Jae (Moms Day Job) NEW 06 November 2015","uid":12704805,"size":297880901,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:14e4712016f514167ec0b55ffc8dc287595e2d7d&amp;dn=NuruMassage+-+Jasmine+Jae+%28Moms+Day+Job%29+NEW+06+November+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1446818038,"description":"Today at the Nuru Massage, Jasmine Jae receives her regular client, Ryan Rider but has a very special day set up for him. She invites him outside where she prepared his treatment with a wonderful and relaxing view of LA's skyline. Jasmine removes her bathrobe, exposing her massive boobs which Ryan is eager to touch. Lying down on the massage bed, Jasmine smothers Ryan's back with Nuru gel, gliding her hands and chest up and down his bare back, captivated by her skills. Having Ryan turn around, she focuses her lips on his, embracing one another in passion. Ryan waits with anticipation for his full release massage, craving Jasmines lips on his cock. Jasmine's hands glide over his hard cock as she promises to get rid of all his stress with her epic blowjobs and inner vaginal massage. Unfortunately, Jasmine didn't expect her stepson, Brad Knight to show up at her house today. All came to a halt when Brad walks in, and catches her mom having sex with a stranger. Ryan runs off afraid he is in deep trouble, but this didn't bother Jasmine all to much, she sees this as an opportunity to carry through her all time fantasy; to fuck her stepson.\r\nTags: Big Tits, Body Massage, Handjob, Blowjob, Deepthroat, Hardcore, Body Sliding, Massage, Nuru Gel, Outdoor, Cum on Pussy, Stepmom, Family Roleplay\r\n \nhttp://imgdone.com/viewer.php?file=41649101055874307770.jpg\r\n \nhttp://imgdone.com/viewer.php?file=79013612517843772641.jpg","torrent":{"xt":"urn:btih:14e4712016f514167ec0b55ffc8dc287595e2d7d","amp;dn":"NuruMassage+-+Jasmine+Jae+%28Moms+Day+Job%29+NEW+06+November+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14e4712016f514167ec0b55ffc8dc287595e2d7d","infoHashBuffer":{"type":"Buffer","data":[20,228,113,32,22,245,20,22,126,192,181,95,252,141,194,135,89,94,45,125]},"announce":[],"urlList":[]}}