{"title":"Mr.Skeffington.1944.DVDRip-XviD-rmrocha912","uid":4820004,"size":1462282240,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:14f7338e6e989a8a4972a805dccee2597621d1ac&amp;dn=Mr.Skeffington.1944.DVDRip-XviD-rmrocha912&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"rmrocha","files":2,"time":1238729133,"description":"Mr. Skeffington is a 1944 drama film which portrays a woman whose many love affairs cost her the love of her husband and her daughter. It stars Bette Davis, Claude Rains, Walter Abel, George Coulouris and Richard Waring. The movie was adapted by Julius J. Epstein and Philip G. Epstein from the novel by Elizabeth von Arnim and was directed by Vincent Sherman.\n\n\nPlot\n\n\nIn 1914, spoiled Fanny Trellis (Bette Davis) is a renowned beauty, with many suitors. She loves her brother Trippy (Richard Waring) and would do anything to help him. When Fanny learns that Trippy has embezzled money from his Jewish stockbroker employer Job Skeffington (Claude Rains), she marries the lovestruck businessman in order to save her brother. Disgusted by the arrangement, Trippy leaves home to fight in the Lafayette Escadrille in World War I.\nJob loves Fanny, but she all but ignores him. She becomes pregnant with his child, but, when Trippy dies in France, she blames him and leaves his bed. She enjoys playing the wealthy socialite, stringing along a persistent quartet of suitors who are unfazed by her marriage, as well as much younger lovers. Lonely, Job finds solace with his secretaries. When Fanny finds out, she divorces him, conveniently ignoring her own behavior. Her daughter, also called Fanny, prefers her father and begs him to take her with him to Europe. When he agrees, Fanny is relieved to be free of the encumbrance. Fanny has a series of affairs, living well on the extremely generous settlement Job has left her and not giving a thought to her daughter, whom she does not see for years.\nShe retains her beauty as she grows older (much to the envy of her women acquaintances), but when she catches diphtheria, it ravages her appearance. In denial, she invites her old lovers (and their wives) to a party. The men are shocked (and the women relieved) by how much Fanny has changed, leaving her distraught. Ironically, her latest young suitor Johnny Mitchell (Johnny Mitchell) falls in love with her plainer, but infinitely kinder daughter (played as an adult by Marjorie Riordan), who has returned from Europe because of the rise of the Nazis. They marry and leave Fanny alone.\nJob is imprisoned in a German concentration camp, where he is blinded. Somehow, he survives the ordeal and returns to the United States penniless. Their life-long friend and Fanny's cousin, George Trellis (Walter Abel), brings him to Fanny's home and calls on her to show mercy on him. Initially reluctant to see him, she is moved to tears by his blinded state and enduring love. Job once told Fanny that, &quot;No woman is beautiful until she is loved.&quot; George tells Fanny that, at that moment, she has never been more beautiful. And at long last, she realizes the truth of it.\n\n\n\n\n\nDirected by..........Vincent Sherman\n\nProduced by..........Julius J. Epstein\n                     Philip G. Epstein\n                     Jack L. Warner\n\nWritten by...........Elizabeth von Arnim\n                     Julius J. Epstein\n                     Philip G. Epstein\n\nStarring.............Bette Davis\n                     Claude Rains\n","torrent":{"xt":"urn:btih:14f7338e6e989a8a4972a805dccee2597621d1ac","amp;dn":"Mr.Skeffington.1944.DVDRip-XviD-rmrocha912","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14f7338e6e989a8a4972a805dccee2597621d1ac","infoHashBuffer":{"type":"Buffer","data":[20,247,51,142,110,152,154,138,73,114,168,5,220,206,226,89,118,33,209,172]},"announce":[],"urlList":[]}}