{"title":"Critical Mass: How One Thing Leads to Another","uid":12566559,"size":3221843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15962252e2d3bf3b7a47d7305f363d88ed851317&amp;dn=Critical+Mass%3A+How+One+Thing+Leads+to+Another&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1444786995,"description":"Critical Mass: How One Thing Leads to Another by Philip Ball\r\n\r\nOverview: Are there &quot;natural laws&quot; that govern the ways in which humans behave and organize themselves, just as there are physical laws that govern the motions of atoms and planets? Unlikely as it may seem, such laws now seem to be emerging from attempts to bring the tools and concepts of physics into the social sciences.\r\nThese new discoveries are part of an old tradition. In the seventeenth century the philosopher Thomas Hobbes, dismayed by the impending civil war in England, decided that he would work out what kind of government was needed for a stable society. His solution sparked a new way of thinking about human behavior in looking for the &quot;scientific&quot; rules of society.\r\n\r\nAdam Smith, Immanuel Kant, Auguste Comte, and John Stuart Mill pursued this idea from different political perspectives. But these philosophers lacked the tools that modern physics can now bring to bear on the matter. Philip Ball shows how, by using these tools, we can understand many aspects of mass human behavior. Once we recognize that we do not make most of our decisions in isolation but are affected by what others decide, we can start to discern a surprising and perhaps even disturbing predictability in our laws, institutions, and customs","torrent":{"xt":"urn:btih:15962252e2d3bf3b7a47d7305f363d88ed851317","amp;dn":"Critical+Mass%3A+How+One+Thing+Leads+to+Another","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15962252e2d3bf3b7a47d7305f363d88ed851317","infoHashBuffer":{"type":"Buffer","data":[21,150,34,82,226,211,191,59,122,71,215,48,95,54,61,136,237,133,19,23]},"announce":[],"urlList":[]}}