{"title":"Alice In Chains - Rooster","uid":4679714,"size":228952068,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1621a9bb2661d938b2550cd619da7208c7755339&amp;dn=Alice+In+Chains+-+Rooster&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1233029153,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Rooster&quot; is a popular single by the grunge group Alice in Chains. The song was released in 1993 and is featured on their second, full-length studio album, Dirt. It was written by guitarist Jerry Cantrell for his father, who served in the Vietnam War. His nickname was &quot;Rooster.&quot; It is unknown where the nickname originated, but there is speculation that it may have been in relation to the 101st Airborne Division, in which Cantrell's father served. The 101st Airborne wore patches on their arms featuring a bald eagle. There are no bald eagles in Vietnam, so the closest thing to which the Vietnamese could reference them was the chicken. They referred to them as &quot;chicken men&quot;.\n\nJerry Cantrell has stated in an interview that Rooster was the nickname given to his father as a boy growing up in the south where it was common to have a nickname.\n\nThe music video featured brutality and violence visually reminiscent of Apocalypse Now.\n\nJerry Cantrell on the song, from the liner notes of 1999's Music Bank box set collection:\n\n&quot;It was the start of the healing process between my Dad and I from all that damage that Vietnam caused. This was all my perception of his experiences out there. The first time I ever heard him talk about it was when we made the video and he did a 45 minute interview with Mark Pellington and I was amazed he did it. He was totally cool, totally calm, accepted it all and had a good time doing it. It even brought him to the point of tears. It was beautiful. He said it was a weird experience, a sad experience and he hoped that nobody else had to go through it.&quot;\n\nLater comments: &quot;I think there's some vibe on the demo that maybe we didn't get here (on Dirt), but this has something all of its own... quality, for one thing.&quot;\n\nCantrell's father joined Alice in Chains during &quot;Rooster&quot; on stage for the October 18, 2007 show in Tulsa, at Cain's Ballroom.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1621a9bb2661d938b2550cd619da7208c7755339","amp;dn":"Alice+In+Chains+-+Rooster","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1621a9bb2661d938b2550cd619da7208c7755339","infoHashBuffer":{"type":"Buffer","data":[22,33,169,187,38,97,217,56,178,85,12,214,25,218,114,8,199,117,83,57]},"announce":[],"urlList":[]}}