{"title":"MartinScorsese_TheBlues_03_TheRoadToMemphis.mp4","uid":10040349,"size":2047644354,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:165bc7c66ab466f5b014972b2c908010a917fd09&amp;dn=MartinScorsese_TheBlues_03_TheRoadToMemphis.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1398457406,"description":"THESE IS MP4 FORMAT :: ALL 7 DVDs HAVE BEEN RIPPED WITH Aimersoft DVD RIPPER AND ARE ALL UPLOADED HERE\n\nMORE HERE: http://www.pbs.org/theblues/\n\nProduct Details\nActors: John Mayall, Carl Lumbly, Taj Mahal, Mya\nProducers: Alex Gibney, Belinda Clasen, Belinda Morrison, Jeff Scheftel, Lisa Day\nFormat: Anamorphic, Box set, Black &amp; White, Color, Dolby, NTSC\nLanguage: English (Dolby Digital 5.1), English (PCM Stereo)\nRegion: Region 1 (U.S. and Canada only. Read more about DVD formats.)\nAspect Ratio: 1.85:1\nNumber of discs: 7\nRated: NR (Not Rated)\nStudio: Columbia / Legacy\nDVD Release Date: October 14, 2003\nRun Time: 780 minutes\nAverage Customer Review: 3.8 out of 5 stars  See all reviews (39 customer reviews)\nASIN: B0000CBHOI\n\nSpecial Features\nContains seven feature-length films:\nFeel Like Going Home directed by Martin Scorsese and written by Peter Guralnick\nThe Soul of a Man directed and written by Wim Wenders\nThe Road to Memphis directed by Richard Pearce and written by Robert Gordon\nWarming by the Devil's Fire directed and written by Charles Burnett\nGodfathers and Sons directed by Marc Levin\nRed, White &amp; Blues directed by Mike Figgis\nPiano Blues directed by Clint Eastwood\nOver three hours of special feature material:\nLive performances not seen in the film\nDirector commentaries\nOn-camera interviews with the directors\nDirector biographies and filmographies\nSpecial menu options to scan for all music performances\n\nEditorial Reviews\nIt may have been underrated when first broadcast on PBS on consecutive nights in the fall of '03, but executive producer Martin Scorsese's homage to the blues is a truly significant, if imperfect, achievement. &quot;Musical journey&quot; is an apt description, as Scorsese and the six other directors responsible for these seven approximately 90-minute films follow the blues--the foundation of jazz, soul, R&amp;B, and rock &amp; roll--from its African roots to its Mississippi Delta origins, up the river to Memphis and Chicago, then to New York, the United Kingdom, and beyond. Some of the films (like Wim Wenders's The Soul of a Man and Charles Burnett's Warming by the Devil's Fire) use extensive fictional film sequences, generally to good effect. There's also plenty of documentary footage, interviews, and contemporary studio performances recorded especially for these films.\nThe last are among the best aspects of the DVDs, as the bonus material features the set's only complete tunes. Lou Reed's &quot;See That My Grave Is Kept Clean&quot; and the ElektriK Mud Kats' (with Chuck D. of Public Enemy) hip-hop-cum-traditional updating of Muddy Waters's &quot;Mannish Boy&quot; are among the best of them; on the other hand, a rendition of &quot;Cry Me a River&quot; by Lulu (?!) is a curious choice, even with Jeff Beck on hand. The absence of lengthier vintage clips, meanwhile, is the principal drawback. For that reason alone, Clint Eastwood's Piano Blues is the best of the lot; a musician himself, Eastwood simply lets the players play, which means we get extensive file footage of the likes of Art Tatum, Oscar Peterson, and Nat &quot;King&quot; Cole, as well as new performances by Ray Charles, Dr. John, and others. Overall, this is a set to savor, a worthwhile investment guaranteed to grow on you over the course of repeated viewings. --Sam Graham\n\nProduct Description\nThis 7 DVD set features rare archival performance footage of Muddy Waters, Howlin' Wolf, Willie Dixon, John Lee Hooker, Bo Diddley, Eric Clapton and many more. It also features newly filmed performances by contemporary artists singing classic blues songs","torrent":{"xt":"urn:btih:165bc7c66ab466f5b014972b2c908010a917fd09","amp;dn":"MartinScorsese_TheBlues_03_TheRoadToMemphis.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"165bc7c66ab466f5b014972b2c908010a917fd09","infoHashBuffer":{"type":"Buffer","data":[22,91,199,198,106,180,102,245,176,20,151,43,44,144,128,16,169,23,253,9]},"announce":[],"urlList":[]}}