{"title":"Clark Terry - 1955 - Clark Terry (1997) FLAC","uid":8898595,"size":173453617,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:167c2cf64e5a9edd25fe9fbaf8be9bbdff21c4ba&amp;dn=Clark+Terry+-+1955+-+Clark+Terry+%281997%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":23,"time":1378761349,"description":"Clark Terry - 1955 - Clark Terry (1997)\n\nAside from a three-song session for V-Disc during the late 1940s, this CD contains Clark Terry's first recordings as a leader. Already an alumni of both Charlie Barnet's and Count Basie's bands, and a then-current member of Duke Ellington's orchestra, Terry is more focused on bop in these dates, with a terrific band including trombonist Jimmy Cleveland, baritone saxophonist Cecil Payne, pianist Horace Silver, cellist/bassist Oscar Pettiford, bassist Wendell Marshall, and drummer Art Blakey, with charts by Quincy Jones. The infectious opener, &quot;Swahili,&quot; was credited to Jones, though in Carl Woideck's liner notes, Terry remarks that he had a hand in its creation at the date. The loping &quot;Double Play&quot; features both bassists and a fine muted chorus by the leader. The easygoing bopper &quot;Co-Op&quot; was penned by Terry and fellow Ellington sideman Rick Henderson, with pungent statements by the trumpeter and Payne. The brisk blues &quot;Chuckles&quot; is a dazzling finale to his first LP, showcasing Payne and Cleveland before Terry takes over and plays a chorus in each of the 12 keys to wrap things up with a flourish. There may be a bit of confusion for anyone who owns a copy of the original LP, as many of the songs were mislabeled on it. The last four tracks came from a 1954 10&quot; album, Cats Vs. Chicks' players include Silver and Pettiford (Percy Heath takes his place on two numbers), trombonist Urbie Green, tenor saxophonist Lucky Thompson, guitarist Tal Farlow, and drummer Kenny Clarke. Terry's vocal-like muted horn is heard in &quot;Cat Meets Chicks,&quot; while his distinctive style on open horn is prominent in his &quot;Mamblues,&quot; which also has a tasty chorus by Farlow and a bit of Latin percussion behind the ensemble passage. &quot;Anything You Can Do (I Can Do Better)&quot; is a mock battle between instrumentalists, with Mary Osborne challenging Farlow, trumpeter Norma Carson putting Terry to the test, while Terry Pollard takes on Horace Silver. There are no losers in this swinging meeting. (AllMusic)\n\nTrack list:\n01 - Swahili\n02 - Double Play\n03 - Slow Boat\n04 - Co-op\n05 - Kitten\n06 - The Countess\n07 - Tuma\n08 - Chuckles\n09 - Cat Meets Chick\n10 - Mamblues\n11 - The Man I Love\n12 - Anything You Can Do (I Can Do Better)\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:167c2cf64e5a9edd25fe9fbaf8be9bbdff21c4ba","amp;dn":"Clark+Terry+-+1955+-+Clark+Terry+%281997%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"167c2cf64e5a9edd25fe9fbaf8be9bbdff21c4ba","infoHashBuffer":{"type":"Buffer","data":[22,124,44,246,78,90,158,221,37,254,159,186,248,190,155,189,255,33,196,186]},"announce":[],"urlList":[]}}