{"title":"Bride &amp; Prejudice Motion Picture Soundtrack 320cbr Anu Malik","uid":9435426,"size":115250231,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:18ea7d6c9ee6a80d7432e73615f4a2edc4b6be99&amp;dn=Bride+%26amp%3B+Prejudice+Motion+Picture+Soundtrack+320cbr+Anu+Malik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1388894730,"description":"Bride &amp; Prejudice Motion Picture Soundtrack 320cbr (Big Papi) 2004 Anu Malik\n\n\nSource: 2004 CD\n\n\nBy pinkpanther263\nI just want to make a few comments about this soundtrack. I would like to point out that several of the songs from the film are &quot;bhangra.&quot; I don't think that was made clear in the film and I think it's important for mainstream viewers to know, especially if you also enjoyed the &quot;Bend It Like Beckham&quot; soundtrack. For those of you unfamiliar with this style of music, it is a traditional form from the Punjab region of India (Northwest part). Bhangra has become quite popular in recent years all over India and especially in the UK and Canada. So far it is still fairly unknown in the US outside the Indian population. The people in both &quot;Bride &amp; Prejudice&quot; and &quot;Bend It Like Beckham&quot; are Punjabi, which is why you not only hear this infectious music, but also why you see the fun and vivacious dancing--that is bhangra! As a professional bhangra dancer and big fan of Punjabi culture, I really want mainstream people to KNOW what they are looking at and hearing. Moviegoers really have seemed to respond to this music and it bothers me that there isn't better mention of the name of this type of music and what part of India it comes from. India is a very rich and diverse country with every region having its own culture. We must not lump everything into just being &quot;Indian.&quot; That can mean a lot of different things. I wish director Chadha made more of an effort to illustrate this in her films, since she does sincerely want to inform mainstream viewers about Indian culture.\n\nFor example, the second dance scene that supposedly takes place in the family's home town of Amritsar (which is a very holy place in Punjab) is not at all a Punjabi thing -- it is a dance and music form from the state of Gujarat, located further south and west, closer to Bombay. I was really confused why Chadha would do this, as she herself is Punjabi and knows that Garba-Raas is Gujarati! But later I understood that she needed that type of interaction with the actors to mimic a similar scene in the original film and book.\n\nAnyways, I just wanted to make those points clear as I am thrilled to see Americans loving this music and dance and now they'll know what they are hearing and seeing.\n\nAs for the soundtrack itself, I mention that one should also get the import (for the Hindi version) because it is really better to hear the songs in their real language. It just doesn't sound right in English! I know she probably did that because Americans are notoriously lazy to read subtitles, but it really is better in Hindi (though note: bhangra is normally sung in the Punjabi language). The Ashanti songs are missing but you will not be disappointed.\n\nIf you like this &quot;Bollywood&quot; style film and would like to see the real thing, I suggest such popular recent films as &quot;Kal Ho Naa Ho&quot; (filmed in NYC!), &quot;Main Hoon Na&quot; and &quot;Devdas&quot; (also with Aishwarya Rai)-- all starring #1 Bollywood actor Shah Rukh Khan! They are all available on DVD on the web.\n\nChakk De!!","torrent":{"xt":"urn:btih:18ea7d6c9ee6a80d7432e73615f4a2edc4b6be99","amp;dn":"Bride+%26amp%3B+Prejudice+Motion+Picture+Soundtrack+320cbr+Anu+Malik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18ea7d6c9ee6a80d7432e73615f4a2edc4b6be99","infoHashBuffer":{"type":"Buffer","data":[24,234,125,108,158,230,168,13,116,50,231,54,21,244,162,237,196,182,190,153]},"announce":[],"urlList":[]}}