{"title":"The Feeling - Join With us - (2008)[FLAC-EAC-CUE]","uid":4488484,"size":456014669,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:190c776222292e5bb11750a45c94fbabed0e6b7f&amp;dn=The+Feeling+-+Join+With+us+-+%282008%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seanprince","files":22,"time":1225874800,"description":"Track list\n\nThe Feeling - Join With Us\n\n01. I Thought It Was Over 04:00\n02. Without You 04:49\n03. Join With Us 04:40\n04. Spare Me 04:28\n05. Turn It Up 03:52\n06. I Did It For Everyone 04:25\n07. Won&amp;#039;t Go Away 03:48\n08. Loneliness 03:25\n09. Conor 03:41\n10. This Time 03:20\n11. Don&amp;#039;t Make Me Sad 05:00\n12. The Greatest Show On Earth We Can Dance (Hidden Track) 08:41\n\n\nBiography by Andrew Leahey\n\nDrawing heavily from the rich harmonies and melodies of &amp;#039;70s soft rock, British quintet the Feeling includes vocalist/guitarist Dan Gillespie-Sells (previously of Scottish pop/rock act Speedway), bassist Richard Jones, guitarist Kevin Jeremiah, keyboardist Ciaran Jeremiah, and drummer Paul Stewart. Former students of the Brit School of Performing Arts in Croydon, the quintet initially performed as Super Fly, a resident cover band playing at La Tania Ski Resort in the French Alps. The group soon realized they wanted to create their own classic rock-inspired pop and, upon returning home, rechristened themselves the Feeling.\nWith the backing of Island Records, the band&amp;#039;s polished debut, Twelve Stops and Home, was released in the U.K. in June 2006, where it charted three Top Ten U.K. Singles (&quot;Sewn,&quot; &quot;Fill My Little World,&quot; &quot;Never Be Lonely&quot;) and garnered a Brit Award nomination. The album was re-released on the Cherry Tree/Interscope label the following year in America -- complete with revised cover art and retooled track listing -- but failed to match its overseas success. Nevertheless, the band&amp;#039;s popularity at home continued to soar, and the sophomore effort Join With Us topped the U.K. charts upon its release in February 2008.\n\nReview by Andrew Leahey\n\nWhen the Feeling first appeared in 2006 with Twelve Stops and Home, they were pop/rock architects wielding the proper tools (harmony vocals, organs, and tight songcraft) to build a fine shrine to ELO and Supertramp. Two years later, Join with Us shows the five bandmates getting a bit overzealous with their abilities, mixing strong power pop songs with an oversized scoop of melodrama and the occasional pinch of musical absurdity. For starters, there&amp;#039;s a show-stopping, room-emptying sax solo in the middle of &quot;Won&amp;#039;t Go Away,&quot; an embellishment that turns the song into something from a 1980s movie soundtrack (think Rob Lowe blowing his horn during St. Elmo&amp;#039;s Fire, minus the dangly earring). Those ten seconds may be the album&amp;#039;s worst offense, but Join with Us&amp;#039; 12 tracks (plus one bonus cut) sound more indebted to the Carpenters than the Beatles, and the surplus of theatrical soft pop (no matter how well-crafted) doesn&amp;#039;t pack the same appeal as the energetic numbers that dominated the band&amp;#039;s debut. Thankfully, several standout tracks still pepper this set list, and &quot;I Thought It Was Over&quot; nimbly opens the album with disco beats, twinkling piano arpeggios, harmonized guitar leads, and one of the band&amp;#039;s best bridges to date. Later, the lively mood continues with the bouncy title track (featuring a call-and-answer chorus sung mostly in falsetto) and &quot;Turn It Up,&quot; a Queen-sized romp that is unabashedly grandiose and, as a result, all the more appealing. All three are first-rate pop songs, but they can&amp;#039;t quite balance out the smooth piano noodling and Broadway-worthy crooning that dominate the rest of Join with Us. ","torrent":{"xt":"urn:btih:190c776222292e5bb11750a45c94fbabed0e6b7f","amp;dn":"The+Feeling+-+Join+With+us+-+%282008%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"190c776222292e5bb11750a45c94fbabed0e6b7f","infoHashBuffer":{"type":"Buffer","data":[25,12,119,98,34,41,46,91,177,23,80,164,92,148,251,171,237,14,107,127]},"announce":[],"urlList":[]}}