{"title":"Mass Infection - 2007 - Atonement For Iniquity","uid":7273765,"size":29972459,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1946d49197f4636bc196f12cb48cd384cd0276a2&amp;dn=Mass+Infection+-+2007+-+Atonement+For+Iniquity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UGATeam","files":10,"time":1337200896,"description":"Mass Infection was formed back in 2003 intending to perform some intense death metal.Starting with &quot;Believe the Lie&quot; demo in the same year got the chance to appear within the Greek territory in several live shows,approaching fans and receiving some positive feedback by zines and critics.Debut album called &quot;Atonement for Iniquity&quot; recorded in the end of 2005 at Nemesis studio(Kavala) containing 9 songs of pure and aggressive death metal.Then it was time to get signed with the Austrian label Black Edge Records and so the album was released in 2007.After some serious line up changes that occurred within the band and so with the coming of a new drummer and the experience gained through the years,their second attempt entitled &quot;The Age of Recreation&quot; was recorded and released in 2009 under the wings of Pathologically Explicit Recordings (Spain). Strongly influenced by brutal acts like Unmerciful,Hate Eternal,Deeds of Flesh, Severe Torture and Origin,this album defined once forever the band's personal sound and opened the way for the future releases.After some glorious critics and response by the fans in and out of borders,Mass Infection managed to approach some bigger labels and finally making a deal with the American Comatose Music for the release of the third album.\n\nThrough the years Mass Infection have appeared in some of the most significant European festivals such as Fuck the Commerce XI,Deathfeast Openair, Filthrock festival(Headline)and Tattoo Deathfeast.Also they supported the Greek legends Rotting Christ in their &quot;Theogonia Balkans Tour&quot; in 2007 playing in 6 Balkan countries and they have also shared the stage with legendary bands like Malevolent Creation,Sinister,Pungent Stench,Nile,Bolt Thrower and Behemoth. Currently and after several changes the line up is:George S.-guitar/voice,Nick-guitar,George T.-drums and Victor-bass.Future activities include some very important live shows such as the Gothenburg Deathfest and the composition of the third-yet untitled-album.","torrent":{"xt":"urn:btih:1946d49197f4636bc196f12cb48cd384cd0276a2","amp;dn":"Mass+Infection+-+2007+-+Atonement+For+Iniquity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1946d49197f4636bc196f12cb48cd384cd0276a2","infoHashBuffer":{"type":"Buffer","data":[25,70,212,145,151,244,99,107,193,150,241,44,180,140,211,132,205,2,118,162]},"announce":[],"urlList":[]}}