{"title":"Smarty Uninstaller 2012 3.0.1 Portable","uid":6457373,"size":20230446,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:19f8dd65ce8172db2c7d89e5541d4c3962e9300e&amp;dn=Smarty+Uninstaller+2012+3.0.1+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1307627177,"description":"Smarty Uninstaller 2012 3.0.1 Portable\n\nSmarty Uninstaller - professional uninstall manager with intuitive and easy to use interface that allows you to manage and completely remove WindowsÃ‚Â® applications. At most cases Windows applications are very complicated. They put large number of traces to your system. Especially that refers to such things as entries in Windows Registry, Program Files and Shortcuts. In general the problem lies in Uninstaller (simply, an uninstaller is the opposite of an installer. During the uninstallation, the uninstaller removes all the components which were installed) that can't properly remove all traces in Windows. Also some users simply doesn't use uninstaller! They just delete the application program files from hard drive. Other traces still stays untouched! Large amount of junk traces will make your PC much slower.\n\nKey Functions\nScans your computer for traces left by application and deletes them even if regular uninstaller does not work.\n- Smarty UI\nEasy to use and modern user interface allows to comfortably work with Smarty Uninstaller!\n- Smarty Cache\nMakes Smarty Uninstaller much faster solution than regular Windows Add/Remove.\n- Smarty Protection\nProtects critical system components. You will not be able to delete system files accidentally or in any other way.\n- Smarty Startup\nTool for managing Windows startup items with easy and intuitive user interface.\n- Smarty Secure Delete\nOverwrite files and folders with random characters to ensure that nobody will ever be able to recover these files from your disk.\n- Smarty Groups\nAllows you to organize applications into the logical groupings. This will make your work with Smarty Uninstaller more flexible and organized.\n- Smarty Drag-Drop\nUninstall applications using drag-drop and context menu! Just drop application's icon to the Smarty Uninstaller icon on the desktop. Or choose appropriate command in context menu (Right mouse click).\n- Smarty Reports\nCreate and Print detailed reports about installed applications.\n- Smarty Queue\nYou can select up to 5 applications for uninstall.\n- Smarty Info\nGives detailed information about application (Name, Version, Size, Install location etc.)\n- Smarty Backup\nBackup your system directly from Smarty Uninstaller.\n- Useful tips and detailed Help\nProvides you with all information you need to work with it.\n\nHome page - http://www.winnertweak.com/uninstaller/\n\n","torrent":{"xt":"urn:btih:19f8dd65ce8172db2c7d89e5541d4c3962e9300e","amp;dn":"Smarty+Uninstaller+2012+3.0.1+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19f8dd65ce8172db2c7d89e5541d4c3962e9300e","infoHashBuffer":{"type":"Buffer","data":[25,248,221,101,206,129,114,219,44,125,137,229,84,29,76,57,98,233,48,14]},"announce":[],"urlList":[]}}