{"title":"Re-eval US Israel 'Special Relationship' Wash Press Club","uid":11167773,"size":2101392539,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1bd6e1598938df9dbe0241ee44b2ae04473ec453&amp;dn=Re-eval+US+Israel+%27Special+Relationship%27+Wash+Press+Club&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":31,"time":1412653914,"description":" &lt;a href=&quot;http://natsummit.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://natsummit.org/&lt;/a&gt;\n\nU.S. financial, military, and diplomatic support for Israel has grown significantly and steadily throughout the past 60 years and now dwarfs annual American foreign assistance to all other nations. Research indicates the U.S.-Israel &quot;special relationship&quot; is a major factor in foreign hostility towards Americans. Some experts suggest that Israel has been central to U.S. wars in the Middle East.\n\nHowever, the huge public backlash against Israel lobby-generated momentum for U.S. attacks on Syria and Iran indicates that Americans are concerned about the direction of U.S. foreign policy, how it is made, and those trying to make it. Despite such concerns, Congress has not examined the impact of Israel lobbying influence on overall U.S. national security and international standing since the 1960s. The time has therefore come for an expert inquiry with broad American citizen participation.\n\nThis historic summit will provide an in-depth, multifaceted inquiry into this critical subject matter. Panelists will include former military and diplomatic personnel, intelligence officers, scholars, economists, researchers and a variety of other subject-matter experts and authors often shut out of key discussions in public forums and news media outlets. Members of the public will be allowed to ask the key questions and network with other attendees.\n\nThis nonpartisan symposium will examine the impact of the U.S.-Israel relationship on Americans. Speakers and attendees will include military, diplomatic, intelligence, academic, governmental, research organization and economic experts, as well as former and current members of Congress. ","torrent":{"xt":"urn:btih:1bd6e1598938df9dbe0241ee44b2ae04473ec453","amp;dn":"Re-eval+US+Israel+%27Special+Relationship%27+Wash+Press+Club","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bd6e1598938df9dbe0241ee44b2ae04473ec453","infoHashBuffer":{"type":"Buffer","data":[27,214,225,89,137,56,223,157,190,2,65,238,68,178,174,4,71,62,196,83]},"announce":[],"urlList":[]}}