{"title":"Peter Hammill - Skeletons of Songs (Fan Remastered)","uid":5956128,"size":1343520904,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1be6feeaf7ab6b8740caa7a2653ce2af7117cd93&amp;dn=Peter+Hammill+-+Skeletons+of+Songs+%28Fan+Remastered%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gyaradon","files":54,"time":1289728831,"description":"&quot;Well, I suppose you will have gathered by now that this sort of performance is all about the skeletons of songs. And all the songs on the band albums or solo albums, what have you, however orchestrated and overdubbed they get in the end, at one point or another exist like this.&quot;\n\nSkeletons of Songs has always been a low-fidelity affair. The concert was most likely recorded on audio cassette using low-grade equipment with a poor signal-to-noise ratio. When two tracks (&quot;If I Could&quot; and &quot;The Mousetrap (Caught In)&quot;) appeared on the 2006 remaster of Peter Hammill's The Future Now, they were sourced from the CD bootleg, which is a good indication that there is no superior source for these recordings.\n\nThe purpose of this remaster is to clean off the better portion of the noise and make this double album a more satisfying listening experience. As noise reduction is always a delicate operation, and one to be used only in extreme cases, this set has been treated carefully to preserve the original character of the recordings. A layer of noise remains, but it is appreciably less than the blanket that originally covered the entire performance.\n\nCaptain S","torrent":{"xt":"urn:btih:1be6feeaf7ab6b8740caa7a2653ce2af7117cd93","amp;dn":"Peter+Hammill+-+Skeletons+of+Songs+%28Fan+Remastered%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1be6feeaf7ab6b8740caa7a2653ce2af7117cd93","infoHashBuffer":{"type":"Buffer","data":[27,230,254,234,247,171,107,135,64,202,167,162,101,60,226,175,113,23,205,147]},"announce":[],"urlList":[]}}