{"title":"Waking The Dead seizoen 1 (2001) DVDrip (nl subs) - hajo","uid":10941218,"size":7055471914,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1c311f444f5ee2cfdc0c1894fe4ebbc2b9240afd&amp;dn=Waking+The+Dead+seizoen+1+%282001%29+DVDrip+%28nl+subs%29+-+hajo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"hajo65","files":9,"time":1409521115,"description":"Waking the Dead is een Engelse politieserie die in 2000 is gestart en waarvan 46 dubbele afleveringen zijn uitgezonden door de BBC.\n\nIn de hoofdrol zien we Trevor Eve als hoofdinspecteur Peter Boyd. Hij staat aan het hoofd van de Metropolitan Police's Cold Case Squad. Deze elite-eenheid is speciaal opgericht om onopgeloste moordzaken te heropenen. Hierbij maakt het team gebruik van de allernieuwste forensische technieken en een profiler. Het oprakelen van het verleden kan gevaarlijk zijn, de moordenaar loopt immers nog rond...\n\nPeter Boyd wordt achtervolgd door de verdwijning van zijn eigen zoon. Hij is daarom vastbesloten de waarheid koste wat kost boven water te krijgen. Hij wordt bijgestaan door een team van professionele experts: profiler Dr Grace Foley, forensisch onderzoeker Dr Frankie Wharton, Boyds rechterhand DS Spencer Jordan en de benjamin DC Mel Silver. Veel aandacht wordt gegeven aan de onderlinge verhoudingen binnen het team, dat soms uiteen dreigt te vallen door de spanningen die het werk oproept en met name door de woedeaanvallen van Boyd.\n\nDit eerste seizoen bevat ook de pilot-aflevering uit 2000.","torrent":{"xt":"urn:btih:1c311f444f5ee2cfdc0c1894fe4ebbc2b9240afd","amp;dn":"Waking+The+Dead+seizoen+1+%282001%29+DVDrip+%28nl+subs%29+-+hajo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c311f444f5ee2cfdc0c1894fe4ebbc2b9240afd","infoHashBuffer":{"type":"Buffer","data":[28,49,31,68,79,94,226,207,220,12,24,148,254,78,187,194,185,36,10,253]},"announce":[],"urlList":[]}}