{"title":"Arthur en de Wraak van Malthazard(2009)(NLsubs) TBS","uid":6362149,"size":4582216815,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1cd0a82b6bc2357c9fba07887bb915b505ab2a55&amp;dn=Arthur+en+de+Wraak+van+Malthazard%282009%29%28NLsubs%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mad_Parrot","files":-1,"time":1304371090,"description":"\n\n\n\n\nArthur en de Wraak van Malthazard   \n\n\nFrankrijk\nAnimatie / Fantasy\n93 minuten\n\ngeregisseerd door Luc Besson\nmet Freddie Highmore, Penny Balfour en Mia Farrow\n\n\nNederlands:\n\n\n\nArthur is uitzinnig van vreugde: vandaag is het einde van de tiende Maancyclus en hij zal eindelijk de wereld van de Minimoys kunnen toetreden om SÃƒÂ©lÃƒÂ©nia te vinden. \nMaar uitgerekend deze dag heeft zijn vader uitgekozen om Arthur eens te laten stoppen met zijn reizen en naar zijn oma te sturen. \nOp de dag van zijn vertrek naar oma ontvangt Arthur van een spin een SOS-bericht van de Minimoys: SÃƒÂ©lÃƒÂ©nia is in gevaar! \nArthur twijfelt niet lang om te hulp te schieten, ook al betekent dat zijn leven riskeren tegen de beruchte Maltazard.\nArthur heeft lang gewacht op het moment dat hij weer terug kan keren naar de wereld van de Minimoys en zijn geliefde Selenia. \nMaar als het eindelijk zo ver is, besluit Arthur\\'s vader de vakantie bij oma op te schorten. \nHet lijkt erop dat de enige kans voor Arthur om terug te keren naar de wereld van de kleine wezentjes die zijn opa ooit tekende, verloren gaat. \nTotdat een spin een kleine rijstkorrel in Arthur\\'s hand achterlaat, met een noodbericht van een onbekende afzender. \nArthur twijfelt niet en begint meteen aan een gevaarlijke reis naar de wereld van de Minimoys. \nAls Arthur eindelijk aankomt in het dorp van de Minimoys, blijkt dat zij hem nooit een noodbericht hebben gestuurd. Maar wie heeft Arthur dan in de val gelokt? \n\n\nEngels:\n\nArthur is delirious with joy today is the end of the tenth Lunar Cycle and will last the world of the Minimoys can join to find Selenia.\nBut these very days his father has chosen to Arthur again to stop his travels and his grandmother to send.\nOn the day of his departure for a spin Arthur grandmother receives an SOS message from the Minimoys: Selenia is in danger!\nNot long to doubt Arthur's rescue, even if it means risking his life against the infamous Maltazard.\nArthur has long awaited the moment when he can return again to the world of the Minimoys and his beloved Selenia.\nBut when it finally happened, decides Arthur \\ 's father on holiday at grandma to suspend.\nIt seems that the only chance for Arthur to return to the world of small creatures that ever drew his grandfather lost.\nUntil a spin in a small grain of rice Arthur \\ 's hand behind, with a distress message from an unknown sender.\nArthur has no doubts and immediately begins a dangerous journey into the world of the Minimoys.\nWhen Arthur finally arrives in the village of the Minimoys, that they had never sent an emergency message. But who has trapped than Arthur?\n\n\nFrans:\n\n\nArthur est au comble de l'excitation : c'est aujourd'hui la fin du dixiÃƒÂ¨me cycle de la Lune, et il va enfin pouvoir regagner le monde des Minimoys pour y retrouver SÃƒÂ©lÃƒÂ©nia. \nDans le village, tout est prÃƒÂªt pour l'accueillir : un grand banquet a ÃƒÂ©tÃƒÂ© organisÃƒÂ© en son honneur, et la petite princesse a passÃƒÂ© sa robe en pÃƒÂ©tales de rose... \nC'est sans compter le pÃƒÂ¨re d'Arthur, qui choisit prÃƒÂ©cisÃƒÂ©ment ce jour tant attendu pour quitter plus tÃƒÂ´t que prÃƒÂ©vu la maison de sa grand-mÃƒÂ¨re. \nAu moment du dÃƒÂ©part, une araignÃƒÂ©e dÃƒÂ©pose dans les mains du jeune garÃƒÂ§on un grain de riz sur lequel est gravÃƒÂ© un message de dÃƒÂ©tresse. \nPas de doute, SÃƒÂ©lÃƒÂ©nia est en danger!\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nMenu          : Ja\nAudio         : Nederlands , Engels , Vlaams\nExtra's       : Ja\nOndertitels   : Nederlands \nCover &amp; label : Ja\nGenre         : Animatie / Fantasie\n\n\n\n\n\n\n\n  &lt;a href=&quot;\nhttp://www.premiere.fr/film/Arthur-et-la-vengeance-de-Maltazard&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.premiere.fr/film/Arthur-et-la-vengeance-de-Maltazard&lt;/a&gt;\n\n\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/47275&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/47275&lt;/a&gt;\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0940657/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0940657/&lt;/a&gt;\n\n\n\nTBS","torrent":{"xt":"urn:btih:1cd0a82b6bc2357c9fba07887bb915b505ab2a55","amp;dn":"Arthur+en+de+Wraak+van+Malthazard%282009%29%28NLsubs%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cd0a82b6bc2357c9fba07887bb915b505ab2a55","infoHashBuffer":{"type":"Buffer","data":[28,208,168,43,107,194,53,124,159,186,7,136,123,185,21,181,5,171,42,85]},"announce":[],"urlList":[]}}