{"title":"The.Sky.at.Night.The Real Star of Bethlehem.720p.HDTV.x265-MVGro","uid":13115937,"size":402712557,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:1d22141009a8fe26b1e9dd0f20636d9f460d5769&amp;dn=The.Sky.at.Night.The+Real+Star+of+Bethlehem.720p.HDTV.x265-MVGro&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":1,"time":1451580131,"description":"BBC.The.Sky.at.Night.2015.The Real Star of Bethlehem.720p.HDTV.x265-MVGroup.mkv\r\n\r\nAstronomers have been fascinated by the idea of the Star of Bethlehem for centuries. Did it exist? And if so, what was it?\r\n\r\nThe list of candidates includes some of the most exciting objects in the night sky - supernovae, comets, meteors and unusual alignments of the giant planets.\r\n\r\nIn this surprising and entertaining Christmas special the Sky at Night team go in search of the potential causes of the Star of Bethlehem.\r\n\r\nThe team explore the possibilities, investigating the nature of the phenomena and digging through the historical records including Babylonian clay tablets and ancient Chinese manuscripts, to reconstruct events in the night sky 2,000 years ago.\r\n\r\nMaggie Aderin-Pocock goes hunting for supernovae using the most powerful laser in Britain, and discovers that these mighty explosions caused by the death of stars can shine brighter than the moon in our sky.\r\n\r\nChris Lintott reconstructs the night sky over Jerusalem at the time of Jesus's birth, discovering a once-in-a-millennium conjunction of Saturn and Jupiter that was first suggested as a cause of the star by the great astronomer Johannes Kepler in 1604.\r\n\r\nArmed with his telescope, Pete Lawrence searches out the features of the night sky we can observe today that may provide clues to the origin of the Star of Bethlehem.\r\n\r\nProfessor Alan Fitzsimmons explains why the sudden appearance of a comet in the night sky has always been seen as an omen of great events on Earth.\r\n\r\nDallas Campbell goes in search of the historical and archaeological records that can shed light on the identity of the star. Finding Babylonian tablets in the vaults of the British Museum and ancient Chinese texts that record all the unusual events in the night sky 2,000 years ago, including a bright new star that appeared for 70 days in the year 5BC.\r\n\r\nTechnical Spec\r\nVideo Codec: x265/HEVC CABAC   \r\nVideo Bitrate: CRF 20 (~840Kbps)\r\nVideo Resolution: 1280x720\r\nVideo Aspect Ratio: 16:9\r\nFrames Rate: 25 FPS\r\nAudio Codec: AAC-LC\r\nAudio Bitrate: 64Kbps CBR 24/48KHz\r\nAudio Channels: 2\r\nRun-Time: 59 mins\r\nNumber of Parts: 1\r\nPart Size: 384 MB\r\nContainer: MP4\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:1d22141009a8fe26b1e9dd0f20636d9f460d5769","amp;dn":"The.Sky.at.Night.The+Real+Star+of+Bethlehem.720p.HDTV.x265-MVGro","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d22141009a8fe26b1e9dd0f20636d9f460d5769","infoHashBuffer":{"type":"Buffer","data":[29,34,20,16,9,168,254,38,177,233,221,15,32,99,109,159,70,13,87,105]},"announce":[],"urlList":[]}}