{"title":"Battleborn by Claire Vaye Watkins","uid":9637413,"size":390534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e3255e596d961b2bc80c7f49627da135a1837f8&amp;dn=Battleborn+by+Claire+Vaye+Watkins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1392862550,"description":"\nWinner of the 2012 Story Prize\nRecipient of the 2012 American Academy of Arts and Letters Rosenthal Foundation Award\nA National Book Foundation &quot;5 Under 35&quot; fiction writer of 2012\n\nLike the work of Cormac McCarthy, Denis Johnson, Richard Ford, and Annie Proulx, Battleborn represents a near-perfect confluence of sensibility and setting, and the introduction of an exceptionally powerful and original literary voice. In each of these ten unforgettable stories, Claire Vaye Watkins writes her way fearlessly into the mythology of the American West, utterly reimagining it. \n\nHer characters orbit around the region's vast spaces, winning redemption despite - and often because of - the hardship and violence they endure. The arrival of a foreigner transforms the exchange of eroticism and emotion at a prostitution ranch. A prospecting hermit discovers the limits of his rugged individualism when he tries to rescue an abused teenager. \n\nDecades after she led her best friend into a degrading encounter in a Vegas hotel room, a woman feels the aftershock. Most bravely of all, Watkins takes on and reinvents her own troubled legacy in a story that emerges from the mayhem and destruction of Helter Skelter. \n\nArcing from the sweeping and sublime to the minute and personal, from Gold Rush to ghost town to desert to brothel, the collection echoes not only in its title but also in its fierce, undefeated spirit the motto of her home state.\n\nGenre: Fiction/Short Story","torrent":{"xt":"urn:btih:1e3255e596d961b2bc80c7f49627da135a1837f8","amp;dn":"Battleborn+by+Claire+Vaye+Watkins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e3255e596d961b2bc80c7f49627da135a1837f8","infoHashBuffer":{"type":"Buffer","data":[30,50,85,229,150,217,97,178,188,128,199,244,150,39,218,19,90,24,55,248]},"announce":[],"urlList":[]}}