{"title":"IRIS PLATINUM SERIES - F-15E MUDHEN DRIVER FSX","uid":6966821,"size":483220029,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:21e97ae4a7c33ce07198388fff7d31ebcb72978a&amp;dn=IRIS+PLATINUM+SERIES+-+F-15E+MUDHEN+DRIVER+FSX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alef1995","files":3,"time":1326953674,"description":"\\\\\\&quot;This Aircraft is one of the best things I have ever flown and would consider this the VRS of Strike Eagles!\\\\\\&quot; - Chris Morrissey\n\nThe McDonnell Douglas (now Boeing) F-15E Strike Eagle is an all-weather multirole fighter, derived from the McDonnell Douglas F-15 Eagle. The F-15E was designed in the 1980s for long-range, high speed interdiction without relying on escort or electronic warfare aircraft.\n\nThe Strike Eagle has been deployed in Operation Desert Storm, Operation Allied Force and Operation Odyssey Dawn carrying out deep strikes against high-value targets, combat air patrols, and providing close air support for coalition troops.\n\nFeatures:\n\n    Custom sound pack by IRIS AudioworX based on authentic F-15 cockpit and exterior recordings.\n    State of the art modelling by renowned 3D artist, Tim Taylor designer of the LAGO Tornado and Aerosoft F-16 amongst others.\n    A wide variety of visual models with customised load-out manager which affects aircraft aerodynamics.\n    Superb flight model based on the F-15E unclassified technical order.\n    Fourteen paint schemes in glorious 4096x4096 pixel resolution\n    Alternate 1024 and 2048 textures in a handy texture swapper program for those with lower end systems.\n    Customizable load-out manager to release air to air and air to ground weapons during free flight.\n    State of the art lighting techniques from the afterburners through to the translucent HUD let you customise how your aircraft looks from day to night.\n    A focus on shared cockpit and multiplayer allows for a real team effort! Now you can take your friend up in the back seat on a mission of your very own and both command the F-15 as if you were really there!\n\n**********************************ALEF1995**********************************","torrent":{"xt":"urn:btih:21e97ae4a7c33ce07198388fff7d31ebcb72978a","amp;dn":"IRIS+PLATINUM+SERIES+-+F-15E+MUDHEN+DRIVER+FSX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21e97ae4a7c33ce07198388fff7d31ebcb72978a","infoHashBuffer":{"type":"Buffer","data":[33,233,122,228,167,195,60,224,113,152,56,143,255,125,49,235,203,114,151,138]},"announce":[],"urlList":[]}}