{"title":"SocietySM Redux - SSR - Mar 07, 2015 - Sasha Knox","uid":11884322,"size":447865553,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:22d7c265f1d34b5cda61994b7d8af7be3bd476ba&amp;dn=SocietySM+Redux+-+SSR+-+Mar+07%2C+2015+-+Sasha+Knox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":284,"time":1430770419,"description":"&quot;Getting Rough with Sasha&quot; \n SocietySM : Redux\n Sasha Knox \n\n\n\n\n Sasha first gags herself before she strips off her panties then, at The Pope's command, cuffs her ankles and wrists before she lays on the table awaiting her fate. After thoroughly inspecting Ms. Knox's body, The Pope further adds to his slaves binds by removing the cuffs and securely tying her wrists and ankles. After receiving a volley of ass slaps, Sasha is collared and placed face down on the table. Her Master's cold fingers are stuffed deep in her cunt and then, the magic wand is abruptly smashed upon her clit until she begs for and is granted, a convulsive orgasmic release... Now, flat on her back little Sasha is tied to a small bench. The Pope then brandishes his flogger and swings it through the air before it lands against his slave's flesh. With each strike of the flogger, Sasha screams in anguish. Especially when The Pope turns his attentions to her pussy. The clamps press and squeeze Sasha's nipples when they are attached. And then, the squeezing turns to tight tugging as her Master ties the clamps high overhead. Frozen in her current position, Sasha can do nothing more now as The Pope slides the glass dildo into her cunt and vibes her to another brutal, on demand orgasm. With Sasha mentally spent, The Pope now crotch ropes his slave before he storms out of the room... The cold, dirty floor provides no comfort for Alice as she takes the caning bound and gagged. With her legs spread as wide as possible, the TENS pads are affixed to her inner thighs and her feet. Now we watch as Sasha waits timidly in anticipation and then we see the transformation as the juice begins to flow through her little body. Electric nipple clamps then provide the icing on the cake as the power is increased and she begins to twitch. Her journey is far from over however, as The Pope once again coerces her with the wand and Alice grunts and cums. Now, dangling from the rafters Sasha appears frozen in her full suspension. Soon though, it becomes painfully obvious that she is not frozen when The Pope rakes the violet wand across her open flesh. From behind her ball gag, Alice screams as the wand crackles across her tender pussy. Induced to drooling, Alice now cums without her Master's permission and prepares for her final punishment... Face down on the floor, Sasha bravely endures the flogging. Then, The Pope makes one final dastardly stand by tantalizingly burying his vibe against his slave's cunt. After toying with Sasha's pussy The Pope finally allows his subject to cum. Sasha then experiences a huge orgasm and begs her Master to stop. For granting her wish to be released from his grip, The Pope demands Sasha to lick his boots clean before she is forced into one final orgasm for good measure\n\n\n Wmv 480p + Pics \n\n\n Screens &lt;a href=&quot;\nhttp://www.dungeoncorp.com/u...s15/RED/ALI_040508/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dungeoncorp.com/u...s15/RED/ALI_040508/index.php&lt;/a&gt;\n\n\n Uploaded by Merzedes and Shallow2 \n\n 17 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\n Just keep on leaving us the nice comments below and we are happy :)\n\n Any Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\n\nCheers :-)","torrent":{"xt":"urn:btih:22d7c265f1d34b5cda61994b7d8af7be3bd476ba","amp;dn":"SocietySM+Redux+-+SSR+-+Mar+07%2C+2015+-+Sasha+Knox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22d7c265f1d34b5cda61994b7d8af7be3bd476ba","infoHashBuffer":{"type":"Buffer","data":[34,215,194,101,241,211,75,92,218,97,153,75,125,138,247,190,59,212,118,186]},"announce":[],"urlList":[]}}