{"title":"Natures.Epic.Journeys-3.Eps--BBC-2016-360p","uid":14717469,"size":1048742056,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2366f304c200a91f226bd61fbcc04b70dcd7e615&amp;dn=Natures.Epic.Journeys-3.Eps--BBC-2016-360p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"uggauga","files":6,"time":1464481673,"description":"Nature's Epic Journeys\r\n\r\nDocumentary series using cutting-edge technology to follow animals as they undertake incredible journeys\r\n\r\nBBC (2016) - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b07bkhqs\r\n_______________________________________\r\n\r\n640x360 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nThis is the English language version.\r\nWith hard coded subtitles for the few occasions where they speak Welsh.\r\nEnglish subtitles (srt-files) are included as well.\r\n_______________________________________\r\n\r\nElephants\r\nNature's Epic Journeys Episode 1 of 3\r\nA thousand elephants, from magnificent bulls to vulnerable orphans, come together in a crucial annual gathering in northern Kenya, whilst facing deadly threats from both predators and poachers.\r\nLiz Bonnin leads a team of scientists and film-makers using cutting-edge satellite-tracking technology to follow individual elephants day by day as they cope with their daily challenges. The team capture surprising new behaviour and witness how elephant society is responding to a world changed by poaching, including the remarkable way young elephants are coping with the loss of their parents.\r\n\r\nCaribou\r\nNature's Epic Journeys Episode 2 of 3\r\nA hundred thousand caribou face starving bears and wolves, deadly frozen rivers and rugged mountains as they undertake the world's longest land migration - 5,000 kilometres through the frozen Arctic wilderness of Canada and Alaska.\r\nLiz Bonnin leads a team of scientists and film-makers using cutting-edge technology to follow the herd, providing insights into the individual lives of the animals. The caribou must reach their calving grounds before they give birth - failure would spell disaster.\r\n\r\nZebra\r\nNature's Epic Journeys Episode 3 of 3\r\nThousands of zebra face lions, hunting dogs, drought and starvation as they undertake the world's most recently discovered migration. Braving one of Botswana's most brutal wildernesses, they make Africa's longest land migration to reach the rich grasslands of Nxai Pan National Park.\r\nLiz Bonnin leads a team of scientists and film-makers using cutting-edge technology to attempt something that has never been done before - following the zebra on the ground, every step of the way, to reveal the secrets behind this brand new discovery","torrent":{"xt":"urn:btih:2366f304c200a91f226bd61fbcc04b70dcd7e615","amp;dn":"Natures.Epic.Journeys-3.Eps--BBC-2016-360p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2366f304c200a91f226bd61fbcc04b70dcd7e615","infoHashBuffer":{"type":"Buffer","data":[35,102,243,4,194,0,169,31,34,107,214,31,188,192,75,112,220,215,230,21]},"announce":[],"urlList":[]}}