{"title":"Corn.Island.2014.Georgia.1280X720p.x264.Aac-Makalakato","uid":13076005,"size":2636018944,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:2380e7f382f5555eba91b8a16177ef6f0e6f0f08&amp;dn=Corn.Island.2014.Georgia.1280X720p.x264.Aac-Makalakato&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makalakat","files":17,"time":1450846015,"description":"When you are stranded in an island, alone, and it is raining heavily, you would need some fire to keep yourself warm. But what if you had just one matchstick left with you and there is no sign of any help? At that point of time, whatever you do, you need to be careful; you have to be hopeful and trust it; you need to be determined; you need to make sure you follow a set of safety instructions; you need to know what to do first and what follows next; you need to make sure that there is no room for a mistake; and finally, be calm, because you know that it is going to be this time or never. Such is the story of ‘Corn Island’.\r\n\r\nAn old man comes in a boat to a small island with no residents but some remnants. He looks old, but he is rugged, tough, and determined. The old man has come with hoe and other farming tools. He then examines the soil and starts digging it. One day he spends loosening up the earth and goes back home in his boat. Next day, he creates tracks on the field using his manual laborious strength and goes back home in his boat. \r\n\r\nAnother day, he comes back with some seeds, drops them along the tracks, and sets the farming field and goes back home in his boat. He comes everyday in the boat, does his daily duty, and goes back home. With no words or sigh of tiredness, he continues to follow the steps that he seems to have learned from his farming experience over the years. Every step is taken carefully and with precision.\r\n\r\nNow, his field has got seedlings, which means that he needs to have a closer look at its growth and be more careful. Then he brings wood planks and housing tools in his boat to the island. It takes him few days to set up a small house on the island.\r\n\r\nHe has done everything that he could do alone. Now, he needs help. He brings his granddaughter along with him to the island. She helps him nourish the plants and set up the house with households. For a few days, he goes back home with her in the boat. After a few days, when he is sure that she can take care of things by herself, he sends her alone to bring stuffs he needs for the house and for the farm. He starts staying in the house, taking care of the plants, and protecting them from any kind of harm. By now, the girl comes alone and goes back alone. She delivers tools and food for her grandfather. When the corns start to fruit, the granddaughter also joins the old man and stays in the island, guarding the farm.\r\n\r\nHappy to see when the plants are grown fully with ripened corns, the old man and his granddaughter collect the corns and take them in the boat to the place they come from. After days of struggle and hard work, finally, they are just about to kiss happiness, but, then, a storm arrives, destroying everything that they have built so far. The island starts to crumble and the corn plants are getting drained down the water.\r\n\r\nThe old man sends his granddaughter in the boat filled with corns to their place, however, the storm is brutal and unforgiving that before they could trade all of the corn to their place, it destroyed everything: tore the house down, ruined the island into pieces, and wasted the rest of the corns. Along with the land, house, and corns, the old man also lost his life. The only thing left after the storm was just another piece of land on which a few people can stand.\r\n\r\nAfter the storm, another man comes in a boat to the island, which has hardly any space for any resident. However, like that old man, this man also seems hopeful. He examines the soil, finds some remnants, and starts digging it, despite the negligible size and the outcome known to him – like a never ending cycle of life.\r\n\r\nIt is painful and heartbreaking but it also gives a light of hope, courage of determination, and an inspiration of dedication. By the end of the movie, we all know that everybody who comes to the island is going to die and lose everything; however, we also know that the island is the only hope for the livelihood of whomever that comes here. The movie has lots more to offer than just its cinematic brilliance with minimal dialogue; the gradual growth that happens on the island can be seen as a metaphor to our lives and how we should take any hardship and trouble.\r\n \nhttp://thecinemaholic.com/","torrent":{"xt":"urn:btih:2380e7f382f5555eba91b8a16177ef6f0e6f0f08","amp;dn":"Corn.Island.2014.Georgia.1280X720p.x264.Aac-Makalakato","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2380e7f382f5555eba91b8a16177ef6f0e6f0f08","infoHashBuffer":{"type":"Buffer","data":[35,128,231,243,130,245,85,94,186,145,184,161,97,119,239,111,14,111,15,8]},"announce":[],"urlList":[]}}