{"title":"JulesJordan - Stella Cox (Big Tit Slut, Shows Her Love For Ameri","uid":15748125,"size":369298339,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:24b67edd4993cb6a63dc54ec67511adf79e52645&amp;dn=JulesJordan+-+Stella+Cox+%28Big+Tit+Slut%2C+Shows+Her+Love+For+Ameri&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1472996269,"description":"From the UK, these two big, glorious tits belong to Stella Cox - a hot, cream-skinned babe with a sexy accent and a filthy mouth. You cannot believe her body, wrapped in American pride and ready to get wet. You can stare at Stella all day, just moving her killer body around in that little bikini but the action obviously doesn't stop there. She's in for Sexual Athletics with Manuel and he works that body out in all forms. She sucks her own titties and gets throat fucked so deep and so hard. Her little English muffin is stuffed full of that big, French baguette and then her backdoor cream puff expands for a DEEP filling. These two are fucking HOT, especially watching Stella squeeze her big tits together and getting them fucked as hard as her ass and pussy. She can't wait for that cock to be back in her asshole, and gets more and more and more. She's spotted dick and she wants it every way she can get it, face down with her asshole spread open and getting speared and going straight to her pretty mouth after. Some more fuck-letics lead to sweet Stella fingering her pussy and cumming hard as she takes his big jizz delivery to the face!\tManuel Ferrara, Stella Cox\r\nCategories: Anal, Ass To Mouth, Big Butts, Big Cocks, Big Tits, Brunettes, Facial, Natural, Outdoors\r\n \nhttp://imgdone.com/viewer.php?file=57455944228099194761.jpg\r\n \nhttp://imgdone.com/viewer.php?file=84576602229315760167.jpg","torrent":{"xt":"urn:btih:24b67edd4993cb6a63dc54ec67511adf79e52645","amp;dn":"JulesJordan+-+Stella+Cox+%28Big+Tit+Slut%2C+Shows+Her+Love+For+Ameri","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24b67edd4993cb6a63dc54ec67511adf79e52645","infoHashBuffer":{"type":"Buffer","data":[36,182,126,221,73,147,203,106,99,220,84,236,103,81,26,223,121,229,38,69]},"announce":[],"urlList":[]}}