{"title":"Harley Quinn In Catwoman","uid":9019426,"size":53665738,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:24eb6e7b77ffe84f28f0306bef8cdd0f2a4bfed5&amp;dn=Harley+Quinn+In+Catwoman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"harleyquinncomics","files":-1,"time":1381265774,"description":"Every appearance of Harley Quinn in the second volume of Catwoman\n\n\nIssue #82 (Cat Outta Hell):\nCatwoman gets out of solitary! Riding a wave of barely contained rage at the world at large, it's payback time, starting with the prison staff. But not everyone on the wrong side of the law shares Selina's agenda, and the authorities are not the only ones whose blood will be spilled.\n\nIssue #83 (Scavenger Hunt):\nBatman and Commissioner Gordon guest star as the siege at the woman's prison is about to boil over into a full-scale riot. With the fleeing feline nowhere to be found, Bats and the Commish follow a deadly trail of clues, determined to bring the now-wanted-for-murder kitty cat down once and for all. Little does anyone realize that Catwoman's not alone...in fact, she's got some very deadly company, and Gordon is about to become the first of many to learn that having Catwoman as an enemy is a very painful thing indeed!\n\nIssue #84 (The Lesser Of The Two Evils):\nCatwoman teams up (sort of) with that mistress of madness, Harley Quinn! Are they after Batman? Nah. Trying to liberate the Joker? Nope. This time, Gordon's the target, and there's no turning back. This issue marks the end of Catwoman as you know her as the story heads off in a direction no one's expecting. And nothing in Catty's life will ever be the same.\n\nIssue #89 (Always Leave 'Em Laughing):\nTrying to sell a story about Catwoman to TV producers doesn't work for Harley Quinn, so she resorts to violence!\n\n\nPlz Seed!!!","torrent":{"xt":"urn:btih:24eb6e7b77ffe84f28f0306bef8cdd0f2a4bfed5","amp;dn":"Harley+Quinn+In+Catwoman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24eb6e7b77ffe84f28f0306bef8cdd0f2a4bfed5","infoHashBuffer":{"type":"Buffer","data":[36,235,110,123,119,255,232,79,40,240,48,107,239,140,221,15,42,75,254,213]},"announce":[],"urlList":[]}}