{"title":"Charles Knight - The Old Printer and the Modern Press [2010][A]","uid":9997854,"size":5318756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25fa5cf05e12d89cda14ae2c01f159e41ce65417&amp;dn=Charles+Knight+-+The+Old+Printer+and+the+Modern+Press+%5B2010%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397942289,"description":"Description\nProduct details\nBook Title: The Old Printer and the Modern Press (Cambridge Library Collection - History of Printing, Publishing and Libraries) [Paperback]\t\nBook Author: Charles Knight (Author)\nPaperback: 332 pages\nPublisher: Cambridge University Press; 1 edition (4 Mar 2010)\nLanguage: English\nISBN-10: 1108009220\nISBN-13: 978-1108009225\n\nAttention: This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions that are true to the original work.\n\nBook Description\nPublication Date: 4 Mar 2010 | ISBN-10: 1108009220 | ISBN-13: 978-1108009225 | Edition: 1\nCharles Knight's The Old Printer was first published in 1854 and is partly a biography of William Caxton and partly an account of the development of the printing press and its role in English literature from the fifteenth century. William Caxton was not only the first printer in England, but also a prolific translator and importer of books. He established a printing press at Westminster and among the books printed there were Chaucer's Canterbury Tales and The Subtil Histories and Fables of Esop. Knight describes Elizabethan reading habits and traces the development of the types of books, papers and magazines that were most popular with the reading public in the mid-nineteenth century. The author is particularly interested in the availability of cheap popular literature as he regards this as an indication of the democratisation of society.\n\nBook Description II\nThis 1854 publication begins with a biography of William Caxton, the first English printer, who also translated and imported books. It goes on to describe the development of the English printing press from the fifteenth to the nineteenth century. Part 2 focuses particularly on printers and readers of popular literature.\n","torrent":{"xt":"urn:btih:25fa5cf05e12d89cda14ae2c01f159e41ce65417","amp;dn":"Charles+Knight+-+The+Old+Printer+and+the+Modern+Press+%5B2010%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25fa5cf05e12d89cda14ae2c01f159e41ce65417","infoHashBuffer":{"type":"Buffer","data":[37,250,92,240,94,18,216,156,218,20,174,44,1,241,89,228,28,230,84,23]},"announce":[],"urlList":[]}}