{"title":"Queen - I Want To Break Free","uid":4756773,"size":155467780,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:260e189e5a3b51a5eda872b8004f6bac649768b6&amp;dn=Queen+-+I+Want+To+Break+Free&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"2nafish","files":-1,"time":1236503907,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;I Want to Break Free&quot; is a song performed by Queen, which was written by bassist John Deacon. It featured on their 1984 album The Works. In the UK Chart, it peaked at number 3, and remained in the chart for fifteen consecutive weeks from its release in late April of 1984. Most of the song follows the traditional 12 bar blues progression in E Major, a rare thing for a Queen song.\n\nThe music video, directed by David Mallet, was a parody of the northern British soap opera Coronation Street. During part of the video, the band members dressed in drag, as mildly similar characters found in the soap at the time; Mercury's character was loosely based on Bet Lynch, while May's character was based on Hilda Ogden. The video also depicted the band in what appeared to be a coal mine in their normal look, and it also features a ballet piece with the Royal Ballet (one of the dancers was Jeremy Sheffield), for which Freddie Mercury shaved his trademark moustache to portray Nijinsky (though he had kept it for the parody part of the video, interestingly enough). According to Brian May in an interview about Queen's Greatest Hits, the video ruined the band in America, which might explain why singles failed to go above #40 in the US Billboard charts after &quot;Radio Ga Ga&quot;, until The Show Must Go On reached No. 2. The video was initially banned by MTV in the U.S., but the ban was lifted in 1991 when it aired on VH1's My Generation 2-part episodes devoted to Queen hosted by guitarist Brian May. The song received renewed attention when it was used in a media advertising campaign for the soft drink Coca-Cola C2.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:260e189e5a3b51a5eda872b8004f6bac649768b6","amp;dn":"Queen+-+I+Want+To+Break+Free","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"260e189e5a3b51a5eda872b8004f6bac649768b6","infoHashBuffer":{"type":"Buffer","data":[38,14,24,158,90,59,81,165,237,168,114,184,0,79,107,172,100,151,104,182]},"announce":[],"urlList":[]}}