{"title":"Voracious Season Two Vol 2 XXX DVDRip x264-RedSecTioN","uid":9996578,"size":2414367889,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:265e934dbc42a34946715e318745ab6df278dd4c&amp;dn=Voracious+Season+Two+Vol+2+XXX+DVDRip+x264-RedSecTioN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"xxxlavalxxx","files":6,"time":1397930348,"description":"&quot;Porn pioneer John Staglianos groundbreaking Voracious series delivered undead lust, vampire intrigue and kinky, hardcore sex. In the new second seasons dark narrative, the fetish porn worlds top talents clash as perverse cravings create an eternal battlefield, with many casualties. The three episodes presented on are tales from the nighttime world of a modern San Francisco ruled by a clan of supernatural sex fiends. Luscious blonde Anikka Albrite seduces handsome stud James Deen, who buries his tongue in her plump, round butt. After aggressively fucking Anikka and splattering her with hot cum, James reveals a secret, murderous agenda. Sultry vampiress Lea Lexis finds nocturnal, submissive Deviant Kade on a downtown street. She follows him home, where Kades dominant African American girlfriend (Skin Diamond) awaits. The ladies abuse Kade with massive strap on dildos, ramming his tight asshole and brutally face fucking the helpless guy. Lea meets demonically pale Stoya, they practically devour one another in a ravenous session of lesbian lust while acrobatically hanging from the ceiling! Lea battles studly bloodsucker Rocco Siffredi for control of their vampire clan. Policeman Keni Styles arrives on a scene of carnage and winds up in a moonlight anal encounter with insatiable Sandra Romain. When Lea joins in, the evil harlots decide its time to really feast. Fans of Gothic porn and devotees of Staglianos fetish laden, sexually intense cinema will see that legends both horrific and pornographic can take on new life. The hunger continues!&quot;\n\nSkin Diamond, Stoya, Anikka Albrite, Lea Lexis, Sandra Romain, Wolf Hudson, Deviant Kade, James Deen, Keni Styles, plus Samantha Bentley, Rocco Siffredi, Thomas Stone, Clark Kente\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=86422079472416005490.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=86422079472416005490.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=54724780170649493116.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=54724780170649493116.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:265e934dbc42a34946715e318745ab6df278dd4c","amp;dn":"Voracious+Season+Two+Vol+2+XXX+DVDRip+x264-RedSecTioN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"265e934dbc42a34946715e318745ab6df278dd4c","infoHashBuffer":{"type":"Buffer","data":[38,94,147,77,188,66,163,73,70,113,94,49,135,69,171,109,242,120,221,76]},"announce":[],"urlList":[]}}