{"title":"Metal.Evolution.the Series.S01E04.New.Wave.of.British.Heavy.Meta","uid":6990626,"size":753622875,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:26e8d844d5ecd60b213d99dfad5f587f152f59d9&amp;dn=Metal.Evolution.the+Series.S01E04.New.Wave.of.British.Heavy.Meta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1327689503,"description":"Metal Evolution presents 11 episodes based on the ground-breaking Heavy Metal Family Tree. This 26 sub-genre genealogical chart reveals the vast complex progeny of heavy metal from Early Metal and Shock Rock to Thrash, from Progressive Metal to Grunge and Nu Metal. Using the Chart as his road map, host/producer and metalhead turned anthropologist Sam Dunn, crisscrossed the globe exploring the vast history of heavy metal across its 40+ year history and beyond. From bars and back alleys to the biggest open air festivals, Sam will visit the pioneers of British and American hard rock who laid metals sonic foundation, as well as the current leaders of contemporary metal. Whether you love metal, documentaries or just great stories, Metal Evolution is the ultimate examination into the history of Heavy Metal music.\n\nDrawing on the expertise of a whole team of musicians, journalists, academics, and producers, Sam will explore the questions heavy metal fans have always wanted to ask. A highlight of the series will be Sams in-depth discussions with many of heavy metals most important and influential personalities. From Alice Cooper to Slash, Lemmy to Rob Zombie and members of Metallica, Iron Maiden, Black Sabbath, Deep Purple, Slayer, Van Halen, Def Leppard, The Stooges, ZZ Top, Motley Crue, Poison, Rage Against The Machine, Alice In Chains, Korn, and many more, Sam will investigate the history, myths and intricacies of Metal. ","torrent":{"xt":"urn:btih:26e8d844d5ecd60b213d99dfad5f587f152f59d9","amp;dn":"Metal.Evolution.the+Series.S01E04.New.Wave.of.British.Heavy.Meta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26e8d844d5ecd60b213d99dfad5f587f152f59d9","infoHashBuffer":{"type":"Buffer","data":[38,232,216,68,213,236,214,11,33,61,153,223,173,95,88,127,21,47,89,217]},"announce":[],"urlList":[]}}