{"title":"Battlefield.3.2011.ENGLISH.PC-Dark_Lord","uid":6774816,"size":16912017734,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:276b60f04577ffcf8766919f64c24625d3b59dd3&amp;dn=Battlefield.3.2011.ENGLISH.PC-Dark_Lord&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DarkLord2011","files":1859,"time":1319707677,"description":"                               Battlefield.3.2011\n\nRealesdate: 25/10-2011\n\nbrought to you by:Dark_Lord\n\nFilesize: 15.7GB\n\n\n!....Live In Darkness Not Lightness....!\n\n\n\n\n\nBattlefield 3 steps past the competition with the power of Frostbite 2, the latest version of DICE's high-tech game engine.\n\nFrostbite 2 is the foundation on which Battlefield 3 is built, and the game delivers superior graphics, massive destruction, dynamic audio and incredibly lifelike character animations. While the bullets wines, the walls collapsing in, and explosions throw you to the ground, feels the battlefield more lifelike and interactive than ever before. In Battlefield 3 players take the role of U.S. Marines, and may experience heart-pounding single-player missions and competitive multiplayer action in war zones around the world such as Paris, Tehran and New York.\n\nFrostbite 2 - Battlefield 3 introduces the stunning Frostbite 2 technology that takes animation, destruction, lighting, and sound to new heights. The power from the super strong game engine deepens players' physical and emotional relationship to the world around them, in an unprecedented way.\nFeel the fighting - Feel the power of bullets and explosions, for your wounded comrades to safety, and use your weapons from almost all parts of the terrain. Battlefield 3's incredible animation, spectacular graphics and realistic combat gameplay grabs your senses and allow you to experience it emotionally powerful warrior life in a whole new way.\nUnsurpassed Vehicle Warfare - The best vehicle warfare online, is now even better with sound barrier-busting jets, leading an impressive set-up land, air, and sjÃƒÂ¶fordon.\nUrban Warfare - Take tomorrow's wars to the iconic and unexpected places in the U.S., Middle East, and Europe, through the claustrophobic streets, city centers, and vehicle-friendly open spaces.\n\n\nInstallation:\nDont need to install yust open the gamemap and press BF3.exe and play =)!!!\nenjoy\n\n\nSystem:\n\nMinimum requirements for Battlefield 3\n\nOS: Windows Vista or Windows 7\nProcessor: Core 2 Duo 2.4 GHz or Althon X2 2.7 GHz\nRAM: 2GB\nGraphic card: DirectX 10 or 11 compatible Nvidia or AMD ATI card, ATI Radeon 3870 or higher, Nvidia GeForce 8800 GT or higher.\nGraphics card memory: 512 MB\nSound card: DirectX compatibl sound card\nHard drive: 15 GB for disc version or 10 GB for digital version\n\n\n\nRecommended system requirements for Battlefield 3\n\nOS: Windows 7 64-bit\nProcessor: Quad-core Intel or AMD CPU\nRAM: 4GB\nGraphics card: DirectX 11 Nvidia or AMD ATI card, Nvidia GeForce GTX 560 or ATI Radeon 6950.\nGraphics card memory: 1 GB\nSound card: DirectX compatibl sound card\n\n\n\n             \n\n\n              Visit *-- | Tankan. com | --* for more movies and series!\n","torrent":{"xt":"urn:btih:276b60f04577ffcf8766919f64c24625d3b59dd3","amp;dn":"Battlefield.3.2011.ENGLISH.PC-Dark_Lord","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"276b60f04577ffcf8766919f64c24625d3b59dd3","infoHashBuffer":{"type":"Buffer","data":[39,107,96,240,69,119,255,207,135,102,145,159,100,194,70,37,211,181,157,211]},"announce":[],"urlList":[]}}