{"title":"Jeff Dunham: Controlled Chaos (2011) PAL Retail MultiSubs EE-Rel","uid":6737188,"size":4508387989,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:277eaf96229d002de16191ed2557e683134acf6c&amp;dn=Jeff+Dunham%3A+Controlled+Chaos+%282011%29+PAL+Retail+MultiSubs+EE-Rel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"NLUPPER002","files":-1,"time":1318370883,"description":"Jeff Dunham: Controlled Chaos (2011) PAL Retail MultiSubs EE-Rel.NL\n.\n[IMG]http://img28.imageshack.us/img28/8170/jdccw.jpg[/IMG]\n.\nComedy\n\nJeff Dunham is terug met zijn langverwachte vierde show: Controlled Chaos. Een show met alleen maar splinternieuw materiaal. Alle favoriete karakters komen in deze hilarische show voorbij: de oude brombeer Walter, de manische Peanut, Jose JalapeÃ‚Â±o de Mexicaanse peper, en natuurlijk de wereldberoemde Achmed The Dead Terrorist. Bovendien wordt Jeff Dunham bijgestaan door twee nog niet eerder vertoonde karakters, die zorgen voor een flinke chaos op het podium!\n\nJeff Dunham is na het succes van Achmed The Dead Terrorist een wereldwijd fenomeen geworden. Zo verkoopt hij overal de grootste zalen uit en heeft hij meer dan een half miljard Youtubeviews. Controlled Chaos is een geweldige show waar iedereen dubbel om zal liggen: of je nu Dunham-fan bent of hem en zijn karakters voor het eerst ziet.\n\nPLOT\n\nJeff Dunham is back in his much-anticipated fourth concert event, will all-new material and unparalleled comedy that\nsurpasses his record-breaking specials Arguing With Myself, Spark or Insanity, and A Very Special Christmas Special. All the favorites are here: Walter, the grumpy retiree; furry and manic Peanut; Jose Jalapeno, the spicy pepper from south of the border; plus bumbling skeletal Achmed the Dead Terrorist. Dunham is also joined by two never-before-seen characters certain to unleash their own unique havoc on stage. Dunham is an international phenomenon with sold-out stadium-sized concerts, one-half billion YouTube views, and television shows that remain among the highest rated in Comedy Central history. It's no wonder TIME Magazine calls his &quot;the most popular comedian in the U.S.&quot;\nControlled Chaos is guaranteed to deliver an unequaled number of laughs per minute - whether you're a Dunham Maniac or seeing him and his partners for the very first time.\n\nRelease Info: http://www.dvdempire.com/Exec/v4_item.asp?item_id=1581168\n\nFeatures:\n\n- Contains Both Bleeped and Unbleeped Soundtracks\n- Bubba J Winery Tour\n- Outtakes\n- The Necklace\n- Share The Hair\n- Flirting With Victoria\n- Tour Opens\n- Dunham Goes Global\n- Photo Shoot\n- Making of the Achmedmobile\n.\nSource: Retail\nVideo: PAL\nAudio: DD5.1, DD2.0 English\nSubs Retail: Dutch, Swedish, Norwegian, Finnish, Danish, German, French\nMenu: Yes\nSpecial Features: Yes\n.\nEnjoy EE-Rel.NL\n","torrent":{"xt":"urn:btih:277eaf96229d002de16191ed2557e683134acf6c","amp;dn":"Jeff+Dunham%3A+Controlled+Chaos+%282011%29+PAL+Retail+MultiSubs+EE-Rel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"277eaf96229d002de16191ed2557e683134acf6c","infoHashBuffer":{"type":"Buffer","data":[39,126,175,150,34,157,0,45,225,97,145,237,37,87,230,131,19,74,207,108]},"announce":[],"urlList":[]}}