{"title":"One Breath Adam Skolnick Deep by James Nestor KS49 Freediving","uid":15227428,"size":35545493,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27bdbc99400eac71c5647ae15aa126aca5cfb8f1&amp;dn=One+Breath+Adam+Skolnick+Deep+by+James+Nestor+KS49+Freediving&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"KiwiSue49","files":5,"time":1467779807,"description":"TITLE 1:\r\n\r\nOne Breath: Freediving, Death, and the Quest to Shatter Human Limits by Adam Skolnick\r\n\r\nCover design by Elena Giavaldi\r\nCover photograph by Martin Strmiska/Alamy\r\n\r\nDESCRIPTION: (courtesy of Amazon)\r\n\r\nOne Breath is a gripping and powerful exploration of the strange and fascinating sport of freediving, and of the tragic, untimely death of America’s greatest freediver\r\n\r\nCompetitive freediving—a sport built on diving as deep as possible on a single breath—tests the limits of human ability in the most hostile environment on earth. The unique and eclectic breed of individuals who freedive at the highest level regularly dive hundreds of feet below the ocean’s surface, reaching such depths that their organs compress, light disappears, and one mistake could kill them.\r\n\r\nEven among freedivers, few have ever gone as deep as Nicholas Mevoli. A handsome young American with an unmatched talent for the sport, Nick was among freediving’s brightest stars. He was also an extraordinary individual, one who rebelled against the vapid and commoditized society around him by relentlessly questing for something more meaningful and authentic, whatever the risks. So when Nick Mevoli arrived at Vertical Blue in 2013, the world’s premier freediving competition, he was widely expected to challenge records and continue his meteoric rise to stardom.\r\n\r\nInstead, before the end of that fateful competition Nick Mevoli had died, a victim of the sport that had made him a star, and the very future of free diving was called into question. With unparalleled access and masterfully crafted prose, One Breath tells his unforgettable story, and of the sport which shaped and ultimately destroyed him.\r\n\r\n\r\n\r\nTITLE 2:\r\n\r\nDeep: Freediving, Renegade Science, and What the Ocean Tells Us About Ourselves by James Nestor\r\n\r\n\r\nDESCRIPTION:\r\n\r\nDeep is a voyage from the ocean’s surface to its darkest trenches, the most mysterious places on Earth. Fascinated by the sport of freediving—in which competitors descend great depths on a single breath—James Nestor embeds with a gang of oceangoing extreme athletes and renegade researchers. He finds whales that communicate with other whales hundreds of miles away, sharks that swim in unerringly straight lines through pitch-black waters, and other strange phenomena. Most illuminating of all, he learns that these abilities are reflected in our own remarkable, and often hidden, potential—including echolocation, directional sense, and the profound bodily changes humans undergo when underwater. Along the way, Nestor unlocks his own freediving skills as he communes with the pioneers who are expanding our definition of what is possible in the natural world, and in ourselves","torrent":{"xt":"urn:btih:27bdbc99400eac71c5647ae15aa126aca5cfb8f1","amp;dn":"One+Breath+Adam+Skolnick+Deep+by+James+Nestor+KS49+Freediving","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27bdbc99400eac71c5647ae15aa126aca5cfb8f1","infoHashBuffer":{"type":"Buffer","data":[39,189,188,153,64,14,172,113,197,100,122,225,90,161,38,172,165,207,184,241]},"announce":[],"urlList":[]}}