{"title":"Office Romance (1977) DVDRip","uid":7989025,"size":2203584860,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:27e287432e7ad4b3f5dd7e59d27ee53dffc70be1&amp;dn=Office+Romance+%281977%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sergio20121989","files":-1,"time":1357365528,"description":"Office Romance (1977) \nSluzhebnyy roman (original title)\n159 min  -  Comedy | Romance  -   1977 (Soviet Union)\n\nRatings: 8.1/10 from 2,858 users   \n\nStoryline\nAnatoli Yefremovich Novoseltsev works in a statistics institution, whose director is an unattractive and bossy woman. An old friend of his, Yuri Grigorievich Samokhvalov, who gets appointed assistant director of the institution, wants to make Novoseltsev the head of the department but encounters objections from Ludmila Prokopievna Kalugina, the director. Samokhvalov then advises Novoseltsev to lightly hit on the boss. Ironically, Novoseltsev and Kalugina fall in love with each other...\n\nDirector: Eldar Ryazanov\nWriters: Emil Braginskiy (play), Emil Braginskiy (screenplay)\n\nCast\nCredited cast:\n \tAndrey Myagkov\t ...\t\nNovoseltsev\n \tAlisa Freyndlikh\t ...\t\nKalugina\n \tSvetlana Nemolyaeva\t ...\t\nOlga\n \tOleg Basilashvili\t ...\t\nSamokhvalov\n \tLiya Akhedzhakova\t ...\t\nVerochka\nRest of cast listed alphabetically:\n \tGeorgiy Burkov\t ...\t\nZavhoz\n \tZoya Isayeva\t\t\n \tLyudmila Ivanova\t ...\t\nShura\n \tPegas\t ...\t\nWinged Horse\n \tPyotr Shcherbakov\t ...\t\nBublikov\n \tMariya Vinogradova\n\nDid You Know?\n\nTrivia\n\nEldar Ryazanov was very quick to choose Alisa Freyndlikh for the part of Kalugina. It was probably the first case in Soviet cinema when the arts council allowed Ryazanov to choose the actors he wanted. \n\nThe film is based on the play &quot;Sosluzhivtsy&quot; (&quot;Colleagues&quot;) that Emil Braginskiy and Eldar Ryazanov completed in only one month. \n\nOleg Basilashvili didn't like the role of Samokhvalov at first. He wanted to play Novoseltsev and kept trying to convince Eldar Ryazanov he should be chosen for the role. However, Basilashvili admitted during production that Ryazanov distributed the roles correctly. \n\nSamokhvalov's surname corresponds with his image as it comes from the archaic Russian word &quot;samokhval&quot;, which means &quot;self-praiser&quot;, &quot;boaster&quot;. \n\nIn the original play, Vera was a young long-legged beauty but when Emil Braginskiy and Eldar Ryazanov were rewriting the play for the film, they wrote this role for Liya Akhedzhakova. \n\nIt was planned at first that Vera's husband would have a much larger role in the film. Mikhail Svetin was offered the role but later on, the filmmakers dropped the idea. Afterwards, Aleksandr Fatyushin was cast. His character was supposed to keep choosing between his wife and his motorcycle and the two characters would keep quarreling because of this. Some scenes with Akhedzhakova and Fatyushin were even filmed but then Fatyushin went down with a serious illness that required surgery. In the end, Vera's husband appears in the film only as a voice on the phone. \n\nIt took Eldar Ryazanov and Alisa Freyndlikh quite a while to find costumes fitting Kalugina's character. They searched the wardrobes of Mosfilm Studios and found skirts and jackets, but still thought some detail was missing. Good luck helped them in the end, when cinematographer Vladimir Nakhabtsev brought his father's old glasses to the set, just in case. When Freyndlikh put them on, it was clear Kalugina's image was complete. \n\nIn one scene, Olga Ryzhova reads a poem &quot;O, moy zastenchivyy geroy...&quot; by Bella Akhmadulina. The poem, written in 1960 or 1961, was still unpublished when the film was released, and Svetlana Nemolyaeva, who played Ryzhova, had to write copies of the poem by hand and send them to her fans for several years after the film's release. \n","torrent":{"xt":"urn:btih:27e287432e7ad4b3f5dd7e59d27ee53dffc70be1","amp;dn":"Office+Romance+%281977%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27e287432e7ad4b3f5dd7e59d27ee53dffc70be1","infoHashBuffer":{"type":"Buffer","data":[39,226,135,67,46,122,212,179,245,221,126,89,210,126,229,61,255,199,11,225]},"announce":[],"urlList":[]}}