{"title":"Sexually Broken--MILF-tastic Ava Devine sybian orgasmed  Matt Wi","uid":8809765,"size":1099066728,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:2849c6cea5d80d44f8ec40c769afaa51a3054cd6&amp;dn=Sexually+Broken--MILF-tastic+Ava+Devine+sybian+orgasmed++Matt+Wi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":-1,"time":1376429774,"description":"MILF-tastic Ava Devine, sybian orgasmed out of her mind while brutally throat fucked! | Ava Devine | Matt Williams\n\nAugust 12, 2013 \n \n\nMP4 only.\n \n \nToday we happily welcome back the MILF to end all MILFS, Ava Devine. She is all tits and ass, so curvy you just don't know where to look first. This out of control sex addict simply can NOT get enough orgasms, it doesn't matter how many she has, she always craves more. We have tried to break her sexually in the past with dick and it didn't even phase her. Time for the big guns-The Sybian.\n\nThe sybian is, quite simply, the most powerful vibrator known to man. It sounds like a jet plane taking off and strapped between a girl's legs, even a crazed sexual beast such as Ava will have no choice but to notice. The setup is quite simple. We tie her down, oil her up and turn on the sybian to work it's magic. That is all it takes. Ava is quickly reduced to a drooling, cumming, moaning, glassy-eyed mess. It seems that this sex addict just finally might be getting her fill.\n\nHowever, Sexuallybroken isn't about giving girls their fill, it is about overwhelming them, blasting them right out of their pretty little skulls. In that spirit, we add not one but two cocks to the mix. While Ava is having orgasm after orgasm ripped out of her booming body, we go to town on her drooling mouthhole. Now she can't get on top of it, can't maintain. The cocks have no mercy, she is just a warm hole to use as we see fit. Bondage, orgasms, blowjobs, rinse and repeat. This will go on as long as we desire.\n\nIn the end she is completely used up, hanging limply in her bondage as the sybian owns her pussy, sweat glistening off of her outrageous curves. Today is the day that Ava Devine just might grasp the meaning of &quot;Sexually Broken&quot;. \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_12adevine4/SexuallyBroken-Ava-Devine-Matt-Williams-MILF-tastic-Ava-Devine-sybian-orgasmed-out-of-her-mind-while-brutally-throat-fucked.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_12adevine4/SexuallyBroken-Ava-Devine-Matt-Williams-MILF-tastic-Ava-Devine-sybian-orgasmed-out-of-her-mind-while-brutally-throat-fucked.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:2849c6cea5d80d44f8ec40c769afaa51a3054cd6","amp;dn":"Sexually+Broken--MILF-tastic+Ava+Devine+sybian+orgasmed++Matt+Wi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2849c6cea5d80d44f8ec40c769afaa51a3054cd6","infoHashBuffer":{"type":"Buffer","data":[40,73,198,206,165,216,13,68,248,236,64,199,105,175,170,81,163,5,76,214]},"announce":[],"urlList":[]}}