{"title":"Prison Architect","uid":8836644,"size":123440935,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:29eb29b2d24bf9b35218868f53493ad8a2b035bc&amp;dn=Prison+Architect&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gavineitor","files":73,"time":1377132005,"description":"Prison Architect is an upcoming construction and management simulation game by the British game developer Introversion Software.It was made available as a crowdfunded paid Alpha pre-order on September 25, 2012 with updates scheduled every three to four weeks. With over 185,000 copies sold, Prison Architect has made close to $6 million in pre-order sales for the Alpha version. Prison Architect was an entrant in the 2012 Independent Games Festival.\n\nGameplay\n\nThe game is a top-down construction and management simulation where the player takes control of the building and running a prison. The player is responsible for managing various aspects of their prison including building cells and facilities, planning and connecting utilities, hiring and assigning staff, finance, and keeping their inmates content. The player's role is of both architect and governor with sandbox micromanagement themes such as choosing where to put lights, drains and how they connect together. The game takes inspiration from Theme Hospital, Dungeon Keeper and Dwarf Fortress.","torrent":{"xt":"urn:btih:29eb29b2d24bf9b35218868f53493ad8a2b035bc","amp;dn":"Prison+Architect","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29eb29b2d24bf9b35218868f53493ad8a2b035bc","infoHashBuffer":{"type":"Buffer","data":[41,235,41,178,210,75,249,179,82,24,134,143,83,73,58,216,162,176,53,188]},"announce":[],"urlList":[]}}