{"title":"The.Tudors.S04E09.HDTV.XviD-SYS","uid":5630748,"size":575812137,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2a608b51e60c6bedb9866593bcd67d5d580f93ec&amp;dn=The.Tudors.S04E09.HDTV.XviD-SYS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hiest","files":2,"time":1276667439,"description":"The Tudors\n\n\n\nGenre: Drama, History, Romance\n\nYear: 2010\n\nCountry: Ireland, Canada, USA\n\nRuntime: ~55 min\n\nProducer: Michael Hirst\n\nCast: Jonathan Rhys Meyers, Henry Cavill, James Frain, Anthony Brophy, Natalie Dormer, Nick Dunning, Sarah Bolger, Max Brown\n\n\n\n.: Plot :.\n\nThis costume drama features England's splendid Renaissance dynasty under King Henry VIII. Beginning in Season 1 when Henry VIII was growing desperate for an heir and growing distant from his first wife, the series moves quickly to the period when Anne Boelyn became his obsession. During this time Cardinal Wolsey rose to become the power behind his throne, ruling ruthlessly and nearly absolutely while Henry (played by Johnathon Rhyes Meyers) for the most part followed the Cardinal's advice, maneuvering through a series of betrayals and plots against him. When Anne Boelyn plays much harder to get than any woman ever has, Henry begins to search for a way out of his marriage to Katherine of Aragon, so that he can make Anne his wife. Needing a divorce, Henry turns to Wolsey, who promises to help him create waves of backlash from the church, as well as the Spanish Habsburg dynasty and its overseas empire. Against this background, gyrate the private lives and political intrigues of several members of the royal court and chancery. This includes Henry's friend and his sister Margaret's true love Charles Brandon, the Habsburg ambassadors, greedy and power-hungry schemers, their incidental victims and composer Thomas Tallis...\n\n\n\n Rating: 8.1/10   7,466 votes","torrent":{"xt":"urn:btih:2a608b51e60c6bedb9866593bcd67d5d580f93ec","amp;dn":"The.Tudors.S04E09.HDTV.XviD-SYS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a608b51e60c6bedb9866593bcd67d5d580f93ec","infoHashBuffer":{"type":"Buffer","data":[42,96,139,81,230,12,107,237,185,134,101,147,188,214,125,93,88,15,147,236]},"announce":[],"urlList":[]}}