{"title":"Lost Planet 3 FullRip","uid":8873509,"size":4112732146,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2a7e8a556e61662ea21e6ee84fc1ea4b6af51474&amp;dn=Lost+Planet+3+FullRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"globeplus","files":-1,"time":1378132821,"description":"Hi new nice games fans ...\n\nPlay the new Lost Planet game ...\n\n\nFILE INFO : MAXIMUM ripping point achived in no multiplayer, single language available , videos worked , 20% to 30% audio ripped and general details that was possible the work without damaging the gameplay ...\n\n\n\nPlot\n\nThe game takes place long before the events of the first game, and hence the planet of E.D.N. III is still in an ice-age like environment rather than the tropical environment of the second game that occurs after the events of the first game. It takes place during the time of the first few human colonists on E.D.N. III sent there by the Neo-Venus Construction company or NEVEC, who later become the main antagonists for the series. The game follows the story of Jim Peyton, a colonist who is working for NEVEC and helping mine the planet and sending minerals back to Earth, where his family awaits him. The game, however, doesn't feature militarized VS bipedal mechs like previous entries in the series, and instead features mechs called Rigs that are the predecessors of VS mechs, given the timeline of the game. Unlike VS mechs, Rigs aren't militarized with weapons and instead are equipped with drill arms and claw arms for mining.[5][6]\n\nIn the first game, NEVEC had become a dictatorial force on E.D.N. III having defeated the Akrid and only being left with defeating the Snow Pirates who were rebelling against their governance. However, in the game NEVEC has not yet become an antagonist and instead is helping make the planet habitable to humans by constructing thermal posts on the planet to combat the harsh icy weather conditions. Though as the story progresses Jim begins to unravel the dark secrets of NEVEC.\n\n\n\n* enjoy ...","torrent":{"xt":"urn:btih:2a7e8a556e61662ea21e6ee84fc1ea4b6af51474","amp;dn":"Lost+Planet+3+FullRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a7e8a556e61662ea21e6ee84fc1ea4b6af51474","infoHashBuffer":{"type":"Buffer","data":[42,126,138,85,110,97,102,46,162,30,110,232,79,193,234,75,106,245,20,116]},"announce":[],"urlList":[]}}