{"title":"Dangerous Toys - Teasing And Pleasing","uid":4952607,"size":122257412,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2ad517ee388a6edeb4277fb434e35bf3f99736fb&amp;dn=Dangerous+Toys+-+Teasing+And+Pleasing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1244960258,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nDangerous Toys was an Austin, Texas-based hard rock band with often humorous lyrics. Founded in 1987, Dangerous Toys put out four full-length albums and one live album before unofficially disbanding at the turn of the millennium.\n\nTheir major label debut, the Gold-certified Dangerous Toys featured the singles &quot;Teas N' Pleas N' &quot; and &quot;Scared&quot;. In 2006 &quot;Teas N' Pleas N' &quot; was covered by Shadows Fall (Atlantic Records) on their B-Sides LP Fallout From The War, featuring guest vocals from Toys' vocalist Jason McMaster.\n\nDangerous Toys is the debut album by Texas hard rock band Dangerous Toys, released in 1989. It includes the singles &quot;Teas'n Pleas'n&quot; and &quot;Scared,&quot; the former covered by Shadows Fall on Fallout from the War, the latter a tribute to Alice Cooper.\n\nAlthough second guitarist Danny Aaron is pictured on the album's back cover and credited for playing, he does not play on the album. Before the album's recording, Trembley left the band, leaving Scott Dalhover their only guitarist. All guitars on the album are played by Dalhover.\n\nDangerous Toys was formed in October 1987. Jason McMaster, singer for Watchtower, was invited by Tim Trembley to join his band, Onyxx, as singer. Onyxx included Scott Dalhover (guitar), Mark Geary (drums) and Mike Watson (bass).\n\nIn 1988, now calling themselves Dangerous Toys, the band were signed to Columbia Records. Soon afterwards Tim Trembley left the band, and they were without a second guitarist. On their eponymous debut album, produced by Max Norman (Megadeth, Ozzy Osbourne) Scott Dalhover played all the guitar tracks. Shortly before its release, guitarist Danny Aaron joined. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2ad517ee388a6edeb4277fb434e35bf3f99736fb","amp;dn":"Dangerous+Toys+-+Teasing+And+Pleasing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ad517ee388a6edeb4277fb434e35bf3f99736fb","infoHashBuffer":{"type":"Buffer","data":[42,213,23,238,56,138,110,222,180,39,127,180,52,227,91,243,249,151,54,251]},"announce":[],"urlList":[]}}