{"title":"Mary Coughlan - Tired And Emotional","uid":4111905,"size":59186868,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2b205b9bc568bfe6bea825a510d9fafa7c9f0a2f&amp;dn=Mary+Coughlan+-+Tired+And+Emotional&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makethecherryred","files":11,"time":1207098480,"description":"Irish torch singer Mary Coughlan was born in Galway in 1956; after enduring a painful adolescence that included bouts with drugs and alcohol as well as a stay in a mental hospital, she relocated to London at the age of 19, living in a hippie squat. After several lean years of waitressing and sweeping streets, Coughlan returned to Ireland in 1974, where a chance encounter with Dutch musician Erik Visser helped point her towards a singing career; specializing in jazz and blues, she began slowly earning a reputation on the pub circuit, which resulted in a handful of television appearances. From there, she and Visser moved on to sold-out concert dates, and in 1985 Coughlan finally recorded her debut LP, Tired and Emotional, a major hit in her native land. A number of other records followed in the years to come, and she became a critical favorite throughout much of Europe; with 1997&amp;#039;s After the Fall, Coughlan made her U.S. debut, soon earning a devoted following on American shores as well. Three years later, Coughlan issued the vibrant tribute album Sings Billie Holiday. Long Honeymoon appeared in spring 2001. \n","torrent":{"xt":"urn:btih:2b205b9bc568bfe6bea825a510d9fafa7c9f0a2f","amp;dn":"Mary+Coughlan+-+Tired+And+Emotional","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b205b9bc568bfe6bea825a510d9fafa7c9f0a2f","infoHashBuffer":{"type":"Buffer","data":[43,32,91,155,197,104,191,230,190,168,37,165,16,217,250,250,124,159,10,47]},"announce":[],"urlList":[]}}