{"title":"DMZ (Brian Wood)","uid":4569636,"size":539530135,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2b3c8c89090e8be158e6a645d6fc6c1b84ed47c6&amp;dn=DMZ+%28Brian+Wood%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ParrowJack","files":37,"time":1229011678,"description":"DMZ is written by Brian Wood, with artwork by Wood and Riccardo Burchielli (the Italian artist&amp;#039;s first comic book in the United States).\n\nThe setting is New York City in the near future. A civil war is taking place between the United States of America and the Free States. Midwestern militia groups revolt against their local governments in protest of rampant U.S. adventurism overseas and, in the absence of the National Guard, are able to gain far more ground than they thought possible. Small insurgent groups pop up in towns and cities across the country, and a sizable force, the Free States Army, pushes toward Manhattan. The city proves too big for them to take, and also for the U.S. Army to defend. The war stalls there, a stalemate. The series is seen through the eyes of Matthew (Matty) Roth, a naÃƒÂ¯ve photo journalism intern from Long Island, who enters the DMZ with a news-crew. He becomes trapped when the rest of the news crew and the soldiers escorting them are killed in a firefight with &quot;insurgents&quot;. Matty becomes the only journalist on the ground in the DMZ and he begins to report on the daily struggle of life for the everyday citizens of Manhattan.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:2b3c8c89090e8be158e6a645d6fc6c1b84ed47c6","amp;dn":"DMZ+%28Brian+Wood%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b3c8c89090e8be158e6a645d6fc6c1b84ed47c6","infoHashBuffer":{"type":"Buffer","data":[43,60,140,137,9,14,139,225,88,230,166,69,214,252,108,27,132,237,71,198]},"announce":[],"urlList":[]}}