{"title":"Unicorn Ensemble - Chominciamento Di Gioia","uid":4975391,"size":88855868,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2b4a703a369d2eb7e8a28f87d85ef871671244be&amp;dn=Unicorn+Ensemble+-+Chominciamento+Di+Gioia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bludanube","files":15,"time":1245969750,"description":"Ensemble Unicorn\nChominciamento di gioia \nVirtuoso Dance Music from the time of Boccaccio's Decamerone (14th century) \nBitrate: 192\n\nThis superb disc makes a fascinating and marvellous introduction to the instrumental music of 14th century Italy. Specifically, this is a very famous collection of 14 monophonic dance pieces from Northern Italy, dated c.1390. Boccaccio's Decamerone is a long story of ten young nobles (men and women) who have retreated to the countryside to escape the Black Death - the terrible epidemic of bubonic plague of 1347-50 which destroyed 25 million people. \n\nLodging in the countryside, these refugees passed time by entertaining themselves with song, dance and story. This collection of music is not specifically related to the story or its characters, but is presented in relation to and perhaps a reflection of the artistic styles, tastes and moods of the time. \n\nThe richness of the music, both in terms of melodic appeal and emotional range, is extremely impressive. Couple this with the huge range of colours, the phenomenal skill and the musical sensitivity of the Ensemble Unicorn, and you get a whole hour's worth of absorbing entertainment. The Naxos sound too, captures every instrument's every line to atmospheric perfection. \n\nAmong the pieces are four saltarelli, a dance form involving the stamping of feet. The disc begins with the vigourous rhetoric of the title piece, Chominciamento di gioia - &quot;The Beginning of Joy&quot;. To this, the insistent tune of Saltarello No.4 is tagged on. Saltarello No.1 is another fast-paced work involving hurdy-gurdy and fiddles. Most of these pieces will sound very Arabian in tone to the novice listener - bear in mind that Medieval Europe was a very cosmopolitan place and many instruments and techniques were in fact borrowed from the Middle East. Saltarello No.2, with its plucked-string ensemble, is a highly evocative work, literally highly strung with energy. Finally, Salterello No.3 is a joyful little minature, only 54 seconds in length, where the (I think) ocarina chirps and whistles happily with the hurdy-gurdy and hand drums. \n\nIn contrast to most of these fast pieces is the beautiful Lamento di Tristano (Lament of Tristan). Depicting the resigned mood of the famous story of Tristan and Isolde (in my opinion even more tragic than Romeo and Juliet), it is first played with great atmosphere on medieval harp, followed by the sorrowful strains of the hurdy-gurdy, made all the more tragic by its coarse voice. The disc ends with the melancholic La Manfredina, a slow sad song over the distant boom of a low drum, with the quick variations (La Rotta) at the end.\n\nWomen feature strongly in the music. First to appear on disc is the solemn-heroic Bellicha - &quot;The War-like Woman&quot;. This piece is really amazing: while exuding a keen sense of strongly-wrought power, it still radiates a certain elegance and nobility. I picture Amazons riding to war, their weapons and armour glittering, and yet their gracefully sculpted bodies shining in beauty. \n\nIsabella is another slowish, meditative piece, almost nine minutes long, and very evocative. It consists of a recorder seemingly flirting and dancing with a fiddle; both sound as if they are conversing over the drone of the hurdy-gurdy. Very beautiful. The specific identity of Isabella is unknown. Isabella is followed by the sultry Ghaetta, which means &quot;The Cheerful Woman&quot;. Imagine veiled Arabian girl dancing before a fire (but forgive me for stereotyping). \n\nThis manuscript is credited for many things, one for being the first attempt at programmatical music. Although the meaning escapes us now, there are strangely titled pieces such as the quick Tre fontane (&quot;Three Springs/Fountains&quot;), or Parlamento (&quot;Talk&quot;), a quiet nocturne-like piece for harp, perhaps depicting evening conversation. In pro (&quot;Please&quot;), with its interludes of bold and quiet music is one of those pieces in which the Ensemble allots each interlude to a different soloist, giving the listener maximum opportunity to hear each instrument. Again, the display of their skill, musicality and sensitivity is breathtaking. \n\n But wait till you hear Michael Posch on Principio di virtÃƒÂº! Curiously titled &quot;Principle (or Source) of Virtue&quot;, this is a virtuoso tour de force for the recordist. To the accompaniment of strings and hand drums, Posch plays a &quot;moto perpetuo&quot; melody which just staccatos on and on at a very fast tempo. This is the kind of music where you ask, &quot;Doesn't he need to breathe??&quot; \n\nLuckily for us, the Black Death did not kill this wonderful music. Riccardo Delfino writes in the notes that the music here may represent the experimental music of the 14th century, &quot;seeking to define the boundaries of the new art of music&quot; (that is, music for non-sacred purposes). Elsewhere it has also been said that the music of this manuscript (Ms.29987 in the British Library - I wonder why the hell it's there and not at home), in its development of instrumental dance, was the forefather of the Baroque dance suite. \n\nWhatever the case, the Ensemble Unicorn make a wonderful case for the pieces. For them, &quot;[t]he underlying principle of interpretation has always been that of joy in music and creativity - Il chominciamento di gioia.&quot; \n\n\n01. Lamento di Tristano et la Rotta \n    Composed by Anonymous \n    with Vienna Ensemble Unicorn \n\n\n02. Bellicha (British Library Ms. 29987) \n    Composed by Italian Anonymous \n    with Vienna Ensemble Unicorn \n\n\n03. Tre fontane \n    Composed by Italian Anonymous \n    with Vienna Ensemble Unicorn \n\n\n04. Parlamento \n    Composed by Anonymous \n    with Vienna Ensemble Unicorn \n\n\n05. Principio di Virtu \n    Composed by Anonymous \n    with Vienna Ensemble Unicorn \n\n\n06. Saltarello No. 1 (British Library Ms. 29987) \n    Composed by Italian Anonymous \n    with Vienna Ensemble Unicorn \n\n\n07. Trotto (14th century) \n    Composed by Italian Anonymous \n    with Vienna Ensemble Unicorn \n\n\n08. Saltarello No. 2 (British Library Ms. 29987) \n    Composed by Italian Anonymous \n    with Vienna Ensemble Unicorn \n\n\n09. Isabella \n    Composed by Anonymous \n    with Vienna Ensemble Unicorn \n\n\n10. Ghaetta (An Istampita) (14th cent.) \n    Composed by Italian Anonymous \n    with Vienna Ensemble Unicorn \n\n\n11. Saltarello No. 3 (British Library Ms. 29987) \n    Composed by Italian Anonymous  \n    with Vienna Ensemble Unicorn \n\n\n12. In pro \n    Composed by Anonymous \n    with Vienna Ensemble Unicorn \n\n\n13. La Manfredina et la Rotta \n    Composed by Anonymous \n    with Vienna Ensemble Unicorn \n\n14. La Manfredina et la Rotta \n    Composed by Anonymous \n    with Vienna Ensemble Unicorn \n","torrent":{"xt":"urn:btih:2b4a703a369d2eb7e8a28f87d85ef871671244be","amp;dn":"Unicorn+Ensemble+-+Chominciamento+Di+Gioia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b4a703a369d2eb7e8a28f87d85ef871671244be","infoHashBuffer":{"type":"Buffer","data":[43,74,112,58,54,157,46,183,232,162,143,135,216,94,248,113,103,18,68,190]},"announce":[],"urlList":[]}}