{"title":"The Guide - Following the Buddhist Path","uid":4555813,"size":1391818036,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2b6a6ba371e7ce447b9d069599ac0fd37319044a&amp;dn=The+Guide+-+Following+the+Buddhist+Path&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheBuddhist","files":1,"time":1228482168,"description":"Documentary on Buddhism in the UK\n\nFrom a rambling, Gothic mansion in the English Lake District, an unassuming Tibetan monk presides over one of today's fastest growing religious groups, the New Kadampa Tradition. Born at the 'Roof of the World' as Tibet was struggling to retain its independence, Geshe Kelsang Gyatso Rinpoche, eventually had to flee his monastery and homeland in the face of the advancing Chinese. After nearly twenty years on retreat in the Himalayas, he was invited to England to interpret the Dharma - or pure Buddhist teachings - for Westerners.\n\nNow a best-selling author and the spiritual leader of the NKT, resident at Conishead Priory near Ulverston, England, Geshe Kelsang has dedicated his life to helping all living beings achieve Nirvana, or Enlightenment. So just who is Geshe Kelsang, what does he teach, and why have thousands of people from around the world devoted their lives to his cause? This 85-minute video explores the man, his message and the daily lives of the Buddhist nuns, monks and lay people who have found the answer to life's conundrum in his practical message of wisdom and compassion.\n\nRevealing for the first time the revitalised splendour of Conishead Priory, the colourful rituals of the NKT and an exclusive interview with Geshe Kelsang. The Guide is a unique testament to one of the most revered spiritual leaders of our time. Shot on location both in the beautiful Cumbrian countryside and in the vibrant U.S. west coast city of Seattle, the programme offers anyone with an interest in life a fascinating insight into the Buddhist Path.\n\n\n\n===================================================================================             Please help me by continuing to seed. Thank you!                    \n===================================================================================","torrent":{"xt":"urn:btih:2b6a6ba371e7ce447b9d069599ac0fd37319044a","amp;dn":"The+Guide+-+Following+the+Buddhist+Path","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b6a6ba371e7ce447b9d069599ac0fd37319044a","infoHashBuffer":{"type":"Buffer","data":[43,106,107,163,113,231,206,68,123,157,6,149,153,172,15,211,115,25,4,74]},"announce":[],"urlList":[]}}