{"title":"Greatest American Hero","uid":7265824,"size":53206825,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2bc1fb8edc38b8531361c3ab374fe4c0af5f171f&amp;dn=Greatest+American+Hero&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmokeBogey","files":-1,"time":1336885244,"description":"The Greatest American Hero is an American comedy-drama television series that aired for three seasons from 1981 to 1983 on ABC. Created by producer Stephen J. Cannell, it premiered as a two-hour movie pilot on March 18, 1981. The series stars William Katt as teacher Ralph Hinkley (&quot;Hanley&quot; for the latter part of the first season), Robert Culp as FBI Agent Bill Maxwell, and Connie Sellecca as lawyer Pam Davidson.\n\nThe show chronicles Ralph's adventures after a group of aliens gives him a red suit that gives him superhuman abilities. Unfortunately, Ralph, who hates wearing the suit, immediately loses its instruction booklet, and thus has to learn how to use his powers by trial and error, often with comical results.\n\nIn July 2008, it was announced that Katt was writing a comic book series based on the TV show for his publishing company, Catastrophic Comics, in conjunction with Arcana Studios. The three-issue mini-series debuted later that year, featuring an updated retelling of the original pilot episode set in the present day. Katt also contributes to the show's Facebook page.\n\nTorrent contains all three issues.  I had these files when someone requested them, but I decided to bring this torrent back to life instead of re-upping it.  Thanks LT.","torrent":{"xt":"urn:btih:2bc1fb8edc38b8531361c3ab374fe4c0af5f171f","amp;dn":"Greatest+American+Hero","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bc1fb8edc38b8531361c3ab374fe4c0af5f171f","infoHashBuffer":{"type":"Buffer","data":[43,193,251,142,220,56,184,83,19,97,195,171,55,79,228,192,175,95,23,31]},"announce":[],"urlList":[]}}