{"title":"KAEMSOFT Screeny v3.3.5 Professional Bilingual with Key [TorDigg","uid":8269089,"size":21243003,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2be37a07b472fd748c435cc2a642877f8832bec1&amp;dn=KAEMSOFT+Screeny+v3.3.5+Professional+Bilingual+with+Key+%5BTorDigg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":10,"time":1363564845,"description":"Screeny 3 Professional\n\nScreeny 3 Professional is capture utility.\n\nScreeny 3 Professional, the software for individuals, is a very powerful and flexible tool for professional desktop screenshots and videos, which you can hold everything from your screen as an image or video.\n\nScreeny 3 is the screenshot program for professional screen shots, even from DirectX games, passing opportunities with innovative, comprehensive assessment and. Through seamless integration with MS Office, Screeny 3 Professional also fits perfectly into your office environment.\n\nWho takes screenshots every day, the work makes it easier to Screeny 3 Professional!\n\nForget rigid operating concepts from other providers! Configure your user interface itself! Set yourself, what to include and what to do with it. All settings are stored in macro profiles, which you can customize to your needs. Modify the existing profiles from macro to your liking, or create new, completely personalized with your settings. You can sort your macro profiles in groups, and so the user interface Screeny 3 Adjust your wishes. All consumption-related settings are managed in this macro profiles, configurable. You can create your own macros, customize, whether shooting range, hotkey, effect settings! .... And with the different styles you can also customize the look of Screeny 3 individually to your taste\n\nThe applications for Screeny 3 Professional are very diverse\n\nfor assistance in the user interface of programs\nfor image copies of programs that can not otherwise be saved\nfor error documentation from an image\nfor demonstration videos of programs for product advertising\nInstallation procedures illustrate\nUsing a software mediate\n...\nThe concept\n\nBedienkozept flexible, to adapt the functionality to your needs\nMacro-based interface, create your own macros, each with different properties for the recording area and output, etc.\nMacro-based or global termination of the hosting (activation, output, etc.)\nAppearance of the user interface (themes) to your personal taste choice (Black, Blue ...)\nBuilt-in tools\n\nPowerful image editor for your images\nImage browser with 2-window view and Explorer functionality\nImage Converter can convert, just shooting in different file formats\nRecording options screenshot mode\n\nScreeny 3 Professional, has a high budget shooting to really take everything exactly from the screen as you want recording.\n\nShooting:\n\nRecording selection rectangle\nChoice about receiving\nFree admission selection\nHost region selection\nWindow Capture\nWindow Capture client\nWindow Capture all visible windows\nRecord menu, record nested menu structures child's play\nScrolling areas receive\nSubject receiving\nFull screen\nDOS window\nOutput options screenshot mode\n\nScreeny 3 Professional, has extensive deployment options to bring your recording to the destination of your choice.\n\nRecording can be saved in the following formats:\n\nJPG file\nGIF file\nPNG\nBMP file\nTIFF file\nPDF file\nThe recordings can also be made directly from Screeny 3 Professional passed on to different targets:\n\nSave as File\nPrint\nSend by e-mail\nUpload to FTP server\nTo application\nThe internal editor insert\nIn MS Excel\nIn MS Word\nIn MS PowerPoint\ninsert into MindManager\nSave in clipboard\nDrop drag and drop in almost any application\nSave as PDF file\n\nRecording video recording capabilities\n\nWith Screeny 3 Professional, you also have the option of video recordings of the event record on the screen, ideal as of intuition or training video to illustrate eg operating steps in programs, including natural sound from such a connected microphone.\n\nHere, too, different shooting modes and output formats to choose from:\n\nShooting:\n\nFull screen\nSelection area\nSelectable window\n\nOutput formats:\n\nAVI\nWMV\nFLV\nSWF\n\nLanguage:\n\n-German\n-English\n\nSystem Requirements\n\nXP/Vista/7/8 Windows (x86)\nPentium IV, 1.2 GHz\nDirectX 9 or higher\nGraphics card 16 bit color depth (High Color), 64 MB RAM\n50 MB of hard disk space\nInternet connection (only for online update)\n512 MB RAM (1 GB RAM or higher for Windows Vista / 7 and above)\nWindows Media Player version 9.x\n\nRecommended:\n\nPentium IV, 2.4 GHz or higher\nGraphics card 16 bit color depth (high color), 256 MB RAM or higher\n2 GB RAM or higher\n\nHomepage: http://www.kaemsoft.de\n\nInstallation Instructions:\n\n- Install program \n(it will install in German Language, will give you option to change language on first time Application run).\n- Register Application with given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:2be37a07b472fd748c435cc2a642877f8832bec1","amp;dn":"KAEMSOFT+Screeny+v3.3.5+Professional+Bilingual+with+Key+%5BTorDigg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2be37a07b472fd748c435cc2a642877f8832bec1","infoHashBuffer":{"type":"Buffer","data":[43,227,122,7,180,114,253,116,140,67,92,194,166,66,135,127,136,50,190,193]},"announce":[],"urlList":[]}}