{"title":"Grant Allen - How It Feels To Die, By One Who Has Tried It and O","uid":9518884,"size":488893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c5b90ff6a214733e2e72ecd404d57cc2ea3f1b8&amp;dn=Grant+Allen+-+How+It+Feels+To+Die%2C+By+One+Who+Has+Tried+It+and+O&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xetron","files":1,"time":1390591230,"description":"This is a collection of stories by Grant Allen, published in various years. The title story is personal. Allen nearly drowned when he fell through the ice while skating as a boy in Canada, and wrote about the experience anonymously for the Pall Mall Gazette in 1892. He claimed to have been &quot;as dead as he ever can be or will be&quot; and that he had no &quot;after death&quot; experiences. This suited his atheistic position, of course. In fact he was not &quot;dead&quot; at all; just unconscious, and he was quickly revived by brandy and massage.\n\nThe stories are:\n\nHOW IT FEELS TO DIE. BY ONE WHO HAS TRIED\n\nIT (1892);\n\nMERIEL STANLEY, POACHER (1900);\n\nA STUDY FROM THE NUDE (1895);\n\nMY ONE GORILLA (1890);\n\nTHE TRADE OF AUTHOR (1889);\n\nA SCRIBBLER'S APOLOGY (1883).\n\nThe last two are non-fiction essays by Allen about the craft of writing in his time. Here are brief reviews by Peter Morton:\n\n&quot;'A SCRIBBLER'S APOLOGY'. A splendidly agonised piece about the true social worth of the journeyman writer's life, particularly the worth (if any) of the kind of 'tootler' which Allen represents himself as being. Published in the Cornhill in May 1883.&quot;\n\n&quot;'THE TRADE OF AUTHOR'. This remarkable article, published in the Fortnightly Review in 1889, has just been identified as by Grant Allen. (It is not attributed in the Wellesley Index.) It is a brilliant analysis of the professional writer's plight at the time, worthy to be set against Gissing's New Grub Street.&quot;\n\nThe source of these 6 stories is the website by Peter Morton, author of &quot;The Busiest Man in England&quot;: Grant Allen and the Writing Trade, 1875-1900, published by Palgrave Macmillan, as linked from the Wikipedia page about Grant Allen.","torrent":{"xt":"urn:btih:2c5b90ff6a214733e2e72ecd404d57cc2ea3f1b8","amp;dn":"Grant+Allen+-+How+It+Feels+To+Die%2C+By+One+Who+Has+Tried+It+and+O","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c5b90ff6a214733e2e72ecd404d57cc2ea3f1b8","infoHashBuffer":{"type":"Buffer","data":[44,91,144,255,106,33,71,51,226,231,46,205,64,77,87,204,46,163,241,184]},"announce":[],"urlList":[]}}