{"title":"Kimmie Rhodes-Walls Fall Down (2008-VBR-Country)","uid":4115491,"size":54580389,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2c9076e8edfffa374d3157b58140cacb40287d31&amp;dn=Kimmie+Rhodes-Walls+Fall+Down+%282008-VBR-Country%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cheng","files":16,"time":1207284168,"description":" &lt;a href=&quot;http://www.kimmierhodes.com/PageMill_Images/WFD-Cover-copy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.kimmierhodes.com/PageMill_Images/WFD-Cover-copy.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.kimmierhodes.com/PageMill_Images/WFD-outside-back-copy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kimmierhodes.com/PageMill_Images/WFD-outside-back-copy.jpg&lt;/a&gt;\n\n-=Biography=- by Jason Ankeny\n\nThe singing career of Lubbock, TX, native Kimmie Rhodes kicked off at the age of six, when she first performed with her family gospel trio. During her teens she began learning guitar and writing songs, and in 1979 moved to Austin, where she met her future husband and producer Joe Gracey. Two years later, Rhodes released her debut LP, Kimmie Rhodes and the Jackalope Brothers, followed in 1985 by her second effort, Man in the Moon. She recorded her third album, 1989&amp;#039;s Angels Get the Blues, at Sun Studios in Memphis. While commercial success continually eluded Rhodes, her music proved popular with other performers; her song &quot;I Just Drove By&quot; was covered by Wynonna on the Tell Me Why album, and the duet pairing of Trisha Yearwood and Willie Nelson recorded &quot;Hard Promises to Keep&quot; for Yearwood&amp;#039;s The Song Remembers When. Rhodes herself also cut a pair of duets with Nelson for his Just One Love LP; Nelson returned the favor for Rhodes&amp;#039; 1996 effort West Texas Heaven, on which she also teamed with Waylon Jennings and Townes Van Zandt. Rich From the Journey followed in the spring of 2000. \n\n   _______________________________________________________________________\n\n      a r t i s t : Kimmie Rhodes\n        t i t l e : Walls Fall Down\n          d a t e : 2008\n        l a b e l : Sunbird\n        g e n r e : Folk\n  r l s.  d a t e : Mar/2008\n      t r a c k s : 12\n    b i t r a t e : VBRkbps\n          s i z e : 51,10 MB\n\n   _______________________________________________________________________\n\n     Kimmie Rhodes delivers a superb set of all new recordings,\n     with nine self-penned songs never before heard, a Townes Van\n     Zandt classic and a new tune written by Rodney Crowell.\n     Recorded in her Austin studio with a stellar cast of friends\n     including Irish pals Keiran Goss and Ann Kinsella,\n     multi-instrumentalist and co-producer Gabriel Rhodes,\n     rock-solid rhythm section stars John Gardner and Glen Fukunaga\n     (Dixie Chicks, Joe Ely, Don Williams), and cello master Brian\n     Standefer (Alejandro Escovedo, Patty Griffin), the music\n     ranges from Americana country to contemporary folk to Texas\n     rock. Once again we are treated to the brilliant lyrics,\n     fantastical imagination, positive inspiration, and pointed\n     irony of Kimmie&amp;#039;s writing, which has earned her many\n     platinum-selling songs and famous admirers over the years.\n\n     &quot;As carefree as her artistic front, that&amp;#039;s how wonderful\n     Kimmie Rhodes is. It sounds as though it&amp;#039;s so incredibly easy\n     to be an artist when listening to her stories. As if the songs\n     were born out of her exhailing, sort of, with her slightly\n     laid-back and even more slightly raspy voice. Can you talk of\n     soft, mild country here? If so, the new songs are\n     representative of such a sound. And when she includes a Townes\n     Van Zandt tune as well as one by Rodney Crowell, it&amp;#039;s not only\n     for the sake of variation, the unjustly unknown Kimmie Rhodes\n     take them over too, in that same super carefree way. First and\n     foremost, it&amp;#039;s Texas country, sounding a lot more like here\n     and now, than once upon a time.&quot;\n\n     &quot;Kimmie Rhodes recorded output is uneven. Her masterpiece is\n     still &amp;#039;West Texas Heaven&amp;#039; from 1994, on which she, among other\n     things, successfully brought Willie Nelson back from his\n     desert walk. That particular album even included fine duets\n     with Townes Van Zandt and Waylon Jennings. The collaboration\n     with Willie Nelson continued the following year on &amp;#039;Just One\n     Love&amp;#039; one of Nelsons greatest records ever. Even their duo\n     album &amp;#039;Pictures In A Frame&amp;#039; from 2003 belongs to the ones you\n     can&amp;#039;t miss.\n     Apart from this, I think Kimmie Rhodes&amp;#039; records so far this\n     millennium, have appeared quite anonymous. But her comes\n     &amp;#039;Walls Fall Down&amp;#039; her best album since &amp;#039;West Texas Heaven&amp;#039;\n     The approach is just as gentle as on the previous albums, but\n     the material is stronger and the contributions from the\n     musicians more distinct.\n     On a song like &amp;#039;Make The Morning Shine&amp;#039; Kimmie shows herself\n     from her most tender side. She sings soft and yearning, with\n     strong dedication and a totally irresistable pleading in her\n     voice, to the sparse acompaniment of strings and Annie\n     Kinsella&amp;#039;s slightly old time harsh second harmony.\n     &amp;#039;There&amp;#039;s A Storm Coming&amp;#039; is more dramatic, a populisticly\n     shine-through contemplation over economical depression and the\n     most recent times natural disasters. The nearly rolling\n     country guitar and precisely inserted slide notes of Gabriel\n     Rhodes underscore the fateful (both existentially and\n     meteorologically) atmosphere.\n     Even the title track is a small masterpiece. Kimmie Rhodes\n     sings, in a harshly focused tone, her lyrics, critical of the\n     civilisation, and the harmony vocals and the lap steel guitar\n     of Gabriel Rhodes deepens the musical expression even more.\n     But it&amp;#039;s not only the self-written songs that keep the highest\n     class. Kimmie Rhodes also does entirely convincing\n     interpretations of Townes Van Zandt&amp;#039;s &amp;#039;If I Needed You&amp;#039; (oh\n     yes indeed, you can tweak a new meaning out of it!),\n     Lennon/McCartney&amp;#039;s &amp;#039;The Fool On The Hill&amp;#039; and Rodney Crowell&amp;#039;s\n     playfully critical song of the human culture, &amp;#039;Sex and\n     Gasoline&amp;#039;.&quot;\n\n   _______________________________________________________________________\n\n      01-Walls Fall Down                                        [04:20]\n      02-If I Needed You                                        [04:21]\n      03-Sex &amp; Gasoline                                         [04:22]\n      04-Beautiful                                              [04:25]\n      05-I&amp;#039;ve Been Loved by You                                 [03:27]\n      06-All in All                                             [03:31]\n      07-Make The Morning Shine                                 [03:27]\n      08-The Fool on The Hill                                   [03:22]\n      09-Your Majesty                                           [04:12]\n      10-Shining Like A Sun                                     [02:25]\n      11-There&amp;#039;s A Storm Coming                                 [03:08]\n      12-Last Seven Second                                      [04:29]\n                                                                -------\n                                                                 45:29 min\n","torrent":{"xt":"urn:btih:2c9076e8edfffa374d3157b58140cacb40287d31","amp;dn":"Kimmie+Rhodes-Walls+Fall+Down+%282008-VBR-Country%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c9076e8edfffa374d3157b58140cacb40287d31","infoHashBuffer":{"type":"Buffer","data":[44,144,118,232,237,255,250,55,77,49,87,181,129,64,202,203,64,40,125,49]},"announce":[],"urlList":[]}}