{"title":"Squareeater, Vol.1","uid":6979875,"size":223557004,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2eeb5a6c2f2dfb45f1990650cf24a0dddf968f8e&amp;dn=Squareeater%2C+Vol.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lqtm0","files":-1,"time":1327364184,"description":"Introducting squareeater, a new online resource which stimulates the brain to lead users to the furthest edges of the conscious mind.\n\nHow to Use\n\nSquareeater uses a combination of binaural audio and stroboscopic visual effects in an attempt to achieve brainwave entrainment in the user. The ideal result is to change the user\\'s brainwaves to a specific frequency associated with a specific mental state. In general, lower EEG frequencies correspond to relaxation and sleep while higher frequencies are for alertness or anxiousness.\n\nTips on using:\n\n1. Get comfortable. Consider using squareeater as a meditative device. Try laying in bed, or sitting in a traditional meditation position. Focus on the audio, and the rhythm of the beating. Be aware of your breathing\n\n2. USE HEADPHONES, preferrably of a decent quality. The binaural audio needs to be isolated specifically to each ear, which is only possible via headphones. The audio should be relatively loud, while still remaining comfortable.\n\n3. Try to make your environment as dark as possible, then get as close to the screen while remaining comfortable. The visuals have been designed to have different effects with eyes opened or closed, so try both. Some visuals will cause visual distortions while others cause the user to see colors that aren\\'t actually represented.\n\n4. Have fun! Try squareeater at different times of the day, under different mind sets, etc.\n\n\nIf you have ANY history with epilepsy, DO NOT USE!!!\n\nTracks:\n\n1. Lucid         27:23\n2. Deep Down     29:31\n3. Strange Night 15:43\n4. Calmer        18:21\n5. Upper         14:48","torrent":{"xt":"urn:btih:2eeb5a6c2f2dfb45f1990650cf24a0dddf968f8e","amp;dn":"Squareeater%2C+Vol.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2eeb5a6c2f2dfb45f1990650cf24a0dddf968f8e","infoHashBuffer":{"type":"Buffer","data":[46,235,90,108,47,45,251,69,241,153,6,80,207,36,160,221,223,150,143,142]},"announce":[],"urlList":[]}}