{"title":"Bombers of the Luftwaffe","uid":8932639,"size":242675044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f23dea40db8084fa3df044cb3cb8e827ad766fa&amp;dn=Bombers+of+the+Luftwaffe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BlackTar","files":4,"time":1379491445,"description":"Kampflieger forms the most comprehensive pictorial encyclopedia of the aircraft and markings of the Luftwaffe bomber force in World War II. Drawing on many rare and previously unpublished photographs, this is the first volume in a richly illustrated four-volume study. Each large format paperback features color profiles illustrating camouflage schemes, tactical markings, numbering and unit insignia as employed on all fronts, as well as personal accounts. Volume One begins with an outline of the clandestine German bomber development following the end of World War I up to the birth of the new Luftwaffe under the Nazi Party in 1933 and the evolution and changing doctrine of the embryonic German bomber force. The authors then continue with the Luftwaffe's operational debut in the Spanish Civil War and the formation of the nucleus of the new Kampfgeschwader. Volume One also covers the invasion of Poland and the birth of Blitzkrieg and concludes on the eve of the German invasion of the West. There are many rare photographs of the Do 11, Do 17, Do 19, Do 23, Ju 52, Ju 86, Ju 88, Ju 89 and He 111.","torrent":{"xt":"urn:btih:2f23dea40db8084fa3df044cb3cb8e827ad766fa","amp;dn":"Bombers+of+the+Luftwaffe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f23dea40db8084fa3df044cb3cb8e827ad766fa","infoHashBuffer":{"type":"Buffer","data":[47,35,222,164,13,184,8,79,163,223,4,76,179,203,142,130,122,215,102,250]},"announce":[],"urlList":[]}}