{"title":"Variable Speed Generators, 2nd Edition [2015] [PDF]","uid":13246496,"size":27873579,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f452219a9229240c130cabbaf7f97d22295186a&amp;dn=Variable+Speed+Generators%2C+2nd+Edition+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1453115955,"description":"Title: Variable Speed Generators \r\nAuthor: Ion Boldea \r\nFormat: PDF \r\nHardcover: 600 pages \r\nPublisher: CRC Press; 2 edition (October 6, 2015) \r\nLanguage: English \r\nISBN: 9781498723572 \r\n\r\n\r\nVariable Speed Generators, the second of two volumes in the Electric Generators Handbook, provides extensive coverage of variable speed generators in distributed generation and renewable energy applications around the world. The book delves into the steady state, transients, control, and design of claw-pole-rotor synchronous, induction, permanent-magnet-(PM)-assisted synchronous, and switched reluctance starter alternators for electric hybrid vehicles. It discusses PM synchronous, transverse flux PM, and flux reversal PM generators for low-speed wind and hydro energy conversion. It also explores linear motion alternators for residential and spacecraft applications. Numerous design and control examples illustrate the exposition.\r\n\r\nFully revised and updated to reflect the last decade’s worth of progress in the field, this Second Edition adds new sections that:\r\n\r\n- Address the ride-through control of doubly fed induction generators under unbalanced voltage sags\r\n- Consider the control of stand-alone doubly fed induction generators under unbalanced nonlinear loads\r\n- Detail a stand-alone squirrel cage induction generator (SCIG) with AC output and a low-rating pulse-width modulated (PWM) converter\r\n- Present a twin stator winding SCIG with 50 percent rating inverter and diode rectifier, and a dual stator winding induction generator with nested cage rotor\r\n- Examine interior permanent magnet claw-pole-alternator systems for more vehicle braking energy recuperation, and high power factor Vernier PM generators\r\n- Depict a PM-assisted reluctance synchronous motor/generator for an electric hybrid vehicle, and a double stator switched reluctance generator with segmented rotor\r\n- Describe the grid to stand-alone transition motion-sensorless dual-inverter control of permanent magnet synchronous generators with asymmetrical grid voltage sags and harmonics filtering\r\n\r\nThe promise of renewable, sustainable energy rests on our ability to design innovative power systems that are able to harness energy from a variety of sources. Variable Speed Generators, Second Edition supplies state-of-the-art tools necessary to design, validate, and deploy the right power generation technologies to fulfill tomorrow's complex energy needs","torrent":{"xt":"urn:btih:2f452219a9229240c130cabbaf7f97d22295186a","amp;dn":"Variable+Speed+Generators%2C+2nd+Edition+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f452219a9229240c130cabbaf7f97d22295186a","infoHashBuffer":{"type":"Buffer","data":[47,69,34,25,169,34,146,64,193,48,202,187,175,127,151,210,34,149,24,106]},"announce":[],"urlList":[]}}