{"title":"Leerboek kinder- en jeugdpsychiatrie _ druk 2 - Verhulst_ F.C_.e","uid":6088486,"size":656291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f59976c1911e12d561bd1d12b2bb9734dd944dd&amp;dn=Leerboek+kinder-+en+jeugdpsychiatrie+_+druk+2+-+Verhulst_+F.C_.e&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"symfora","files":1,"time":1294440313,"description":"Beschrijving\n\nHet 'Leerboek kinder- en jeugdpsychiatrie' is uit nood geboren. Binnen het onderwijs bestond er dringend behoefte aan een Nederlandstalig basiswerk dat de nieuwste inzichten volgt en geschikt is voor onderwijs. Voor sommige opleidingen waren bestaande teksten namelijk of te uitgebreid of te oppervlakkig. Die leemte wordt door deze uitgave gevuld.\n\nHet leerboek opent met een inleidend hoofdstuk over het diagnostisch onderzoek en behandelt vervolgens de belangrijkste psychiatrische stoornissen die kunnen voorkomen gedurende de eerste achttien levensjaren. Stoornissen als psychosen of verslaving, die vooral in de leerboeken over de volwassenenpsychiatrie worden behandeld, blijven buiten beschouwing.\n\nDe tekst bevat veel nieuwe inzichten op het gebied van de neurobiologie, genetica en neuropsychologie. Tevens wordt uitgebreid ingegaan de rol van omgevingsfactoren bij het ontstaan of het beloop van kinder- en jeugdpsychiatrische stoornissen. Uiteraard is er ook volop aandacht voor de psychosociale en farmacologische behandeling.\n\nMet de bespreking van de grote psychiatrische beelden van de kinderleeftijd en adolescentie biedt dit boek basiskennis die nuttig is voor iedereen die zich vanuit zijn of haar (toekomstige) beroep wil verdiepen in de achtergronden en behandeling van kinder- en jeugdpsychiatrische stoornissen. Hierbij is in eerste instantie gedacht aan studenten geneeskunde, gezondheidswetenschappen, psychologie en pedagogiek, maar de uitgave leent zich zeker ook voor (zelf)studie op HBO-niveau.\n\nFrank C. Verhulst, hoogleraar kinder- en jeugdpsychiatrie, is hoofd van de afdeling Kinder- en Jeugdpsychiatrie van het Erasmus MC/Sophia Kinderziekenhuis te Rotterdam.\n\nAuteur: F.C. Verhulst \nTaal: Nederlands\nFormaat: ePub met kopieerbeveiliging (DRM) van Adobe verwijderd\nDruk: 2\nISBN10: 9023245806\nISBN13: 9789023245803 ","torrent":{"xt":"urn:btih:2f59976c1911e12d561bd1d12b2bb9734dd944dd","amp;dn":"Leerboek+kinder-+en+jeugdpsychiatrie+_+druk+2+-+Verhulst_+F.C_.e","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f59976c1911e12d561bd1d12b2bb9734dd944dd","infoHashBuffer":{"type":"Buffer","data":[47,89,151,108,25,17,225,45,86,27,209,209,43,43,185,115,77,217,68,221]},"announce":[],"urlList":[]}}