{"title":"Jess Willard - Honky Tonk Hardwood Floor - Bear Family CD","uid":10478877,"size":710138737,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2f7f97ae7f7e14b4d0b478ddc4db165e5fd77fa1&amp;dn=Jess+Willard+-+Honky+Tonk+Hardwood+Floor+-+Bear+Family+CD+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bonnie335","files":53,"time":1404384011,"description":"Jess Willard - Honky Tonk Hardwood Floor - Bear Family CD (2000)\n\n\n\nJess Willard's Capitol recordings comprise one of the best obscure catalogs Bear Family has released. He was blessed to have an excellent assortment of material to sing -- these songs sparkle both musically and lyrically -- and Willard's irresistible, untrained delivery is a true delight. Honky Tonk Hardwood Floor covers his complete sessions from 1950-1952, as well as a pair of songs from the California Hayride shows with the Cochran Brothers in 1955. As great stuff unfolds and continues to unfold, it becomes clear that Willard was a genuine talent, and even though many of these songs bear the strong influence of Hank Williams and Lefty Frizzell, there are some excellent country boogies and proto-rockabilly numbers (&quot;Honky Tonk Hardwood Floor&quot; became a minor rockabilly standard). &quot;Turn That Gun Around,&quot; in particular, is a hoot, full of dark humor and lucid imagery, and &quot;My Mail Order Mama&quot; and &quot;Slippin' Around With Jole Blon&quot; are terrific. There's a loose, cheerful sway to everything here, so much so that it's hard to believe how uncelebrated Willard has been to the community at large. That's the standard response from Bear Family aficionados, but let's face it, even their best finds don't always yield a whole album's worth of strong material. That's happily not the case here, and this is a disc that can be recommended unreservedly. ~ Jim Smith, All Music Guide","torrent":{"xt":"urn:btih:2f7f97ae7f7e14b4d0b478ddc4db165e5fd77fa1","amp;dn":"Jess+Willard+-+Honky+Tonk+Hardwood+Floor+-+Bear+Family+CD+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f7f97ae7f7e14b4d0b478ddc4db165e5fd77fa1","infoHashBuffer":{"type":"Buffer","data":[47,127,151,174,127,126,20,180,208,180,120,221,196,219,22,94,95,215,127,161]},"announce":[],"urlList":[]}}