{"title":"Thermoset Nanocomposites (Wiley-VCH, 2013)","uid":12018725,"size":4126604,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fe68ff71b7be7a26a55d5b0189b94408ba7e01c&amp;dn=Thermoset+Nanocomposites+%28Wiley-VCH%2C+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1434364248,"description":"ISBN 9783527333011\n\nThe book series &quot;Polymer Nano-, Micro- and Macrocomposites&quot; provides complete and comprehensive information on all important aspects of polymer composite research and development, including, but not limited to synthesis, filler modification, modeling, characterization as well as application and commercialization issues. Each book focuses on a particular topic and gives a balanced in-depth overview of the respective subfield of polymer composite science and its relation to industrial applications. With the books the readers obtain dedicated resources with information relevant to their research, thereby helping to save time and money.\n\nThermoset polymers are a class of materials with many superior properties than thermoplastic materials. Nanocomposites with a large variety of thermoset polymers have been explored and vast knowledge on the synthesis methodologies as well as properties has been generated. The goal of the book is to assimilate these research findings on the many thermoset polymer based nanocomposites systems comprehensively so as to generate better insights into the design, performance and optimization of thermoset nanocomposites","torrent":{"xt":"urn:btih:2fe68ff71b7be7a26a55d5b0189b94408ba7e01c","amp;dn":"Thermoset+Nanocomposites+%28Wiley-VCH%2C+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fe68ff71b7be7a26a55d5b0189b94408ba7e01c","infoHashBuffer":{"type":"Buffer","data":[47,230,143,247,27,123,231,162,106,85,213,176,24,155,148,64,139,167,224,28]},"announce":[],"urlList":[]}}