{"title":"Robbie Williams - Rock DJ (2nafish)","uid":5762341,"size":148600836,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:30373acdd5628c093701bcae168fdb7a9b3f6200&amp;dn=Robbie+Williams+-+Rock+DJ+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1281770943,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Rock DJ&quot; (stylized &quot;rock DJ&quot;) is a song by English pop singer Robbie Williams from his fourth album, Sing When You're Winning released in the summer of 2000. The song heavily musically samples Barry White's 1977 song &quot;It's Ecstasy When You Lay Down Next To Me&quot;. Rock DJ was the fifth best selling of 2000 in the UK.\n\nThe music video, directed by Vaughan Arnell, was surrounded by controversy because of its explicit content. The video begins with Williams dancing on a roller disco with girls skating around him. He wants to get the attention of the female DJ  standing above the stage, so he begins stripping off his clothes. After this does not get her attention, he starts stripping his skin, muscles and organs, too (in heavy makeup), until the only thing that is left from him are his bones which is performed by special effects. In the end, he achieves the DJ's attention and dances with her as a skeleton. The video ends with titles, reading &quot;No Robbies were Harmed During the Making of this Video&quot;. The skinless Robbie is also featured on the single's cover art.\n\nThe video's ending (beginning with Williams taking off his skin) was cut by most music channels around Europe, including VIVA, MCM, MTV and The Box. VH1 Europe decided to use its own video for the song, created from recording studio footage. Examples of TV stations that still play the full video are Bulgarian channel MM (often in daytime) and Canadian channel MusiquePlus, some channels ran the edited video during the day and the unedited one overnight, while The Hits played a version which cut from Williams dancing in his underwear to dancing as a skeleton, filling the gap by repeating previous footage. In 2001, &quot;Rock DJ&quot; won the MTV Video Music Award for Best Special Effects. In 2006 it was voted by viewers as the seventh Most Groundbreaking Video Ever on MTV and in 2007 it was ranked at forty-eight on MuchMusic's 50 Most Controversial Videos.\n\nThe video has been shown numerous times on Fuse's Pants-Off Dance-Off, despite its gory content. Toward the end of the pancer's dancing/stripping to it when the video is shown in the background like any other, they only show Williams, briefly, ripping and throwing his skin, and dancing in muscle form before cutting to the hostess of the show. During most of the episodes of the first season (and some of second season), it was featured with the same 'pancer' dancing to it. It quickly became popular among viewers, like some of the other most shown videos to 'pance' to, as the show went on. It won the weekly contests countless times. On one episode, viewers voted it and the pancer as one of the best videos and pancings on the show.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:30373acdd5628c093701bcae168fdb7a9b3f6200","amp;dn":"Robbie+Williams+-+Rock+DJ+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30373acdd5628c093701bcae168fdb7a9b3f6200","infoHashBuffer":{"type":"Buffer","data":[48,55,58,205,213,98,140,9,55,1,188,174,22,143,219,122,155,63,98,0]},"announce":[],"urlList":[]}}