{"title":"The Missiles of October (1974) (TV)","uid":5260068,"size":1853753476,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:307bdf82842bfb2a5cad00e47289b24c1c13703e&amp;dn=The+Missiles+of+October+%281974%29+%28TV%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GungaDan","files":1,"time":1262706913,"description":"According to the Wikipedia:\n\nThe Missiles of October\nFrom Wikipedia, the free encyclopedia\n\nDirected by \tAnthony Page\nProduced by \tRobert Berger\nWritten by \tStanley R. Greenberg\nRelease date(s) 1974\nRunning time \t150 mins\nCountry \tUSA\nLanguage \tEnglish\n\nThe Missiles of October is a 1974 docudrama about the Cuban missile crisis. Its name evokes the book The Guns of August by Barbara Tuchman about the missteps among the great powers and the failed chances to give an opponent a graceful way out leading to the supposedly inevitable World War. The script is based on Attorney General Robert F Kennedy's book Thirteen Days.\n\nStaged as a two and a half hour play, the production eschews detailed sets and wardrobes, as well as physical action, in favor of dialogue and emotions. It shows how the world came close to the brink of, and eventually stepped away from, global thermonuclear war. The work lauds President John F Kennedy, Attorney General Robert F Kennedy, Soviet Premier Nikita Khrushchev, U.S. Ambassador to the United Nations Adlai Stevenson, and former Secretary of State Dean Acheson.\n\nThe Missiles of October takes us behind the scenes to see the inner workings, disagreements, and ultimate consensus of Kennedy's cabinet to blockade Cuba, rather than attempt to invade to dislodge the just discovered yet partially completed Soviet nuclear missile emplacements in Cuba. It also details US attempts to give the Soviets room to negotiate without appearing to capitulate. Although often dismissed by movie and television critics, the piece scores extremely well in viewer polls.[citation needed]\n\nThe made-for-TV movie was directed by Anthony Page with writing credits given to Stanley R. Greenberg and Robert Kennedy.\n[edit] Film stars\n\n    * William Devane as President Kennedy\n    * Martin Sheen as Bobby Kennedy\n    * Howard Da Silva as Premier Khrushchev\n    * Ralph Bellamy as Adlai Stevenson\n    * James Hong as U.N. Secretary General U Thant\n    * Clifford David as Theodore Sorensen, Special Counsel\n    * John Dehner as Dean Acheson\n    * Nehemiah Persoff as Soviet Foreign Secretary Andrei Gromyko\n    * Dana Elcar as Secretary of Defense Robert McNamara\n    * Keene Curtis as CIA Director John McCone\n    * Andrew Duggan as Army Chief of Staff Maxwell Taylor\n    * Kenneth Tobey as Chief of Naval Operations George W. Anderson Jr.\n    * John Randolph as Under Secretary of State for Economic and Agricultural Affairs George Ball\n    * Ron Feinberg as French President Charles de Gaulle\n    * Harris Yulin as KGB Agent Alexander Fomin\n","torrent":{"xt":"urn:btih:307bdf82842bfb2a5cad00e47289b24c1c13703e","amp;dn":"The+Missiles+of+October+%281974%29+%28TV%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"307bdf82842bfb2a5cad00e47289b24c1c13703e","infoHashBuffer":{"type":"Buffer","data":[48,123,223,130,132,43,251,42,92,173,0,228,114,137,178,76,28,19,112,62]},"announce":[],"urlList":[]}}