{"title":"Vento Di Passioni","uid":4766240,"size":1405229056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:31004304d4e6aa9250bdc032aee021f7f39916f1&amp;dn=Vento+Di+Passioni&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Volpebianca","files":1,"time":1236880937,"description":"Il colonnello William Ludlow, deluso dal comportamento del governo degli Stati Uniti circa la soluzione della questione indiana, si ÃƒÂ¨ ritirato in un ranch di montagna con la famiglia per condurre un'esistenza autonoma di allevatore. Mentre la moglie non sopporta quella rude vita e lo lascia, egli alleva nelle sue idee i tre figli. Alfred, il maggiore e il piÃƒÂ¹ avveduto; Tristan, il secondo, si distingue per temerarietÃƒÂ  e ferocia; il terzo, Samuel, ÃƒÂ¨ romantico e generoso e l'arrivo della sua fidanzata, Susannah Finncannon, sconvolge la famiglia. Alfred e Tristan s'innamorano della giovane; poi i tre fratelli partono per la grande Guerra in Europa, dove Samuel muore ad Ypres tra le braccia di Tristan. Al suo ritorno, questi si mette con Susannah strappandola da Alfred: ma irrequieto, sparisce dedicandosi ad una vita selvaggia. Quando torna, trova il padre colto da un ictus e Susannah, cui ha scritto di dimenticarlo, sposata ad Alfred, che ha rotto col padre ed ÃƒÂ¨ entrato brillantemente in politica. Tristan sposa cosÃƒÂ¬ Isabel Due, una giovane meticcia e si ricongiunge con Colpo di Pugnale, fedele scout indigeno del padre, nonchÃƒÂ© suo maestro di caccia e di vita. Padre felice, Tristan si mette nel contrabbando di liquori, ed il fratello Alfred lo salva piÃƒÂ¹ volte dall'arresto. Ma ad un blocco della polizia un agente spara uccidendo involontariamente Isabel, colpita di rimbalzo. Tristan assale il poliziotto e finisce in galera, dove Susannah lo va a trovare, sempre innamorata. Liberato, Tristan organizza la vendetta, uccidendo l'assassino di Isabel. Susannah, sconvolta, si uccide mentre Tristan ÃƒÂ¨ costretto a fuggire. Poi i poliziotti si presentano alla fattoria: Alfred, che ÃƒÂ¨ giunto ad avvisare i familiari, spara al comandante della polizia che sta per uccidere il padre, intervenuto per difendere Tristan. Sepolti i corpi e fatte sparire le tracce, Tristan si allontana e dopo molti anni termina la sua vita randagia nei boschi ucciso da un orso.\n\n\nwww.volpebianca.org","torrent":{"xt":"urn:btih:31004304d4e6aa9250bdc032aee021f7f39916f1","amp;dn":"Vento+Di+Passioni","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31004304d4e6aa9250bdc032aee021f7f39916f1","infoHashBuffer":{"type":"Buffer","data":[49,0,67,4,212,230,170,146,80,189,192,50,174,224,33,247,243,153,22,241]},"announce":[],"urlList":[]}}