{"title":"Veronica Falls - Waiting for Something to Happen (2013) [FLAC]","uid":8143654,"size":261123655,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31817dcfc0f9ed89f3c1299c103b1e71740369bb&amp;dn=Veronica+Falls+-+Waiting+for+Something+to+Happen+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1360861195,"description":"\n  Veronica Falls - Waiting for Something to Happen (2013) [FLAC]\n\n  Released: 2013\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Tell Me\n  02 Teenage\n  03 Broken Toy\n  04 Shooting Star\n  05 Waiting For Something To Happen\n  06 If You Still Want Me\n  07 My Heart Beats\n  08 Everybody's Changign\n  09 Buried Alive\n  10 Falling Out\n  11 So Tired\n  12 Daniel\n  13 Last Conversation\n\n  Veronica Falls' debut was the kind of record it's very hard to follow up. It was filled with singles and really strong album tracks, each performed with a raw energy and a dark mystery that combined to make it one of the better indie pop albums in recent memory. The question for any band that has such an impressive debut is what to do with the next step -- do you repeat yourself to possible diminishing returns or do you try to change things up right away? Veronica Falls try to do some of both. The song structures, the instrumentation, and the intricate vocal interplay between lead singer Roxanne Clifford and the guys in the band (guitarist James Hoare and drummer Patrick Doyle) all remain intact, but they've made some changes in the production style. \n\n  The vocals are smoothed out quite a bit and seem less likely to veer off course -- partly due to Clifford sounding more assured, partly thanks to the way they are folded into the overall mix. The guitars mesh together better this time too, with Clifford and Hoare relying less on frantic strumming and more on interlocking, jangling lines that twine around each other. These may sound like improvements, and may be to fans of clear mixes and early R.E.M. albums, but to anyone who fell in love with the sense of immediacy and danger that spun out of the grooves of their first album, it feels too safe and predictable. Adding to this feeling is the wearying reliance on cymbal crashes, which occur in every spot one might think they would on every last song but one (the drum-less ballad &quot;Daniel.&quot;) \n\n  These on-the-nose exclamation points are totally unnecessary and make the songs sound more obvious than mysterious. The previous album certainly didn't suffer for having no cymbal crashes; on the contrary, the lack of cymbals was a selling point. Whoever it was that thought it was a good idea to add cymbal to the drum kit probably should have had a stern talking to at some point during the recording process. Despite these deal-breaking issues, the album still has plenty of charm. \n\n  Quite a few of the songs have the kind of hooky pop appeal that their early singles had -- &quot;Teenage&quot; and &quot;My Heart Beats&quot; especially, though &quot;Broken Toy&quot; is a heartfelt keeper too -- and none of the tracks are stinkers, just a little less than memorable. Clifford's vocals are lovely throughout too, and there are moments of abandon and mystery that pop up now and again to remind one of the thrilling feel of their debut. Adding the pluses and minuses, it's clear that Waiting for Something to Happen isn't a failure by any stretch, but it is something of a disappointment. It's important that the group try and expand their sound, it's just a shame they picked such obvious ways to do it. Luckily, the core of what made them so interesting and exciting is still there, it's just buried under the slick production and distracting cymbal crashes -- it's difficult, but still worth the effort, to extract.","torrent":{"xt":"urn:btih:31817dcfc0f9ed89f3c1299c103b1e71740369bb","amp;dn":"Veronica+Falls+-+Waiting+for+Something+to+Happen+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31817dcfc0f9ed89f3c1299c103b1e71740369bb","infoHashBuffer":{"type":"Buffer","data":[49,129,125,207,192,249,237,137,243,193,41,156,16,59,30,113,116,3,105,187]},"announce":[],"urlList":[]}}