{"title":"Global Underground 24/7:  Danny Howells","uid":4713246,"size":146224738,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:324bb099dddfd4f4d61d9432f9a10b43aec8a4fb&amp;dn=Global+Underground+24%2F7%3A++Danny+Howells&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"piratzee","files":28,"time":1234147672,"description":"Alright everyone please read.  I'm putting up most of my favorite albums of Progressive Trance, Progressive House, Tech House, and Acid House that I have collected over the past 10 years or so.  I'm putting up a few at a time to seed and need everyone that downloads them to PLEASE SEED THEM for atleast a week so everyone can get to DL them and enjoy them.  My broadband is somewhat slow so I can only put up a few at a time and need the help to seed them.  If you build it they will come.  I've got over 50 albums (100+ CDs/mixes) I am going to put up so I do need the help seeding them all.  If anyone has any good albums(this style of music) to put up i'd appreciate it if you did or if you could leave in the comments section where else to find some really good albums or suggestions of really good albums or mixes.  Thanks\n\n(NEW NOTE)  Ok looks like I'll have to seed 3 a day after today b/c they're uploading slow...this is why i need help seeding them PLEASE.  Also in the future if you are having trouble downloading one leave a comment and I'll seed it again ASAP...but please seed these for a while after you download them so that everyone will benefit.  I have a lot of albums to put up and would like everyone to get their hands on them.  Thanks\n\nNow this album will grow on you.  The first time I got it I hated it...sold it on ebay...but later listened to the copies of it I made.  Fell in love with it...ex-girlfriend broke my copies in her hands after kicking her ass out the car...bought the album back on ebay.  I suggest you give it a good listen, keep it around a while, and then fall in love with it.  Another genius release by Danny Howells.","torrent":{"xt":"urn:btih:324bb099dddfd4f4d61d9432f9a10b43aec8a4fb","amp;dn":"Global+Underground+24%2F7%3A++Danny+Howells","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"324bb099dddfd4f4d61d9432f9a10b43aec8a4fb","infoHashBuffer":{"type":"Buffer","data":[50,75,176,153,221,223,212,244,214,29,148,50,249,161,11,67,174,200,164,251]},"announce":[],"urlList":[]}}