{"title":"Global Catastrophes and Trends Vaclav Smil (^hyperlinked ToC)","uid":12595235,"size":6713142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32f561ff5009bf464e7d9c4d23f7bcf15c9acb20&amp;dn=Global+Catastrophes+and+Trends+Vaclav+Smil+%28%5Ehyperlinked+ToC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"heliiaruy","files":1,"time":1445218449,"description":"Paperback: 320 pages\r\nPublisher: The MIT Press (September 14, 2012)\r\nLanguage: English\r\n\r\nFundamental change occurs most often in one of two ways: as a &quot;fatal discontinuity,&quot; a sudden catastrophic event that is potentially world changing, or as a persistent, gradual trend. Global catastrophes include volcanic eruptions, viral pandemics, wars, and large-scale terrorist attacks; trends are demographic, environmental, economic, and political shifts that unfold over time. In this provocative book, scientist Vaclav Smil takes a wide-ranging, interdisciplinary look at the catastrophes and trends the next fifty years may bring. Smil first looks at rare but cataclysmic events, both natural and human-produced, then at trends of global importance, including the transition from fossil fuels to other energy sources and growing economic and social inequality. He also considers environmental change -- in some ways an amalgam of sudden discontinuities and gradual change -- and assesses the often misunderstood complexities of global warming. Global Catastrophes and Trends does not come down on the side of either doom-and-gloom scenarios or techno-euphoria. Instead, Smil argues that understanding change will help us reverse negative trends and minimize the risk of catastrophe.\r\n\r\n====hoping I can continue uploading tpb. The real troubles seem to be hitting them, so I have duplicated all to KAT. will keep dualing spread of magnets, as soon as either source becomes available======\r\n\r\n              know why KAT is no fun? They can't even format the below......\r\n\r\nhe  li           i       a r u      y y           u r  a  i            i  l  eh","torrent":{"xt":"urn:btih:32f561ff5009bf464e7d9c4d23f7bcf15c9acb20","amp;dn":"Global+Catastrophes+and+Trends+Vaclav+Smil+%28%5Ehyperlinked+ToC%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32f561ff5009bf464e7d9c4d23f7bcf15c9acb20","infoHashBuffer":{"type":"Buffer","data":[50,245,97,255,80,9,191,70,78,125,156,77,35,247,188,241,92,154,203,32]},"announce":[],"urlList":[]}}