{"title":"J.D. Robb - Eve Dallas 22 - Visions in Death-viny","uid":6426406,"size":1725235,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3313192d389b1bbc8cb5789bb2ac9869d7f9fb09&amp;dn=J.D.+Robb+-+Eve+Dallas+22+-+Visions+in+Death-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306492604,"description":"J.D. Robb - Eve Dallas 22 - Visions in Death-viny\n\nA brand-new novel in the number-one New York Times-bestselling In Death series set in 2059 New York City. As technology and humanity collide, Detective Eve Dallas searches the darkest corners of Manhattan for an elusive killer with a passion for collecting souls...\n\nOn one of the city's hottest nights, New York Police Lieutenant Eve Dallas is sent to Central Park-and into a hellish new investigation. The victim is found on the rocks, just above the still, dark water of the lake. Around her neck is a single red ribbon. Her hands are posed, as if in prayer. But it is the eyes-removed with such precision, as if done with the careful hands of a surgeon-that have Dallas most alarmed.\n\nAs more bodies turn up, each with the same defining scars, Eve is frantic for answers. Against her instincts, she accepts help from a psychic who offers one vision after another-each with shockingly accurate details of the murders. And when partner and friend Peabody is badly injured after escaping an attack, the stakes are raised. Are the eyes a symbol? A twisted religious ritual? A souvenir? With help from her husband, Roarke, Dallas must uncover the killer's motivation before another vision becomes another nightmare. . .","torrent":{"xt":"urn:btih:3313192d389b1bbc8cb5789bb2ac9869d7f9fb09","amp;dn":"J.D.+Robb+-+Eve+Dallas+22+-+Visions+in+Death-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3313192d389b1bbc8cb5789bb2ac9869d7f9fb09","infoHashBuffer":{"type":"Buffer","data":[51,19,25,45,56,155,27,188,140,181,120,155,178,172,152,105,215,249,251,9]},"announce":[],"urlList":[]}}