{"title":"Frank Sinatra - Nice N Easy (MFSL UDCD 790) FLAC","uid":5220132,"size":229676203,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:35bb14ac1e506011946da1980badff73fca64185&amp;dn=Frank+Sinatra+-+Nice+N+Easy+%28MFSL+UDCD+790%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WhoAreU2","files":14,"time":1260900020,"description":"Frank Sinatra - Nice N Easy (MFSL UDCD 790) FLAC\n\n\n1. Nice 'n' Easy \t\n2. That Old Feeling \t\n3. How Deep Is the Ocean? \t\n4. I've Got a Crush on You \t\n5. You Go to My Head \t\n6. Fools Rush In \t\n7. Nevertheless (I'm in Love with You) \t\n8. She's Funny That Way \t\n9. Try a Little Tenderness \t\n10. Embraceable You \t\n11. Mam'selle \t\n12. Dream \n\nAlthough it wasn't designed with the cohesive vision of Sinatra's conceptual masterpieces (like In the Wee Small Hours or Only the Lonely), track for track, this &quot;contractual obligation album&quot;--a lightly swingin' single followed by a bunch of ballads, recorded near the end of his tenure at Capitol--is as strong as anything the singer's ever done. The lightweight title song sets a relaxed tone that's a little misleading--just when you think you can kick back in the recliner and take it &quot;nice 'n' easy&quot; (a swell tune, by the way), Sinatra plunges off the emotional deep end with &quot;That Old Feeling.&quot; It's like waking up from an afternoon nap to find yourself afflicted by insomnia in the wee small hours. OK, so he contradicts himself. The first song is about taking your time along the smoothly paved road to romance; the second is about driving straight into the ditch of romantic obsession--the difference, say, between Mia Farrow and Ava Gardner. From this point on, the album's tone is definitely Gardner. And Sinatra's singing has never been more spine tingling than on the next three songs, sounding unfathomable depths in &quot;How Deep Is the Ocean,&quot; seductively cooing &quot;I've Got a Crush on You&quot; in his lover's ear, and unabashedly succumbing to the delirious intoxication of &quot;You Go to My Head,&quot; his voice &quot;spinning 'round in my brain like the bubbles in a glass of champagne.&quot; You can get drunk on this record.","torrent":{"xt":"urn:btih:35bb14ac1e506011946da1980badff73fca64185","amp;dn":"Frank+Sinatra+-+Nice+N+Easy+%28MFSL+UDCD+790%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35bb14ac1e506011946da1980badff73fca64185","infoHashBuffer":{"type":"Buffer","data":[53,187,20,172,30,80,96,17,148,109,161,152,11,173,255,115,252,166,65,133]},"announce":[],"urlList":[]}}