{"title":"La Criatura Perfecta[HDRip][XVID-AC3]","uid":4910118,"size":1799405568,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:36c7c55493e05ee7d87a4d00ab9d42e613f40520&amp;dn=La+Criatura+Perfecta%5BHDRip%5D%5BXVID-AC3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nahla","files":1,"time":1243108937,"description":"LA CRIATURA PERFECTA\n(Perfect creature)\n\nDireccion y guion: Glenn Standring.\nPaises: Reino Unido y Nueva Zelanda.\nAÃƒÂ±o: 2006.\nDuracion: 90 min.\nGenero: Accion, fantastico, terror.\nInterpretacion: Dougray Scott (Silus), Saffron Burrows (Lilly), Leo Gregory (Edgar), Scott Wills (Jones), Stuart Wilson (Augustus), Craig Hall (Dominic), Robbie Magasiva (Frank), Lauren Jackson (Steph), Peter McCauley (profesor Liepsky), Stephen Ure (Freddy).\nProduccion: Tim Sanders, Russell Fischer, Haneet Vaswani, Michael Cowan y Jason Piette.\nMusica: Anne Dudley.\nFotografia: Leon Narbey.\nMontaje: Christopher Blunden.\nDiseÃƒÂ±o de produccion: Phil Ivey.\nVestuario: Kirsty Cameron.\nEstreno en EspaÃƒÂ±a: 18 Enero 2008.\n\nSINOPSIS\n\nHace tres siglos, en un mundo similar al nuestro, un alquimista italiano descubrio accidentalmente los secretos de la ciencia genetica. Al hacerlo, el alquimista desencadeno una oleada de virulentas enfermedades contra las que la raza humana lucha todavia. Otra consecuencia de estos experimentos fue la creacion accidental de una nueva raza de personas: los Hermanos, resultante de una mutacion genetica provocada por un virus y que solo se manifiesta en los varones. Los Hermanos son seres superiores, fisica y mentalmente, que se han convertido en los guardianes de la ciencia genetica y se han dedicado a mantener a buen recaudo el peligro potencial que encierra esa ciencia. Los Hermanos tambien ayudan a la Humanidad a combatir las enfermedades que periodicamente asolan el planeta. Se trata de una relacion simbiotica, pues a cambio de su compromiso de preservar la vida humana, los Hermanos solo piden a la Humanidad una cosa: su sangre. Los Hermanos son vampiros, no de la clase de vampiros que alimenta el mito europeo, sino unas criaturas vivientes de carne y hueso, quizas el proximo eslabon de la cadena de la evolucion. Entonces surge un problema que amenaza con destruir esta armonia. Uno de los Hermanos ha hecho algo que ningun otro habia hecho jamas: cazar seres humanos.","torrent":{"xt":"urn:btih:36c7c55493e05ee7d87a4d00ab9d42e613f40520","amp;dn":"La+Criatura+Perfecta%5BHDRip%5D%5BXVID-AC3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36c7c55493e05ee7d87a4d00ab9d42e613f40520","infoHashBuffer":{"type":"Buffer","data":[54,199,197,84,147,224,94,231,216,122,77,0,171,157,66,230,19,244,5,32]},"announce":[],"urlList":[]}}