{"title":"Cinderella Ate My Daughter","uid":7538205,"size":171558062,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:37b222c2e6f76de547892593d97356227b9e1088&amp;dn=Cinderella+Ate+My+Daughter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1345146542,"description":"The acclaimed author of the groundbreaking bestseller Schoolgirls reveals the dark side of pink and pretty: the rise of the girlie-girl, she warns, is not that innocent.\nPink and pretty or predatory and hardened, sexualized girlhood influences our daughters from infancy onward, telling them that how a girl looks matters more than who she is. Somewhere between the exhilarating rise of Girl Power in the 1990s and today, the pursuit of physical perfection has been recast as a source,the source of female empowerment. And commercialization has spread the message faster and farther, reaching girls at ever-younger ages.\nBut, realistically, how many times can you say no when your daughter begs for a pint-size wedding gown or the latest Hannah Montana CD? And how dangerous is pink and pretty anyway, especially given girls' successes in the classroom and on the playing field? Being a princess is just make-believe, after all; eventually they grow out of it. Or do they? Does playing Cinderella shield girls from early sexualization, or prime them for it? Could today's little princess become tomorrow's sexting teen? And what if she does? Would that make her in charge of her sexuality, ;or an unwitting captive to it?\nThose questions hit home with Peggy Orenstein, so she went sleuthing. She visited Disneyland and the international toy fair, trolled American Girl Place and Pottery Barn Kids, and met beauty pageant parents with preschoolers tricked out like Vegas showgirls. She dissected the science, created an online avatar, and parsed the original fairy tales. The stakes turn out to be higher than she - or we - ever imagined: nothing less than the health, development, and futures of our girls. From premature sexualization to the risk of depression to rising rates of narcissism, the potential negative impact of this new girlie-girl culture is undeniable; yet armed with awareness and recognition, parents can effectively counterbalance its influence in their daughters' lives.\nCinderella Ate My Daughter is a must-read for anyone who cares about girls, and for parents helping their daughters navigate the rocky road to adulthood","torrent":{"xt":"urn:btih:37b222c2e6f76de547892593d97356227b9e1088","amp;dn":"Cinderella+Ate+My+Daughter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37b222c2e6f76de547892593d97356227b9e1088","infoHashBuffer":{"type":"Buffer","data":[55,178,34,194,230,247,109,229,71,137,37,147,217,115,86,34,123,158,16,136]},"announce":[],"urlList":[]}}