{"title":"mIRC v7.34 Final + Patch-XenoCoder [ATOM]","uid":10403876,"size":2069259,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3891e0db2dfe2aa7a06092f3b84c9b8a937c5d94&amp;dn=mIRC+v7.34+Final+%2B+Patch-XenoCoder+%5BATOM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":-1,"time":1403423014,"description":"Description:\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, SSL encryption, proxy support, UTF-8 display, customizable sounds, spoken messages, tray notifications, message logging, and more.\n\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\nmIRC has been in development for over a decade and is constantly being improved and updated with new technologies.\n\n\n\nFeatures:\n-UTF-8 support with font linking.\n-A powerful dynamic /help command.\n-Netscape, Mosaic and MS Internet Explorer support .... surf the www waves !!\n-An 'off you go' Toolbar.... and even Tooltips !\n-A very handy Switchbar.\n-A user programmable menu bar.\n-A simple and smart CTCP commands and Events handler.\n-Support for wav and midi sound files.\n-Colored text to ease reading.\n-Simple, fully configurable aliases.\n-Configurable popup menus.\n-Full DCC Send/Get/Chat support including passive DCC.\n-Full configurable fonts and colors and support of bold, underline and reverse text.\n-Built in Ident and Finger server.\n-A simple but powerful and safe built-in File server.\n-Programmable Function keys.\n\n\nWhat's New in Version 7.34:\n- Fixed SendMessage() bug that prevented mIRC from processing incoming WM_MCOMMAND/WM_MEVALUATE messages correctly.\n- Changed right-click popup menu item order for Treebar, Switchbar and Toolbar for common menu items so that they match.\n- Added Switchbar font option to right-click popup menu.\n- Changed Switchbar to display active window tab in a slightly different color when a background picture for the Switchbar is set.\n- Changed tooltip display delay to use the Windows default tooltip display delay value.\n- Changed Clear History feature to not delete some interface settings, such as font settings for Treebar, Switchbar, and Scripts Editor and background picture settings for Treebar, Switchbar, and Toolbar.\n- Changed installer to default to upgrade mode if installing over an existing installation when using the /S silent option and added a /FULL command line option to force a full install.\n- Fixed DNS resolution bug that would have returned incorrect results during multiple simultaneous DNS requests in rare contexts.\n- Updated libraries to OpenSSL 1.0.1h.\n- Added Lock dialog option to disable SendMessage. If cMethod value 16 is used for more useful error messages, returns 64 to indicate SendMessage is disabled. You can use $lock(sendmessage) to check if it is disabled.\n- Extended mouse wheel to work in interface elements, such as list boxes in dialogs, under the cursor even if they are not active.\n- Added /comlist command to list open com objects.\n- Added $servertarget identifier to return address specified in the /server command, which may not be the same as $server.\n- Added /play -x switch to treat the first line in the file as plain text even if it is a number.\n- Fixed custom dialog listbox with checkboxes not working correctly on Windows 8 tablet touch screens.","torrent":{"xt":"urn:btih:3891e0db2dfe2aa7a06092f3b84c9b8a937c5d94","amp;dn":"mIRC+v7.34+Final+%2B+Patch-XenoCoder+%5BATOM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3891e0db2dfe2aa7a06092f3b84c9b8a937c5d94","infoHashBuffer":{"type":"Buffer","data":[56,145,224,219,45,254,42,167,160,96,146,243,184,76,155,138,147,124,93,148]},"announce":[],"urlList":[]}}