{"title":"King Crimson - Live in French TV Program Melody (1974) [DIVx]","uid":7233310,"size":734046982,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:39473e3f4b5e32c4c8b4ca9b0e9e4d66576320b3&amp;dn=King+Crimson+-+Live+in+French+TV+Program+Melody+%281974%29+%5BDIVx%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"zbyszek3k","files":1,"time":1335911797,"description":"KING CRIMSON - LIVE IN FRANCE AT TV MELODY SHOW 1974 AVI (DIVx)\n\nAVI (DIVx) of highest quality(!), 700MB, 29 min 12sec length, 720x544, 29.97\n\nTracklist:\n\n1 - Larks' Tongues in Aspic, Part II\n2 - Improvisation / The night watch\n3 - Lament\n4 - Starless and Bible Black\n\nI couldn't believe when i saw this. It's amazing. It's a dream for any King Crimson fan. I didn't expect to find such a high quality video of this wonderful band, whose best phase videos are so scarce. As far as i know there are:\n- That 30sec fragment of &quot;21st Centruy Schzoid Man&quot;, filmed in Super8, with original audio added.\n- &quot;Easy Money&quot; live in New York, not that great quality (my copy's quite reasonable, though) along with the promotional video and credits ending with lettering &quot;King Crimson &amp; Black Oak Arkansas&quot; at the sound of &quot;Larks' Tongues in Aspic Part II&quot; with video of the performance (i only have this in VHS! Who wants to rip, be my guest and get in touch!).\n- And the classic Larks' Toungues In Aspic Part I live at the famous Beat Club.\nIf anyone has something besides of that, PLEASE SEND! Don't store it! These things must stop being rare!\nBut let's get down to business here... It's no use reviewing this. It's plain and simple. It's a King Crimson video. It's marvelous. The quality is the highest. The repertoire is beautiful. It's 30min long, it's the full program video. It's the same Melody show where Genesis performed (i've got this video! Who wants ask for it in the commnets), with the same speciality of TOTALLY BIZARRE images showing up at the Chroma Key. In this King Crimson video, they've acquired their taste; they're really bizarre, but not childlike and ridiculous. But let's face it, ain't it what made the 60-70's what they're today? You just can't believe on such a thing coming out of your TV! No one else nowadays has the guts to put a band like King Crimson on TV! &quot;Larks' Tongues in Aspic Part II&quot; is simply impecable, sound like the original recording, until you hear the TERRIFYING violin solo by David Cross... Man, amazing thing. Somebody has to explain me what this guy does to get this sound from the violin, not only by being eletric. In the solo he shoots some really tense harmonizations, besides of the virtuoso effect. In the improvisation that forecomes &quot;The night watch&quot; you get a &quot;light&quot; mood, and rises the genious of this band, regardless of the age or line-up. In this very track, another impecable performance, so different from the &quot;live chaos&quot; King Crimson. In &quot;Lament&quot;, comes again the weirdness of this program.... Somebody, for Christ's sake could tell me, what the hell does these tits ","torrent":{"xt":"urn:btih:39473e3f4b5e32c4c8b4ca9b0e9e4d66576320b3","amp;dn":"King+Crimson+-+Live+in+French+TV+Program+Melody+%281974%29+%5BDIVx%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39473e3f4b5e32c4c8b4ca9b0e9e4d66576320b3","infoHashBuffer":{"type":"Buffer","data":[57,71,62,63,75,94,50,196,200,180,202,155,14,158,77,102,87,99,32,179]},"announce":[],"urlList":[]}}