{"title":"Cinco Horas con Mario - Miguel Delibes [Epub-Pdf][Spanish]","uid":6989093,"size":1117045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39bb0fb7daf5a8b84490d51a12aa9fe06bfb1433&amp;dn=Cinco+Horas+con+Mario+-+Miguel+Delibes+%5BEpub-Pdf%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1327651075,"description":"Cinco Horas Con Mario - Mario Delibes [PDF-EPUB\n\n\n\nAcerca de Cinco Horas Con Mario\nEl nÃƒÂºcleo central de &quot;Cinco horas con Mario&quot;, lo constituye el monÃƒÂ³logo de Carmen, una conservadora mujer de clase media con el cadÃƒÂ¡ver de su prematuramente fallecido marido Mario, catedrÃƒÂ¡tico de instituto y comprometido periodista e intelectual. A travÃƒÂ©s de los recuerdos de su, en muchos aspectos, insatisfactoria vida en comÃƒÂºn, Delibes recrea la EspaÃƒÂ±a provinciana de la ÃƒÂ©poca, los problemas de la falta de comunicaciÃƒÂ³n en el matrimonio, asÃƒÂ­ como el conflicto de las &quot;dos EspaÃƒÂ±as&quot;. La obra consta de un prÃƒÂ³logo, un nÃƒÂºcleo central de veintisiete capÃƒÂ­tulos que comprenden el monÃƒÂ³logo de Carmen y un epÃƒÂ­logo. Cada uno de estos capÃƒÂ­tulos del nÃƒÂºcleo central comienza con una cita bÃƒÂ­blica, pasajes que Mario habÃƒÂ­a subrayado en su biblia de cabecera. Partiendo de estas citas, Carmen va desgranando sus pensamientos, haciÃƒÂ©ndole a su marido continuos reproches por su integridad moral y falta de ambiciÃƒÂ³n, que han impedido que alcanzaran el reconocimiento y status social que ella ambicionaba para su familia, asÃƒÂ­ como por su actitud de superioridad y frialdad hacia ella. Relata cÃƒÂ³mo se hicieron novios, cÃƒÂ³mo acabaron casÃƒÂ¡ndose y otros recuerdos que revivirÃƒÂ¡ durante las cinco horas en las que vela el cuerpo de su difunto marido. &quot;Cinco horas con Mario&quot; es considerada la obra maestra de Miguel Delibes y, fuera de sus contenidos existenciales, la novela es una furiosa sÃƒÂ¡tira de la mediocridad de las clases medias surgidas al amparo del desarrollo econÃƒÂ³mico durante el franquismo...","torrent":{"xt":"urn:btih:39bb0fb7daf5a8b84490d51a12aa9fe06bfb1433","amp;dn":"Cinco+Horas+con+Mario+-+Miguel+Delibes+%5BEpub-Pdf%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39bb0fb7daf5a8b84490d51a12aa9fe06bfb1433","infoHashBuffer":{"type":"Buffer","data":[57,187,15,183,218,245,168,184,68,144,213,26,18,170,159,224,107,251,20,51]},"announce":[],"urlList":[]}}