{"title":"Jane Smiley - Duplicate Keys [epub]","uid":9421862,"size":380418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39df6dda89e90217282b002e7de5da744def6ff6&amp;dn=Jane+Smiley+-+Duplicate+Keys+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1388604156,"description":"Alice Ellis is a Midwestern refugee living in Manhattan. Still recovering from a painful divorce, she depends on the companionship and camaraderie of tightly knit circle of friends. At the center of this circle is a rock band struggling to navigate New York?s erratic music scene, and an apartment/practice space with approximately fifty key-holders. One sunny day, Alice enters the apartment and finds two of the band members shot dead. As the double-murder sends waves of shock through their lives, this group of friends begins to unravel, and dangerous secrets are revealed one by one. When Alice begins to notice things amiss in her own apartment, the tension breaks out as it occurs to her that she is not the only person with a key, and she may not get a chance to change the locks.\n\nJane Smiley applies her distinctive rendering of time, place, and the enigmatic intricacies of personal relationships to the twists and turns of suspense. The result is a brilliant literary thriller that will keep readers guessing up to its final, shocking conclusion ","torrent":{"xt":"urn:btih:39df6dda89e90217282b002e7de5da744def6ff6","amp;dn":"Jane+Smiley+-+Duplicate+Keys+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39df6dda89e90217282b002e7de5da744def6ff6","infoHashBuffer":{"type":"Buffer","data":[57,223,109,218,137,233,2,23,40,43,0,46,125,229,218,116,77,239,111,246]},"announce":[],"urlList":[]}}