{"title":"Sexually Broken--Lanky fit redhead Cici Rhodes hogtied on a box ","uid":9227037,"size":872646553,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3b5400b41869c2388c55e88a1df78cf27ba28fd2&amp;dn=Sexually+Broken--Lanky+fit+redhead+Cici+Rhodes+hogtied+on+a+box+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"merzedes","files":-1,"time":1385021889,"description":"Lanky fit redhead Cici Rhodes hogtied on a box and made to service cocks! Punishing sloppy BJs! | Cici Rhodes | Matt Williams\n\nNovember 20, 2013\n\n\nMP4 only.\n\n\nCici Rhodes is a tall glass of water, but it doesn't matter the size of a girl, they all can be bound down and made to service the dick in the end. It is a lazy Tuesday afternoon and we are just passing time hanging out on our phone. True, we have two bound bitches in a box, but we will get around to them when we are good and ready and not a minute before.\n\nCici is shackled in a challenging hogtie, wrists to ankles, and you can see the strain written across her face. The beauty of a hogtie is that it leaves both ends open for use. While our redhead decorates the top of the box, the big breasted Rain DeGrey is stashed inside for later use. Once our phone stops being entertaining, we decide to see what sort of fun we can have with these sluts.\n\n10 inches of massive meat strides right up and settles into her face pussy. We believe in multi tasking, and while the dick is owning her mouth hole, we attack the other end with our trusty vibrator. It is amazing how quickly you can unravel a slut with cock and orgasms. She is reduced to a sweaty gasping mess in mere minutes. The dick pummels her face and the drool rains down out of her open mouth.\n\nNever letting up, never showing mercy, back and forth the cocks run a train on her face. We believe in teamwork and use the bitch in the box to play with our balls while Cici polishes our fuckstick. Cici is dizzy and panting, trying to hang in there, but completely outmatched. Orgasms and dick will win every time. We have messed up that pretty little decoration but good. She is completely undone.\n\nOnce we stop being entertained, we simply walk away. Those two aren't going anywhere. If we get bored later, we might come back for another round. Maybe. Now where did we put our phone? \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_20crhodes/SexuallyBroken-Cici-Rhodes-Matt-Williams-Lanky-fit-redhead-Cici-Rhodes-hogtied-on-a-box-and-made-to-service-cocks-Punishing-sloppy-BJs.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_20crhodes/SexuallyBroken-Cici-Rhodes-Matt-Williams-Lanky-fit-redhead-Cici-Rhodes-hogtied-on-a-box-and-made-to-service-cocks-Punishing-sloppy-BJs.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:3b5400b41869c2388c55e88a1df78cf27ba28fd2","amp;dn":"Sexually+Broken--Lanky+fit+redhead+Cici+Rhodes+hogtied+on+a+box+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b5400b41869c2388c55e88a1df78cf27ba28fd2","infoHashBuffer":{"type":"Buffer","data":[59,84,0,180,24,105,194,56,140,85,232,138,29,247,140,242,123,162,143,210]},"announce":[],"urlList":[]}}