{"title":"Last friends","uid":6681124,"size":8086224732,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3be07f97ecb94c3865407891d8f64b085a0b00b3&amp;dn=Last+friends&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"turtlespy","files":11,"time":1316196824,"description":"&quot;Last Friends tackles issues that afflict the current generation. Michiru's mother has brought a man back to their home and she is bullied at her workplace where she works as a beauty parlour assistant. She starts cohabiting with her boyfriend, a good young man who works at the Child Welfare Division and the only person who can give her emotional support, but ends up the victim of domestic violence and becomes fearful of love. The boyishly charming Ruka was a classmate of Michiru's in junior high school. She has performed brilliantly as a motocross racer and aims to win the national championship, but as the story progresses, a deep worry that she can neither confide in her parents or close friends grows evident. Takeru is a hair and makeup artist acquainted with Ruka. He is a good confidant to females due to his kindness and perceptiveness, and finds himself attracted to Ruka but has a phobia of sex as a result of a past trauma. The three of them become house mates and through their associations with others, gain the capacity to be positive about life.&quot;\n\n\n\nLast friends episode 1-11, completed, translated by Kioku. \n\n\nEnjoy, and don't forget to seed!","torrent":{"xt":"urn:btih:3be07f97ecb94c3865407891d8f64b085a0b00b3","amp;dn":"Last+friends","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3be07f97ecb94c3865407891d8f64b085a0b00b3","infoHashBuffer":{"type":"Buffer","data":[59,224,127,151,236,185,76,56,101,64,120,145,216,246,75,8,90,11,0,179]},"announce":[],"urlList":[]}}