{"title":"John Keegan - History of Warfare","uid":4209182,"size":265296937,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3c311c438f6162120014b636409fc674bf2585bf&amp;dn=John+Keegan+-+History+of+Warfare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":232,"time":1211973307,"description":"A History of Warfare by John Keegan \n\nI&amp;#039;ll let the professional reviwer below describe the text, but I would like to say THIS - I teach history for a living. My passion is military history. If there were five books that I could force everyone on Earth to read, this would be one of them. This book is not about any nation or strategy. It is about what war WAS, what war IS, and how it functions. Modern citizens who like to pop off their opinions about a current war or the military (pro or con) usually have no idea what they are talking about. For the other history lovers who may see this, what Keegan does here is REFUTE the classic offering by Clausewitz that war is the continuation of politics by other means. Folks - for historians, this is as earthshaking an assertion as Einstein refuting Newton, or Copernicus disproving Aristotle. Plus, it&amp;#039;s a rollicking good read. - Rambam1776\n\n\n--------------------------------------------------------------------------------\n\nEditorial Reviews\n\nFrom Publishers Weekly\nIn his sweeping new study, Keegan ( The Face of Battle ) examines the origins and nature of warfare, the ethos of the primitive and modern warrior and the development of weapons and defenses from the battle of Megiddo (1469 B.C.) into the nuclear age. Keegan offers a refreshingly original and challenging perspective. He characterizes warriors as the protectors of civilization rather than as its enemy and maintains that warfare is &quot;entirely a masculine activity.&quot; Though warfare has become an ingrained practice over the course of 4000 years, he argues, its manifestation in the primitive world was circumscribed by ritual and ceremony that often embodied restraint, diplomacy and negotiation. Peacekeepers, he suggests, would benefit from studying primitive warmaking--especially now, &quot;a time when the war of all against all already confronts us.&quot; A masterwork. Photos. 40,000 first printing; History Book Club main selection; BOMC alternate. \nCopyright 1993 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title. \n\nFrom School Library Journal\nYA-Keegan begins his comprehensive but concise survey by debunking the classical tenet that war is an inevitable result of politics. In a well-developed and relatively easy-to-follow argument, he reexamines this previously inviolate theory. By following the progress of war and warriors from primitive societies to the post-Cold War era, and by detailing the concurrent development of weapons technology, he allows readers to see that warfare need not be an all-or-nothing event. He includes many interesting details in his survey, e.g., vivid descriptions of torture, of the development of horse-warriors and charioteers, and of the arrival and consequences of the atom bomb. While leading readers to the conclusion and hope that man is not necessarily a warrior, he canvasses the spread of &quot;civilization&quot; and the making of nation-states as we know them today. The book includes prints, diagrams, and photographs. This title will challenge interested readers and prove useful for research papers, philosophical discussions, debates, and anthropology and sociology classes. Even dedicated militarists will find food for thought in Keegan&amp;#039;s theories and historical perspective.\nSusan H. Woodcock, King&amp;#039;s Park Library, Burke, VA\nCopyright 1994 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title. \n\n\nPaperback: 496 pages \nPublisher: Vintage; 1 edition (November 1, 1994) \nLanguage: English \nISBN-10: 0679730826 \nISBN-13: 978-0679730828  \n &lt;a href=&quot;\nhttp://www.amazon.com/History-Warfare-John-Keegan/dp/0679730826/ref=pd_bbs_sr_3?ie=UTF8&amp;s=books&amp;qid=1211949002&amp;sr=8-3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/History-Warfare-John-Keegan/dp/0679730826/ref=pd_bbs_sr_3?ie=UTF8&amp;s=books&amp;qid=1211949002&amp;sr=8-3&lt;/a&gt;","torrent":{"xt":"urn:btih:3c311c438f6162120014b636409fc674bf2585bf","amp;dn":"John+Keegan+-+History+of+Warfare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c311c438f6162120014b636409fc674bf2585bf","infoHashBuffer":{"type":"Buffer","data":[60,49,28,67,143,97,98,18,0,20,182,54,64,159,198,116,191,37,133,191]},"announce":[],"urlList":[]}}