{"title":"Modern Inorganic Synthetic Chemistry","uid":14426150,"size":60277132,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c9736e4bb98dc7eda85c01d2ea1dea9b917a4f0&amp;dn=Modern+Inorganic+Synthetic+Chemistry&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1461571133,"description":"Modern Inorganic Synthetic Chemistry - Ruren Xu et al. (Elsevier, 2011).pdf\r\n\r\nISBN 978-0-444-53599-3\r\n\r\nThe book has four main parts. In the first part the discussion centers on inorganic synthesis reactions, dealing with inorganic synthesis and preparative chemistry under specific conditions: high temperature, low temperature and cryogenic, hydrothermal and solvothermal, high pressure and super-high pressure, photochemical, microwave irradiation and plasma conditions. The second part systematically describes the synthesis, preparation and assembly of six important categories of compounds with wide coverage of distinct synthetic chemistry systems: coordination compounds, coordination polymers, clusters, organometallic compounds, non-stoichiometric compounds and inorganic polymers. In the third part seven important representative inorganic materials are selected for discussion of their preparation and assembly, including porous, advanced ceramic, amorphous- and nano-materials, inorganic membranes, synthetic crystals and advanced functional materials. The last part of the book, which is also its distinct feature, addresses the frontiers of inorganic synthesis and preparative chemistry. These final two chapters introduce the two emerging synthetic areas. Included are approximately 3000 references, a large proportion of which are from the recent decade.\r\n\r\n\r\nFocuses on the &quot;chemistry&quot; of inorganic synthesis, preparation and assembly of various compounds and describes all inorganic synthesis methods\r\nNew state of the art inorganic synthesis chemistry areas\r\nInclusion of a number of real examples for the preparation and assembly of important classes of materials\r\nMore than 3,000 reference to the primary literature\r\nComprehensive state of the art reviews written by the experts in the area","torrent":{"xt":"urn:btih:3c9736e4bb98dc7eda85c01d2ea1dea9b917a4f0","amp;dn":"Modern+Inorganic+Synthetic+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c9736e4bb98dc7eda85c01d2ea1dea9b917a4f0","infoHashBuffer":{"type":"Buffer","data":[60,151,54,228,187,152,220,126,218,133,192,29,46,161,222,169,185,23,164,240]},"announce":[],"urlList":[]}}