{"title":"The Emergency - Coomi Kapoor","uid":13130529,"size":730343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cb6295c5353f940a9fd0ee2e37d131f74b52e10&amp;dn=The+Emergency+-+Coomi+Kapoor&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1451834483,"description":"In June 1975, Coomi Kapoor was a young reporter at the Indian Express in Delhi, when Indira Gandhi declared a state of Emergency, suspending civil liberties and sending the opposition leaders to prison. In the dark days that followed, she personally experienced the full fury of the Emergency—her journalist husband was imprisoned on flimsy charges under the draconian Maintenance of Internal Security Act, and her brother-in-law, Jana Sangh MP Subramanian Swamy, was on the run to evade arrest, while her family faced constant threats and harassment from the security forces.\r\n \r\n\r\nMeanwhile Indira Gandhi, her son Sanjay and his coterie unleashed a reign of terror that saw forced sterilizations, brutal ‘beautification’ drives that left thousands of people homeless overnight, and students and other innocent people jailed without cause or trial, while the press was firmly muzzled under strict censorship rules.\r\n \r\n\r\nThis eyewitness account of the Emergency vividly recreates the drama, the horror, as well as the heroism of a few, during those nineteen months, forty years ago, when Indian democracy was derailed","torrent":{"xt":"urn:btih:3cb6295c5353f940a9fd0ee2e37d131f74b52e10","amp;dn":"The+Emergency+-+Coomi+Kapoor","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cb6295c5353f940a9fd0ee2e37d131f74b52e10","infoHashBuffer":{"type":"Buffer","data":[60,182,41,92,83,83,249,64,169,253,14,226,227,125,19,31,116,181,46,16]},"announce":[],"urlList":[]}}