{"title":"Aliens Vs. Predator Extinction (NTSC - DVD BUILD), PS2","uid":7140646,"size":427025797,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:3d9a126df3e9349a1b1c7df421570f25bfc3d658&amp;dn=Aliens+Vs.+Predator+Extinction+%28NTSC+-+DVD+BUILD%29%2C+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1332991706,"description":"Aliens VS. Predator Extinction for the PS2                     Rel. 07/29/2003\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         ISO\nGenre.:        Action, Strategy\nConsversion:   CD To DVD\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works. \n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes - Game was rebuilt to DVD format so you can use it with\n                FMCB if you need it.  FMCB/ESR and Emulator is also\n                available in this download.\n\n\n\n\nGame Description:\n\nThe battle that has split more blood over centuries continues, with the human marines caught in-between the powerful Aliens and the deadly Predators.\n\nMoving away from the FPS series on PC, Extinction has you controlling one of the three races in a real time strategy mix, building each unit and setting them out into the battlefield to complete a range of tasks.\n\nEach race has an advantage and disadvantage. The humans have a collection of different units, from heavy weapons experts to medics, and are better known for their long range attacks. Predators are hardcore fighters, taking the battle right up to the enemy, although there are fewer of them available to counter act their superior power. Finally, the Aliens are fast and deadly, and always hunt in large packs.\n\nUpgrade weapons and use terrain to an advantage in each level to make certain your team (whoever or whatever they may be) survive until the next battle.\n\n\nFeatures:\n\n* Harness the unique advantages you possess as an Alien, Predator, or Colonial\n  Marine to wage war in 21 single-player missions. \n\n* Control one of three different races - each with it's own characteristics and \n  abilities to suit any style of play. \n\n* Upgrade up to 10 different unit types of various races including new, never \n  before seen units such as the Predator Hydra or the Alien Ravager. \n\n* Engage the enemy in 21 unique maps, from jungles to deserts to high-tech \n  laboratories. \n\n* Utilize powerful resources and strategies including pulse rifles, exosuits, and \n  air strikes to unleash devastating attacks on your enemies.\n\n\nGame Pics Included\n\n\nBurn with DVD Decrypter at 4x or 8x speed. (Included in Download)\n\n\n\nUse Verbatim or Tayio Yuden DVD Media for best quality, or if other media\nisn't working.\n\n\n\nPlease Seed This Torrent. \n\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:3d9a126df3e9349a1b1c7df421570f25bfc3d658","amp;dn":"Aliens+Vs.+Predator+Extinction+%28NTSC+-+DVD+BUILD%29%2C+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d9a126df3e9349a1b1c7df421570f25bfc3d658","infoHashBuffer":{"type":"Buffer","data":[61,154,18,109,243,233,52,154,27,28,125,244,33,87,15,37,191,195,214,88]},"announce":[],"urlList":[]}}