{"title":"FS2004 - Aerosoft Kos 2005 (RIP)","uid":3738403,"size":5145760,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3e0856fea04fc0644ee39136ce8e1e9e90102cb6&amp;dn=FS2004+-+Aerosoft+Kos+2005+%28RIP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stevekasian","files":1,"time":1184130105,"description":"Aerosoft Kos 2005 (RIP)\n(Current version is v3.0, but I&amp;#039;m not sure which version this is)\n\nThe Greek island Kos was as well known in the heyday of the ancient Greeks as it is to the western europan tourists of today. To handle the influx every summer Kos has an airport that is well suited to handle the bigger aircraft. Ippokartis airport (KGS/LGKO) has been steadily growing to handle close to 2 million passengers in 2003. The single 2400 meter runway does not have an ILS so you will need to check the weather before approaching the airport! But flying the VOR DME approaches will challenge your flying skills. You&amp;#039;ll find all the airport charts by means of the great folks of IVAO Hellas. Check out their excellent chart section at this location. \n\nBut not only the airport is modeled in this product, the whole island is covered with mesh, landclass and new roads. Even some of the larger hotels are included. Not the largest product we ever shipped, but it is good quality and a VERY nice destination for your flights from the bigger airports in North Western Europe. The screenshots should proof the quality.\n\nFeatures: \n\n\n- The whole terminal and apron layout based on accurate data\n- Accurate day and night textures \n- Static aircrafts if you prefer to run without AI Traffic\n- Taxiways, runways and parking positions\n- Whole island covered with High Definition mesh, landclass and roads.\n\n","torrent":{"xt":"urn:btih:3e0856fea04fc0644ee39136ce8e1e9e90102cb6","amp;dn":"FS2004+-+Aerosoft+Kos+2005+%28RIP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e0856fea04fc0644ee39136ce8e1e9e90102cb6","infoHashBuffer":{"type":"Buffer","data":[62,8,86,254,160,79,192,100,78,227,145,54,206,142,30,158,144,16,44,182]},"announce":[],"urlList":[]}}