{"title":"Autodesk Revit Architecture 2014 Essentials [Epub] Ehhhh","uid":8776227,"size":39329409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e1809b83900e9d814636adf72ed96f7237d05f9&amp;dn=Autodesk+Revit+Architecture+2014+Essentials+%5BEpub%5D+Ehhhh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ehhhhtozebec","files":-1,"time":1375561515,"description":"Overview\n\nQuickly learn essential Revit Architecture tools and techniques\n\nAutodesk Revit Architecture is the powerful, sophisticated building information modeling (BIM) software that has transformed the architectural design industry. This Autodesk Official Press guide is the perfect introduction to the powerful software for architects, designers, and students. Three Revit experts provide concise explanations, real-world examples, and plenty of hands-on exercises and tutorials. You'll soon master the basics and then find yourself using the software confidently, productively, and effectively.\n\nBeginners will get comfortable with Revit's core features and functions. Current users will have a valuable reference to refresh and hone their skills. And everyone can use this practical book to help prepare for the Revit Architecture certification exams.\n\nGets readers up and running on Autodesk Revit Architecture 2014, Autodesk's industry-leading building information modeling software\nExplains core Revit tools, features, functionality, real-world workflows, and BIM concepts\nCovers schematic design, modeling, families, views, creating drawing sets, and more\nFeatures best practices, rendering and visualization, worksharing, documentation, and annotation\nProvides downloadable starting and ending files, so readers can compare their work to that of the pro's\n\nAutodesk Revit Architecture 2014 Essentials is your perfect introduction toto the powerful industry-leading BIM software.\n\n\nProduct Details\n\nISBN-13: 9781118729748\nPublisher: Wiley, John &amp; Sons, Incorporated\nPublication date: 4/10/2013\nSold by: Barnes &amp; Noble\nFormat: eBook\nEdition number: 1\nPages: 416\n\n\nMeet the Author\n\nRyan Duell is a senior quality assurance analyst for Revit. He also contributes to the Revit Clinic blog (revitclinic.typepad.com), presents at Autodesk University, and is a former BIM manager. Tobias Hathorn is a licensed architect and user experience designer for Revit and also lectures at Autodesk University. He previously worked at BNIM architects on a million-square-foot IRS paper processing center using Revit. Tessa Reist Hathorn is a licensed architect at Austin Architects (Cambridge, Massachusetts) and has worked on everything from private residences to the Marina Bay Sands, Singapore. All three authors teach Revit at the Boston Architectural College.","torrent":{"xt":"urn:btih:3e1809b83900e9d814636adf72ed96f7237d05f9","amp;dn":"Autodesk+Revit+Architecture+2014+Essentials+%5BEpub%5D+Ehhhh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e1809b83900e9d814636adf72ed96f7237d05f9","infoHashBuffer":{"type":"Buffer","data":[62,24,9,184,57,0,233,216,20,99,106,223,114,237,150,247,35,125,5,249]},"announce":[],"urlList":[]}}