{"title":"Hide.IP.Easy.v5.0.8.8 + crack","uid":6534945,"size":8655703,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3e5419aa98a076cf6a5c6190cff6c6138d5bfcf9&amp;dn=Hide.IP.Easy.v5.0.8.8+%2B+crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1310479507,"description":"Hide IP Easy 5.0.8.8\n\n\nHide IP Easy - Protect Your Privacy Easily on the Internet. Browsing on the Internet is becoming more and more dangerous in today's world. Hackers and identity thieves are trying to use IP address to get any information out of you: home address, credit card information, social security information, your bank accounts and other personal information. Actually, keeping your privacy is simple and easy. Use Hide IP Easy to hide your real IP with a fake one, surf anonymously, prevent hackers from monitoring your activity, and provide full encryption of your online activity, all with the click of a button.\n\nKey Features\n* Anonymous Web Surfing\nYou are assigned fake IP addresses and protected from hackers who will be tricked by your fake IP instead of your real one.\n\n* Protect Your Identity\nSurf anonymously to prevent websites, identity thieves or even government from compromising your computer, tracking your online activities, tracing your exact location or intercepting your private financial information.\n\n* Select Your Physical IP location\nYou decide fake IP of which country to use by choosing a country from the Choose IP Country window.\n\n* Send Anonymous E-mails\nHide your real IP in E-mail headers. Be protected while sending emails from Yahoo!, Hotmail, GMail.\n\n* Un-ban Yourself from Forums and Restricted Sites\nUse Hide IP Easy to change your IP address and access forums and restricted sites that have ever banned you.\n\n* Operating Systems\nWindows 2000/XP/Vista/7 (32-bit and 64-bit)\n\n","torrent":{"xt":"urn:btih:3e5419aa98a076cf6a5c6190cff6c6138d5bfcf9","amp;dn":"Hide.IP.Easy.v5.0.8.8+%2B+crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e5419aa98a076cf6a5c6190cff6c6138d5bfcf9","infoHashBuffer":{"type":"Buffer","data":[62,84,25,170,152,160,118,207,106,92,97,144,207,246,198,19,141,91,252,249]},"announce":[],"urlList":[]}}