{"title":"Dare.Dorm.17.XXX.DVDRip.x264-XCiTE","uid":8866598,"size":2271210746,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4010019d51a33f7aabc47455e35fd11e9d264e43&amp;dn=Dare.Dorm.17.XXX.DVDRip.x264-XCiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":3,"time":1377928905,"description":"Dare.Dorm.17.XXX.DVDRip.x264-XCiTE\n\nReal Submitted Dorm Room Footage!\n\nMore Booze, Boobs, &amp; Babes! Join The Party That Never Ends!\n\n'One For The Money'-Sometimes girls act and do things without thinking of the consequences, but not these girls. They knew exactly what they were doing while they were doing it. They totally trashed these guys' dorm room, but they knew that the only way to make it up to them was to allow the guys to do whatever they wanted back to them. First, they blindfolded the guys and gave them a very sexy lap dance. Did I mention that all of this is happening while there is a dorm party going on all around them? After teasing the guys for a few minutes, they turned the sexiness level to eleven; banging every which way. That totally makes up for destroying their dorm room!\n\n'Double Team'-This is a special submission for Dare Dorm. We go to meet the lovely Mallory and, boy, does she love to party! Fortunately, she heard about us and was totally down to make that money. So, they invite the guys from the next dorm and Mallory starts things with a good old game of truth or dare. That quickly escalates to Mallory blowing the first two dudes that got naked. She always wanted to be in a threesome, especially if she was getting paid. Lovely Mallory got banged in every which way possible, and she loved every minute of it. Truly a rising star!\n\n'Three Is A Crowd'-Sometimes parties don't turn out the way you want them to, but not this Dare Dorm party. A group of really hot girls were just hanging in their dorm, and had the great idea to call up some guys. Once the guys made it to the party, they were all just wondering what to do, so nothing breaks the ice like an old game of strip tease. That of course led to Ivette completely taking off all of her clothes, and convincing another girl to have a threesome. What a great idea! Things got so heated that Ivette kicked everybody out and decided to have a threesome with no audience.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=zsl90dahbywnt9z3a1yl.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=zsl90dahbywnt9z3a1yl.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=z528ch60kim6fugqkr91.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=z528ch60kim6fugqkr91.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:4010019d51a33f7aabc47455e35fd11e9d264e43","amp;dn":"Dare.Dorm.17.XXX.DVDRip.x264-XCiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4010019d51a33f7aabc47455e35fd11e9d264e43","infoHashBuffer":{"type":"Buffer","data":[64,16,1,157,81,163,63,122,171,196,116,85,227,95,209,30,157,38,78,67]},"announce":[],"urlList":[]}}