{"title":"Jim Crawford - Confessions of an Antinatalist (pdf)","uid":9622561,"size":30654552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4172824d86994e22935f43e72f610813a6aac473&amp;dn=Jim+Crawford+-+Confessions+of+an+Antinatalist+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AreciboMessage","files":1,"time":1392532096,"description":"READ THIS:\n\nAs far as I know, this is the only torrent of this book in existence. This is a scanned copy of the physical book, so the quality is mediocre. You also need to flip your view counterclockwise (in Acrobat Reader go to View, Rotate View, Counterclockwise). \n\nIf you enjoyed the book, please support Jim by purchasing a copy (when it becomes available) at\n\n\nAmazon description:\n\nLife is a mixture of good and bad, or so they say. Trouble is, there's no way to determine where a particular life might fall along fortune's spectrum. For every child born into the lap of luxury, there's another born on the point of a knife. There are no guarantees as to what may transpire as the immediate present unfolds into the uncertain future. Things change in an instant. Two things, however, are certain. Everyone will suffer. And everyone will die. Back to where we came from. Knowing this, and understanding full well that any particular life embodies the potential for experiencing extreme pain and unhappiness unceasing in some cases is procreation really worth the risk?\n\nJim Crawford doesn t believe it is. In Confessions of an Antinatalist, Crawford reflects on what it means to exist in the belly of a ravening serpent-life whose only prey is itself, and whose teeth are very, very sharp.","torrent":{"xt":"urn:btih:4172824d86994e22935f43e72f610813a6aac473","amp;dn":"Jim+Crawford+-+Confessions+of+an+Antinatalist+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4172824d86994e22935f43e72f610813a6aac473","infoHashBuffer":{"type":"Buffer","data":[65,114,130,77,134,153,78,34,147,95,67,231,47,97,8,19,166,170,196,115]},"announce":[],"urlList":[]}}