{"title":"Don Dokken - Stay  (2nafish)","uid":5479966,"size":200239108,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4179f792753f69cf8ae868396df7aa0f1c757c5a&amp;dn=Don+Dokken+-+Stay++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1270372246,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nUp from the Ashes is a 1990 hard rock album by Don Dokken, best known as the lead singer of Dokken. The sound of the album was similar to Dokken's work with his former band. The album did not reach commercial success achieved by Dokken It reached the Top 50 on the Billboard 200 album chart in the US. The line-up for this album consisted of Don Dokken performing vocals, John Norum formerly of Europe on Lead guitar, Billy White on Lead guitar, Peter Baltes formerly of Accept on bass, and Mikkey Dee formerly of King Diamond and MotÃƒÂ¶rhead  on drums. The music videos for the songs &quot;Stay&quot; and &quot;Mirror Mirror&quot; received airplay on MTV's Headbanger's Ball.\n\nDonald Maynard Dokken (born June 29, 1953) is a singer most famous for being the lead singer and founder of the band Dokken. He is known for his vibrato-laden, melodic vocal style which has made him an influential figure in American heavy metal. After enjoying mainstream success with Dokken, he parted ways with the band in 1988 and pursued a solo career. His 1990 solo album, Up from the Ashes, featured Europe guitarist John Norum and spawned two singles.\n\nDon reformed Dokken in the early 1990s and has been continuing on with the band ever since. He released his second solo album titled Solitary in 2008, which was a stylistic departure from his Dokken material. He continues to tour with Dokken today and is known for his unique stage persona.\n\nIn the late 1980s, however, personal tension between Dokken and Lynch took its toll on the band. In 1988, after the Monsters of Rock Tour and a further platinum album, Don Dokken decided to break up the band and they went on their separate ways. Don Dokken originally wanted to continue on with the Dokken name, but since Lynch maintained partial ownership, he was forced to put out his next album under the Don Dokken name, and it became known as his first solo album. The album, titled Up from the Ashes, was released in 1990, and was very similar to the Dokken catalog. This project was a supergroup of sorts, made up of guitarists John Norum (of Europe fame) and Billy White, bassist Peter Baltes (of Accept fame) and drummer Mikkey Dee (of King Diamond fame and then MotÃƒÂ¶rhead).\n\nBoth Dee and Baltes had previously been members of Dokken during the late 1970s for brief periods. Two music videos were made for the singles &quot;Mirror Mirror&quot; and &quot;Stay&quot;. Also, during the late 1980s and early 1990s, Don spent time as a producer for the metal band XYZ.\n\nHe also made a guest appearance on the German progressive metal band Vanden Plas's &quot;Spirit of Live&quot; album as the vocalist for their live performance of Dokken's &quot;Kiss of Death&quot; with which the studio version can be found on Vanden Plas's &quot;Far Off Grace&quot; album.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4179f792753f69cf8ae868396df7aa0f1c757c5a","amp;dn":"Don+Dokken+-+Stay++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4179f792753f69cf8ae868396df7aa0f1c757c5a","infoHashBuffer":{"type":"Buffer","data":[65,121,247,146,117,63,105,207,138,232,104,57,109,247,170,15,28,117,124,90]},"announce":[],"urlList":[]}}