{"title":"Hamas. Political thought of. 2013 Meshaal.  Chariman","uid":11675173,"size":1602167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41ab8fd23bd1bdeb921f6e3aa50f52ddb1b9f4b9&amp;dn=Hamas.+Political+thought+of.+2013+Meshaal.++Chariman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":2,"time":1422824645,"description":"The Political Thought of Hamas 2013 Khaled Meshaal, Chairman\n\nWhat is Hamas's philosophy and vision for liberation? Why doesn't it recognise Israel despite intense international pressure to do so? How does it view the PLO? Does it have scope for flexibility given its immutable principles? These are just a few of the questions that continually crop up and struggle to find adequate address in western discourse on the Islamic Resistance Movement, Hamas. This book offers an authoritative answer to these questions and more. It examines the Palestinian, Arab, Islamic and humanitarian roles in the quest for liberation; the extent to which that vision is influenced by the reality of political division; and the incoherence and fragmentation that dominates the Arab reality. It also clarifies Hamas' position towards the prevailing alliances and blocs, how the movement views them and how ethnic and sectarian plurality can be employed to serve the struggle for freedom. \n\nKhaled Meshaal is a Palestinian leader and has been the head of the Islamic Resistance Movemennt, Hamas' political bureau since 1996. He was born in 1956 in the West Bank village of Silwad and has lived in exile since the Six-Day War of 1967. Meshaal joined the Muslim Brotherhood in 1971 and following the official founding of Hamas in 1987, he assumed leadership of its Kuwaiti branch. In 1991 he moved to Jordan until the organisation was expelled in 1999. He then moved to Qatar briefly before settling in Syria. With the outbreak of the Syrian Revolution, he returned to Qatar in 2012 where he currently resides. In 1997, Meshaal was the subject of a bungled assasination attempt by agenst of the Israeli intelligence agency, Mossad. In 2012, he was listed 18th on British magazine the New Statesman's list of &quot;The World's 50 Most Influential Figures 2010&quot;. He is married with three daughters and four sons","torrent":{"xt":"urn:btih:41ab8fd23bd1bdeb921f6e3aa50f52ddb1b9f4b9","amp;dn":"Hamas.+Political+thought+of.+2013+Meshaal.++Chariman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41ab8fd23bd1bdeb921f6e3aa50f52ddb1b9f4b9","infoHashBuffer":{"type":"Buffer","data":[65,171,143,210,59,209,189,235,146,31,110,58,165,15,82,221,177,185,244,185]},"announce":[],"urlList":[]}}