{"title":"Anno 1503 A.D. (GOG)","uid":12262685,"size":994885809,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:426551c13710122bc622f1a0eca247cef8620d44&amp;dn=Anno+1503+A.D.+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":2,"time":1440193981,"description":"Install instructions:\n1. Run &quot;setup_anno_1503_2.0.0.5&quot;\n2. Play\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\nIf you like this game, support the developers and BUY IT!\n\nTitle: ANNO 1503 A.D.\nGenre: Simulation - Strategy - Managerial\nWorks on: Windows (XP, Vista, 7, 8, 10)\nLanguages:Audio and text: Deutsch, English\nModes: Single-player\nReleased: March 23, 2003\nSize: 0.9 GB\nCompany: Max Design GesMBH / Ubisoft\nRating:\tESRB Rating: Teen (with Violence)\nStore page: http://www.gog.com/game/anno_1503_ad\n\nAbout:\nANNO 1503 A.D. includes Anno 1503: The New World and its expansion Treasures, Monsters &amp; Pirates.\nLay claim to the New World in an epic saga of adventure and discovery. ANNO 1503 A.D. is a PC title that blends the excitement of real-time strategy with the depth of empire building.\nThe aim of the game is to establish colonies and seek out wealth and power. Watch your colonies grow while establishing trade and diplomatic ties with neighbouring cultures. Engage in combat on land and at sea to protect your colonies or to maintain freedom and independence.\nThe all-new combat system allows for much more sophisticated tactical preparation and some truly epic land and sea-based battles. Enjoy the variety and challenge of five varying climate zones while competing against computer-controlled players, including interactions with nine different cultures such as the Africans, Aztecs and Native Americans.\nStretch your influence through a powerful economic system which varies depending on location and includes goods such as weaponry, raw materials, and necessities such as clothes and food as well as more exotic items like silk and spices. Trades can be made several different ways, via an easily accessible trading menu that allows you to interact with other nations and form peace treaties. However, some cultures may rely on a more offensive, aggressive style of interaction, which can lead to potential conflict.\nUnique blend of real-time strategy with the depth of an empire-building epic.\nCompete against computer-controlled players and interact with nine different cultures from the 16th Century - each with their own personal traits and unique characteristics.\nSettle in climates as diverse as frozen tundra, bleak deserts and lush jungles - each with their own unique natural resources, vegetation, wildlife and terrain.\nNew combat system - vary your tactics based on the opponent, terrain and weaponry.\nEnhanced AI - differences in cultures lead to a variety of behaviors and interactions.\nOver 250 authentic building types including tobacco plantations, watchtowers and cannon foundries.\nSeveral gameplay modes - Single Scenario, Campaign, and Open-Ended\n\n\nMinimum system requirements - Windows: Windows XP / Vista / 7 / 8 / 10\nProcessor: 1.8 GHz Processor\nMemory: 512MB RAM (1 GB recommended)\nGraphics: 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended)\nHard Drive: 2GB HDD\nMouse, Keyboard","torrent":{"xt":"urn:btih:426551c13710122bc622f1a0eca247cef8620d44","amp;dn":"Anno+1503+A.D.+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"426551c13710122bc622f1a0eca247cef8620d44","infoHashBuffer":{"type":"Buffer","data":[66,101,81,193,55,16,18,43,198,34,241,160,236,162,71,206,248,98,13,68]},"announce":[],"urlList":[]}}