{"title":"Joy Division - Closer [24 bit FLAC] vinyl","uid":8292387,"size":949913583,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:429e92afe207882b9017b5e9e6ce5aa9a290a10b&amp;dn=Joy+Division+-+Closer+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1364076239,"description":"  Joy Division - Closer (1980) [24 bit FLAC] vinyl\n\n  Released: 1980\n  Source: FACTâˆ™XXV / UK\n  Genre: Pop/Rock\n  Style: New Wave, Post-Punk\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Atrocity Exhibition \n  A2. Isolation \n  A3. Passover \n  A4. Colony \n  A5. A Means To An End \n  B1. Heart And Soul \n  B2. Twenty Four Hours \n  B3. The Eternal \n  B4. Decades \n\n  If Unknown Pleasures was Joy Division at their most obsessively, carefully focused, ten songs yet of a piece, Closer was the sprawl, the chaotic explosion that went every direction at once. Who knows what the next path would have been had Ian Curtis not chosen his end? But steer away from the rereading of his every lyric after that date; treat Closer as what everyone else thought it was at first -- simply the next album -- and Joy Division's power just seems to have grown. Martin Hannett was still producing, but seems to have taken as many chances as the band itself throughout -- differing mixes, differing atmospheres, new twists and turns define the entirety of Closer, songs suddenly returned in chopped-up, crumpled form, ending on hiss and random notes. Opener &quot;Atrocity Exhibition&quot; was arguably the most fractured thing the band had yet recorded, Bernard Sumner's teeth-grinding guitar and Stephen Morris' Can-on-speed drumming making for one heck of a strange start. Keyboards also took the fore more so than ever -- the drowned pianos underpinning Curtis' shadowy moan on &quot;The Eternal,&quot; the squirrelly lead synth on the energetic but scared-out-of-its-wits &quot;Isolation,&quot; and above all else &quot;Decades,&quot; the album ender of album enders. A long slow crawl down and out, Curtis' portrait of lost youth inevitably applied to himself soon after, its sepulchral string-synths are practically a requiem. Songs like &quot;Heart and Soul&quot; and especially the jaw-dropping, wrenching &quot;Twenty Four Hours,&quot; as perfect a demonstration of the tension/release or soft/loud approach as will ever be heard, simply intensify the experience. Joy Division were at the height of their powers on Closer, equaling and arguably bettering the astonishing Unknown Pleasures, that's how accomplished the four members were. Rock, however defined, rarely seems and sounds so important, so vital, and so impossible to resist or ignore as here.","torrent":{"xt":"urn:btih:429e92afe207882b9017b5e9e6ce5aa9a290a10b","amp;dn":"Joy+Division+-+Closer+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"429e92afe207882b9017b5e9e6ce5aa9a290a10b","infoHashBuffer":{"type":"Buffer","data":[66,158,146,175,226,7,136,43,144,23,181,233,230,206,90,169,162,144,161,11]},"announce":[],"urlList":[]}}