{"title":"Seasons Change (A Fictional Memoir)","uid":10424095,"size":1053822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43619376a89cd856958bd27f29da0132026fe90d&amp;dn=Seasons+Change+%28A+Fictional+Memoir%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"alexdssf","files":2,"time":1403678785,"description":"So, this is the first time I've ever uploaded a torrent. And it's one of my own creation. It's my first novel, &quot;Seasons Change: How I Destroyed My Family and Saved My Life&quot;. I started it in 2009 and completed it in 2012, but since then I've had difficulties landing an agent or even self-publishing it. It's been so frustrating, since I put so much into this and yet people who write One Direction erotic fan fiction can get book deals in the six figures. So, now I've decided to distribute it via torrent for anyone and everyone to see. I've included my cover page with my information just to prove that this is original content.\n\n&quot;Seasons Change&quot; is a hybrid of memoir and fiction. The book is a work of fiction, but it's set up like a memoir. It's about a guy from Toronto named Graziano, who has been abused by his family since he was a kid. As he gets older, he loses many of his key allies, including his big brother (who left Canada and hasn't been seen since), his grandparents (who are killed in two separated but suspicious incidents), and his American boyfriend (the victim of a hate crime). On his 28th birthday, he finally reaches his breaking point and tries to kill himself. His family cuts him out of their lives forever, and Graziano, who has lived in and around the GTA all his life, returns to Toronto.\n\nGraziano is determined to make a new life for himself. He reconnects with Brandon, his former English professor, who provides him with a home and fatherly love. His therapist, Claire, also becomes a beacon of support. He even reconnects with a former classmate, Mykhaylo, and their friendship turns to romance, even if Graziano (still mourning his boyfriend) is hesitant at first. Unfortunately, his past is never far from him. A chance re-encounter with his family proves turbulent, and sets the stage for a complex plot to get rid of him and his friends. It also leads to shocking answers about what happened to his loved ones. All this takes place between October and December 2009, hence the title &quot;Seasons Change&quot;.\n\nThe manuscript and the cover page are in PDF format. I hope you all like it, because I've been having doubts about my writing ability. Thanks.","torrent":{"xt":"urn:btih:43619376a89cd856958bd27f29da0132026fe90d","amp;dn":"Seasons+Change+%28A+Fictional+Memoir%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43619376a89cd856958bd27f29da0132026fe90d","infoHashBuffer":{"type":"Buffer","data":[67,97,147,118,168,156,216,86,149,139,210,127,41,218,1,50,2,111,233,13]},"announce":[],"urlList":[]}}