{"title":"BDSM -  EVERYTHING'S FIXED AND EVERYONE LIES","uid":4464159,"size":78142382,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4365a8133cc00071bd5e62acbe4946a57f9feed0&amp;dn=BDSM+-++EVERYTHING%5C%27S+FIXED+AND+EVERYONE+LIES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kittyfeet1","files":-1,"time":1224836498,"description":"&quot;Submission and Coffee&quot; episode 179\nMUST BE OF LEGAL AGE\n\nWebsite for podcast: http://www.askdollie.com\nPage with links to zips and all episodes:    &lt;a href=&quot;\nhttp://www.askdollie.com/archives.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.askdollie.com/archives.htm&lt;/a&gt;\n\nEVERYTHING'S FIXED AND EVERYONE LIES (MP3)\nProfessor ThornDaddy's distance learning BDSM classroom, lesson 179. Creating love in your life despite the fact that EVERYTHING'S FIXED AND EVERYONE LIES!\n\nThornDaddy and Dollie Llama have amazing squirting slapping bondage rape sex. Then they talk about how NO ABUSIVE MAN WOULD BUY HIS WIFE A GUN, Better Know a Pervert, blind kinksters, Latvian bondage sex, Daddy daughter play, corporate downsizing, EVERYTHING'S FIXED AND EVERYONE LIES, the temporal nature of the universe, getting blown while you brush your teeth, FlexoPleasers, kinky rope care, more cat pee, coyote urine, fox urine, Forest Whitaker, funny gun accidents, eroticachallenge.com, nipple pinching, software for the blind, frozen cum spoons, replacements for heroin, Gorilla Tape, kinky cubicle kitties, pathos &amp; bathos, Trinity University, pulling yourself up by your bootstraps, rescued kitties, the last survivor from the Titanic sinking fast, the growing problem of kombucha mushroom parties, and the best music in the world: Television. Marquee Moon, Cowboy Junkies. Trinity Sessions, Iggy Pop. The Idiot. Lust For Life, Jim Carroll. Pools of Mercury, Bomb. Hate Fed Love, Rolling Stones. Exile on Main Street / Let It Bleed / Sticky Fingers, Roxy Music. For Your Pleasure / Country Life, Brian Eno. Here Come The Warm Jets, Tom Waits. Swordfishtrombones, Bob Dylan. Bringing It All Back Home, Nirvana. Unplugged, Beatles. Revolver, Alice Cooper. Killer, The Makers. Psychopathia Sexualis. , Bomb. Hits of Acid, Bomb. Lovesucker, Bomb. Hate Fed Love, Most Led Zeppelin, Most Nick Cave, Most Birthday Party, Leonard Cohen. Greatest Hits, Leonard Cohen. I'm Your Man, Rancid. Out Come The Wolves, Minor Threat. The CD with all their songs, Brian Eno. Taking Tiger Mountain (By Strategy) , Nirvana. Nevermind, First five Black Sabbath records, The Bob Dylan &quot;It's Alright Ma, I'm Only Bleeding&quot; and &quot;Positively 4th Street&quot;, Police. Synchronicity, Alice Cooper. Billion Dollar Babies, Jethro Tull. Aqualung, Dead Kennedys. Fresh Fruit for Rotting Vegetables, Pink Floyd. Animals, and &quot;I'm Afraid of Americans&quot;, David Bowie, remix by Trent Reznor.\n\nKeywords: Mature hot suburban swingers. Edge play, ultra bondage, slutty slapping, medical play, MFF moresome MP3, Spiritual sex, Free bondage sex, Audio whores, threesome, anal 3some, MP3 slaves, Bi-curious\n------\n&quot;Submission and Coffee&quot; BDSM podcast    &lt;a href=&quot;\nhttp://www.askdollie.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.askdollie.com&lt;/a&gt;","torrent":{"xt":"urn:btih:4365a8133cc00071bd5e62acbe4946a57f9feed0","amp;dn":"BDSM+-++EVERYTHING%5C%27S+FIXED+AND+EVERYONE+LIES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4365a8133cc00071bd5e62acbe4946a57f9feed0","infoHashBuffer":{"type":"Buffer","data":[67,101,168,19,60,192,0,113,189,94,98,172,190,73,70,165,127,159,238,208]},"announce":[],"urlList":[]}}