{"title":"Defending the Godhead - Vance Ferrell","uid":11773478,"size":1357196,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:440f15b2a0790346cf6c3ecba945659c489a5efd&amp;dn=Defending+the+Godhead+-+Vance+Ferrell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427169081,"description":"\nHERE ARE THE FACTS ABOUT THE TRUE GODHEAD\n1 - The Bible and Spirit of Prophecy do not teach the error of the Trinity; instead they teach the truth about the Godhead. A large number of Inspired statements are quoted.\nIncluded here are 511 Bible quotations or references and 120 Spirit of Prophecy quotations?over 631 in all?which prove the divinity and eternity of Christ and the Godhood of the Holy Spirit.\n2 - Nearly all the errors about the Godhead, and its members, occur when people confuse Their work with Their nature. You will here learn how to avoid this error.\n3 - Our pioneers wrote against the Catholic teaching, called the Trinity. We also reject that error. Eleven pioneer statements are quoted, showing exactly what it was that they were rejecting.\n4 - The Roman Catholic Trinity teaching is unbiblical, weird, and dishonoring to the Deity. Yet it has been adopted by most modern Protestant churches. Twenty-one official Catholic statements are quoted, showing what they actually teach.\n5 - Spiritualists, Islam, and many cults also deny the divinity of Christ and the Holy Spirit. Forty-eight of their official statements are quoted.\n6 - A large amount of additional information is also included. This is the most complete defense of the Godhead available anywhere.\n\n\nAbout the author:\nVance Ferrell was raised in San Francisco, Calif. He has been a very studious man who had 22 yrs of formal education. He received a BA in 1955 from Pacific Union College (Angwin, Calif.). 1965 he received a MA from the Potomac University in (Washington DC). In 1958 he received a BD from Andrews University (Berrien Springs, Mich.). Throughout the years Vance Ferrell has been in love with his Creator and compelled to defend a loving Heavenly Father. Vance Ferrell has spent much time doing extensive research in the fields of botany, biology, geology and other sciences","torrent":{"xt":"urn:btih:440f15b2a0790346cf6c3ecba945659c489a5efd","amp;dn":"Defending+the+Godhead+-+Vance+Ferrell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"440f15b2a0790346cf6c3ecba945659c489a5efd","infoHashBuffer":{"type":"Buffer","data":[68,15,21,178,160,121,3,70,207,108,62,203,169,69,101,156,72,154,94,253]},"announce":[],"urlList":[]}}