{"title":"Mitski - 2016-03-16 SXSW, Austin, TX 720p","uid":14272286,"size":513213975,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:448327dbd8c9c2eff739572c3ae3008e66e9eb7e&amp;dn=Mitski+-+2016-03-16+SXSW%2C+Austin%2C+TX+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GRNS3","files":3,"time":1460323586,"description":"Here is a nice webcast. Check my account for more classic webcasts.\r\n\r\nPlease enjoy, share with friends and please seed :)\r\n\r\n\r\nMitski\r\nSXSW\r\nNPR Music Showcase\r\nStubb's\r\nAustin, Texas\r\nMarch 16, 2016\r\n\r\nLineage: Webcast -&gt; DownThemAll -&gt; .mp4 -&gt; mkvmerge GUI -&gt; .mkv (no transcoding)\r\nVideo: MPEG4 Video (H264) 1280x720 16:9 2025 Kbps 24.00 fps\r\nAudio: AAC 320 Kbps 48.0 KHz stereo \r\n\r\nWe have the benefit of hindsight when it comes to 1950s and '60s pop music. Songs about motorcycle crashes and broken hearts sound quaint now, but the sweet harmonies and four-on-the-floor beats reflected real anxietiesof  teens and twentysomethings. Mitski Miyawaki  who records under her first name  makes music that looks to that era, both in style and substance. The 25-year-old Brooklyn songwriter channels the &quot;pop&quot; reflection of everyday trauma. \r\nThis is realness, often riddled with feedback, but more often sung in quiet and determined desperation. This is why when she played our SXSW showcase, you could be forgiven in thinking that her songs about loss, heartbreak, aimlessness and identity carry a dark weight. Largely culling from 2014's 'Bury Me At Makeout Creek', Mitski's set was spare in its instrumentation, but cavernous in emotion. &quot;Townie&quot;, the particularly doomy &quot;I Don't Smoke&quot; and the feedback-squealing closer &quot;Drunk Walk Home&quot; derailed into fuzz and wild vocal acrobatics, while &quot;First Love&quot; felt like a bedroom confessional. But Mitski also performed two songs from the forthcoming 'Puberty 2', a record that opens up her sonic and lyrical palette. &quot;Once More to See You&quot;, getting a first taste here, is like something out of a cloudy dream, with a space between guitar notes that's deliberate, yet disorienting. Mitski lets her voice breathe through the pauses like a lounge singer left alone in a velvet room. When she spoke with NPR about &quot;Your Best American Girl,&quot; she said, &quot;I am half Japanese, and it came from wanting to just fit into this very American person's life and simply not being able to.&quot; In Austin, it's a scorcher, riddled with sludgy distortion and crashing cymbals as if someone set off fireworks just above the stage!\r\n\r\nSetlist:\r\nTownie\r\nFirst Love\r\nI Want You\r\nFrancis Forever\r\nI Don't Smoke\r\nOnce More To See You\r\nYour Best American Girl\r\nI Will\r\nDrunk Walk Home\r\n\r\nTRT = 00:29:10","torrent":{"xt":"urn:btih:448327dbd8c9c2eff739572c3ae3008e66e9eb7e","amp;dn":"Mitski+-+2016-03-16+SXSW%2C+Austin%2C+TX+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"448327dbd8c9c2eff739572c3ae3008e66e9eb7e","infoHashBuffer":{"type":"Buffer","data":[68,131,39,219,216,201,194,239,247,57,87,44,58,227,0,142,102,233,235,126]},"announce":[],"urlList":[]}}