{"title":"Prince - 1999 The Vault... Old Friends 4 Sale (FLAC)","uid":14402081,"size":318978925,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:44ae010776f37e15026a005cca6944447270b999&amp;dn=Prince+-+1999+The+Vault...+Old+Friends+4+Sale+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"homelighter","files":25,"time":1461379801,"description":"Prince - 1999 The Vault... Old Friends 4 Sale (FLAC)\r\n\r\nArtist: Prince\r\nTitle: The Vault... Old Friends 4 Sale\r\nYear of Release: 1999 (Warner Bros W2 47522)\r\nGenre: Jazz-Funk, Soul\r\nFormat: FLAC\r\n\r\nUpon leaving Warner Brothers in 1996, Prince agreed to let the label release a collection of unreleased recordings from his legendary prodigious vaults at some point in the future. Warner unveiled that collection, unimaginatively titled The Vault: Old Friends 4 Sale, in the summer of 1999. Instead of an official release for several of Prince's legendary songs though, The Vault is a brief collection (under 40 minutes) of ten songs recorded between 1985 and 1994 according to the liner notes -- though they all feel like Graffiti Bridge (or maybe Symbol) outtakes. That's not a complaint actually. There's a wonderful carefree feeling to the record, heavy on jazz and light funk, constantly swinging and nearly always engaging. Only the title track has the necessary weight to announce itself as a major addition to his official catalog but that doesn't matter since the songs are all enjoyable. After all it's hard not to be impressed with Prince's songcraft or the casually sophisticated flair to the musicianship throughout the album. That might not be what most observers expected from The Vault but consider this -- of these ten songs, eight tracks have never been heavily bootlegged before. That means that even some hardcore followers may not have heard all of this material which is noteworthy in itself. But the nicest thing about the compilation is that even though it's a minor addition to his catalog it holds together as an album better than Come or Chaos &amp; Disorder, the two other Warner-era odds-and-ends collections or even the tossed-off New Power Soul. It's an unassuming, jazzy little record that's damn near irresistible.\r\n\r\n\r\nTrack List:\r\n1. The Rest Of My Life\r\n2. It's About That Walk\r\n3. She Spoke 2 Me (Extended Remix)\r\n4. 5 Women\r\n5. When The Lights Go Down\r\n6. My Little Pill\r\n7. There Is Lonely\r\n8. Old Friends 4 Sale\r\n9. Sarah\r\n10. Extraordinary","torrent":{"xt":"urn:btih:44ae010776f37e15026a005cca6944447270b999","amp;dn":"Prince+-+1999+The+Vault...+Old+Friends+4+Sale+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44ae010776f37e15026a005cca6944447270b999","infoHashBuffer":{"type":"Buffer","data":[68,174,1,7,118,243,126,21,2,106,0,92,202,105,68,68,114,112,185,153]},"announce":[],"urlList":[]}}