{"title":"Wiley.Professional.NFC.Application.Development.for.Android.May.2","uid":8857117,"size":14070651,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:451d625c9ee970749f65265af75273d988352228&amp;dn=Wiley.Professional.NFC.Application.Development.for.Android.May.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"poohtbear","files":1,"time":1377688439,"description":" &lt;a href=&quot;http://www.wrox.com/WileyCDA/WroxTitle/Professional-NFC-Application-Development-for-Android.productCd-1118380096.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.wrox.com/WileyCDA/WroxTitle/Professional-NFC-Application-Development-for-Android.productCd-1118380096.html&lt;/a&gt;\n\nA practical guide to developing and deploying Near Field Communication (NFC) applications\n\nThere has been little practical guidance available on NFC programming, until now. If you're a programmer or developer, get this unique and detailed book and start creating apps for this exciting technology. NFC enables contactless mobile communication between two NFC-compatible devices. It's what allows customers to pay for purchases by swiping their smartphones with Google Wallet, for example. This book shows you how to develop NFC applications for Android, for all NFC operating modes: reader/writer, peer-to-peer, and card emulation.\n\nThe book starts with the basics of NFC technology, an overview of the Android OS, and what you need to know about the SDK tools. It then walks you through all aspects of NFC app development, including SE programming. You'll find all you need to create an app, including functioning, downloadable code and a companion website with additional content. Valuable case studies help you understand each operating mode in clear, practical detail.\n\nShows programmers and developers how to develop Near Field Communication (NFC) applications for Android, including Secure Element (SE) programming\nExpert authors are NFC researchers who have a deep knowledge of the subject\nCovers app development in all NFC operating modes: reader/writer, peer-to-peer, and card emulation\nIncludes valuable case studies that showcase several system design and analysis methods, such as activity diagram, class diagram, UML, and others\nProfessional NFC Application Development for Android offers the clear, concise advice you need to create great applications for this emerging and exciting technology.","torrent":{"xt":"urn:btih:451d625c9ee970749f65265af75273d988352228","amp;dn":"Wiley.Professional.NFC.Application.Development.for.Android.May.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"451d625c9ee970749f65265af75273d988352228","infoHashBuffer":{"type":"Buffer","data":[69,29,98,92,158,233,112,116,159,101,38,90,247,82,115,217,136,53,34,40]},"announce":[],"urlList":[]}}