{"title":"Sexually Broken--Deepthroat expert Lotus Lain bent over a box, s","uid":10420001,"size":862559984,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:45d598feaa13a3570494681b6d8315752ca30c3e&amp;dn=Sexually+Broken--Deepthroat+expert+Lotus+Lain+bent+over+a+box%2C+s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1403636530,"description":"\nDeepthroat expert Lotus Lain bent over a box, sucks and fucks hard cock, multiple orgasms! | Lotus Lain | Matt Williams \n\nJune 23, 2014\n\n\nHigh Bitrate MP4 only.\n\n\nWhat is better then one hot bitch? How about 2 hot bitches? Lotus Lain is a sexy piece of ass. She got into the industry to have better access to the top shelf cock she so deeply craves and brings with her an honest eager enthusiasm. This is not a pretty face just coasting though for a paycheck, she LOVES what she does and can deep throat with the best of them. She has come to the right place, here at Sexuallybroken we deliver the most hardcore deep throat out there. And today is going to be a little special, as we have not one but two play toys.\n\nWe start out with Lotus Lain bent over and shackled down to a fuck box that doubles as a cage. The position perfectly displays her flawless ass and leaves both ends exposed and open for the dick. Handcuffs shackle down her limbs. That is all it takes to render her completely fucked. This bitch is going nowhere. As an added bonus, we have a back up bitch in the box. When we tire of the one we have now, we can swap her out for a fresh one.\n\nBondage, hard dick and multiple orgasms are the key to take apart any sub. And here at Sexuallybroken we have all the keys. What follows is a furious overload of sensation. Back and forth, both holes, used hard and deep at our whim. All the while, Darling watches in her cage, listening to the moans and feeling the box shake with each thrust. The cock plows her pussy and then comes around to make Lotus lick her own juices off. The cock owns her face, sliding down balls deep and conquering her throat. Lotus is blasted into another dimension. You can see her face shift as she loses her grip and submits to the sensation.\n\nNot content, we overload her with orgasms on her sensitive well fucked pussy. She can not escape or refuse the vibrator as it rips orgasm after orgasm out of her cunt. Lotus's shrieks echo in Darling's ears as she awaits her fate. We leave Lotus a drained and wrecked puddle of porn star flesh draped over the fuck box, held up only by her shackles. Darling, you are up next... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_23llain3/SexuallyBroken-Lotus-Lain-Matt-Williams-Deepthroat-expert-Lotus-Lain-bent-over-a-box-sucks-and-fucks-hard-cock-multiple-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_23llain3/SexuallyBroken-Lotus-Lain-Matt-Williams-Deepthroat-expert-Lotus-Lain-bent-over-a-box-sucks-and-fucks-hard-cock-multiple-orgasms.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:45d598feaa13a3570494681b6d8315752ca30c3e","amp;dn":"Sexually+Broken--Deepthroat+expert+Lotus+Lain+bent+over+a+box%2C+s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45d598feaa13a3570494681b6d8315752ca30c3e","infoHashBuffer":{"type":"Buffer","data":[69,213,152,254,170,19,163,87,4,148,104,27,109,131,21,117,44,163,12,62]},"announce":[],"urlList":[]}}