{"title":"Poke That Tranny In The Fanny Vol. 2 XXX 2015 WEB-DL","uid":12237603,"size":5802955353,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4689b9ef4eae6ccf55159633499ad7c570f044ee&amp;dn=Poke+That+Tranny+In+The+Fanny+Vol.+2+XXX+2015+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Ctrlme","files":4,"time":1439693795,"description":"Poke That Tranny In The Fanny Vol. 2 XXX 2015 WEB-DL\n\nScreenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/N24&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N24&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2J&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2J&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2K&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2K&lt;/a&gt;\n\nDescription: The first scene begins with Chad Diamond introducing his new babysitter Natassia Dreams to his home. He starts making advances on her, but she's not comfortable with it since he's married and tells him off, but then her language gets more and more seductive and shortly after, she's inviting him to suck on her tits. Then she goes down on him and he returns the favor. They 69 for a bit and then she takes him in doggy style, on her back, and reverse cowgirl. Then she fucks him doggy style and on his back. Then she pulls out and he busts on her tits. Next up, Smith and Amy Daly are at a brothel and after he talks down her price, the fun begins. Amy blows him, and then he goes down on her. Then Smith fucks her on her back and then Amy hops on his cock cowgirl. Then they switch to doggy and Smith finishes by jerking off while laying on the bed and Amy rubs her face all over his cock. Following that, we see Smith and Gaby, his babysitter chatting on the couch. Smith has been having an affair with her, but she wants more and threatens to leave if he doesn't leave his wife for her. She pulls out her cock to show him what he'll be missing and he starts blowing her. She blows him a bit and then they 69. After a bit, she hops on him reverse cowgirl and then she takes him in doggy style. Then she fucks him doggy style and on his back while he strokes himself. They switch roles and he fucks Gaby on her back while she strokes her cock fast until she cums. Next scene we see Smith in a ref uniform reading on the couch. Venus Lux a cheerleader comes in and he lets her know she's not supposed to be in the ref's lounge. He figures out that the coach sent her to try and persuade him to favor their team. Not too long after, she's on the couch making out with Smith. She starts blowing him and then he blows her. They 69 and then Venus fucks him doggy style after a bit, Smith fucks her on her back then she hops on his dick reverse cowgirl. They switch roles again and Venus fucks him on his back while he strokes himself. He cums and then Venus adds to the load with a bigger cumshot. Next scene begins with Christian in a car chatting on the phone with his wife. She's frantic because she just learned that their babysitter Angelina Torres has a cock. Christian's wife took the kids to the inlaws and Christian went to the home to confirm her claims. Christian asks Angelina and she drops trou to reveal her dainty cock. They begin making out and then Angelina begins blowing him. She lays on the couch and Christian goes down on her and after rimming fucks her, then side by side and doggy. They take a break from fucking and Angelina blows him some more, then she hops on his dick cowgirl, switches to reverse cowgirl, and then the scene finishes with Christian dropping a load in her mouth. The next scene opens with Smith and Jane Marie chatting after a bit of chat, Smith starts sucking on her tits and then she starts blowing him. Smith returns the favor and then she hops on his cock reverse cowgirl. Then they switch to doggy, on her back while he strokes her thick cock and even sucks it off a bit while fucking. Then she hops on his dick cowgirl and it finishes with Smith stroking himself to orgasm while Jane licks all over his cock. The next scene opens with Nelly in rainbow striped thigh high socks, a matching bra, and pink fishnet top, and a white five inch mini skirt. She walks up to Smith at his home and after confirming that his wife won't be in the way, they start to play. He starts by sucking on her tits and sucking her cock. She blows him a bit and then they 69. Then she hops on his cock cowgirl, and then he fucks her on her back, prone, and reverse cowgirl. Then they sit so their cocks are standing next to each other and Smith jerks them both off at the same time. Then Natalie strokes her own cock until she comes and then Smith jerks himself off as she rubs her lips all over his cock and he comes. The last scene begins with Nody Nadia smoking outside a building. Smith rolls up in his ride and picks her up and takes her back to this warehouse where he has a little bed set up. He blows her then she goes down on him. They 69 and he rims her too. Then she hops on his dick reverse cowgirl, and then takes him in doggy style, on her back, cowgirl, doggy again, and while they lay side by side. The scene finishes with Smith stroking himself to completion while she licks his balls and cock.\n\nLength: 3:48:54\n\nScene 1: Natassia Dreams\nScene 2: Amy Daly\nScene 3: Gaby\nScene 4: Venus Lux\nScene 5: Angelina Torres\nScene 6: Jane Marie\nScene 7: Nelly\nScene 8: Nody Nadia\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n\n               If you like this torrent, please post a comment!\n            \n                            Don't forget to seed!\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-Ctrlme&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-Ctrlme&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Ctrlme/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Ctrlme/&lt;/a&gt;","torrent":{"xt":"urn:btih:4689b9ef4eae6ccf55159633499ad7c570f044ee","amp;dn":"Poke+That+Tranny+In+The+Fanny+Vol.+2+XXX+2015+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4689b9ef4eae6ccf55159633499ad7c570f044ee","infoHashBuffer":{"type":"Buffer","data":[70,137,185,239,78,174,108,207,85,21,150,51,73,154,215,197,112,240,68,238]},"announce":[],"urlList":[]}}