{"title":"Anlat.Istanbul.2005.DVDRip.XviD-TURKiSO","uid":5287454,"size":728928805,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:46d2ab118fd3b9299495aa95f572743d584eb1a3&amp;dn=Anlat.Istanbul.2005.DVDRip.XviD-TURKiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"noriegaRJ","files":-1,"time":1263767485,"description":"Title: Anlat Istanbul aka Istanbul Tales \nYear: 2005\nCountry: Turkey\nAudio: Turkish\nSource: DVDRIP\nSize: 695 MB \nGenre: Drama\nRuntime: 99 min \nVideo Codec: XVID\nAudio Codec: MP3\nIMDB Note: 7.6\nIMDB Link: http://www.imdb.com/title/tt0421625/\nDirected by: Umit Unal, Kudret Sabanci, Selim Demirdelen, Yucel Yolcu, Omur Atay\nStarring: \nPIED PIPER: Altan Erkekli, Ozgu Namal, Mehmet Gunsur, Erkan Can  \nSHOW WHITE: Azra Akin, Cetin Tekindor, Vahide Gordum, Nejat Isler, Hilal Aslan\nCINDERELLA: Yelda Reynaud, Sevket Coruh, Guven Kirac, Ismail Hacioglu, Selen Ucer, Hasibe Eren\nSLEEPING BEAUTY: Nurgul Yesilcay, Selim Akgul, Erdem Akakce\nLITTLE RED RIDING HOOD: Idil Uner, Fikret Kuskan, Ahmet M. Taylan, Ece Hakim  \n\nSynopis: &quot;Deftly interweaving five contempo vignettes with fairy tale flavors, slick criss-crosser &quot;Istanbul Tales&quot; is both a compulsively watchable entertainment as well as an atmospheric love letter to one of the world's most beautiful cities. Long-gestated project by writer Umit Unal, who finally shared helming chores with four others ... Though the directors basically worked on individual stories, there's so much overlap between them -- on both dramatic and editing levels -- and the styles are so undifferentiated that the finished film looks like the work of a single helmer. Unal, who labored over the script for several years, says he finally invited others to share direction simply to give the movie a sustained sense of energy. \n\nAging clarinetist Hilmi (Altan Erkekli) has a much younger wife, Senay (Ozgu Namal), who has a lover, photo shop owner Rifki (Mehmet Gunsur). However, before its resolution, another tale starts, which runs like a backbone through the movie's fabric: the shooting in a restaurant of underworld king Ihsan (Cetin Tekindor) by an unseen assassin. The hit was planned by Ihsan's right-hand man, Ramazan (Nejat Isler), and power-hungry wife, Hurrem (Vahide Gordum), who now orders Ramazan to dispose of her stepdaughter, Idil (Azra Akin). This doesn't go as planned, and incidents en route set up refs that are clarified as the other yarns unspool. Also in the mix: love at first sight between a female transsexual, Banu (Yelda Reynaud), and a younger guy, Fiko (Ismail Hacioglu); Banu's friendship with Mimi (Guven Kirac), a sweet old transvestite; a Kurdish peasant from the provinces, Musa (Selim Akgul), who gets a job at the eatery where Ihsan will be shot, and meanwhile stumbles across a beautiful but loony princess, Saliha (former Miss Turkey, Nurgul Yesilcay). (5th Annual Boston Turkish Film and Music Festival - 2006)\n\n\nTHIS TORRENT HAS SUBTITLES IN ENGLISH AND BRAZILIAN PORTUGUESE.\n\n\nThanks to those helping me seed. Leechers remember, the community depends on you. If nobody shares, the freebies go away. Remember, the only reason you can download this free movie is because others are generous enough to keep sharing it with you. If nobody shares, everybody loses, so even if its for an extra hour or two after you get it, remember, others want to see it too, and they can't without you.\n\n\nSEE MY OTHERS UPLOADS:                      &lt;a href=&quot;\nhttp://thepiratebay.se/user/noriegaRJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/noriegaRJ&lt;/a&gt;\n","torrent":{"xt":"urn:btih:46d2ab118fd3b9299495aa95f572743d584eb1a3","amp;dn":"Anlat.Istanbul.2005.DVDRip.XviD-TURKiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46d2ab118fd3b9299495aa95f572743d584eb1a3","infoHashBuffer":{"type":"Buffer","data":[70,210,171,17,143,211,185,41,148,149,170,149,245,114,116,61,88,78,177,163]},"announce":[],"urlList":[]}}