{"title":"Lisa Jewell-Before I Met You","uid":10634789,"size":325046376,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:470efbb17be3353b534232fa901626e12dadbc60&amp;dn=Lisa+Jewell-Before+I+Met+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"twocows","files":63,"time":1406333087,"description":"\nFresh out of university, Betty is ready to begin a new chapter of her life in London-- one she hopes brings new friends, a big career break, and perhaps even true love. Following her dreams in bustling, grungy nineties Soho, she' s ready for whatever life has to throw at her. Or so she thinks In 1920s bohemian London, Arlette-- Betty' s grandmother-- is starting her new life in a time of post-war change. Beautiful and charismatic, Arlette is soon drawn into the hedonistic world of the Bright Young People. But two years after her arrival in London, tragedy strikes and she flees back to the country for the rest of her life. As Betty tries to manage the ups and downs of adulthood, she' s distracted by a mysterious letter she finds after Arlette' s death-- a letter written to a man Betty has never heard of but who meant the world to her grandmother. Will the secrets of Arlette' s past help Betty navigate her own path to happiness? A heartwarming detective story and a captivating look at London then and now, Before I Met You is an unforgettable story about two very different women, separated by seventy years, but linked by a shared determination to make their dreams come true.\n","torrent":{"xt":"urn:btih:470efbb17be3353b534232fa901626e12dadbc60","amp;dn":"Lisa+Jewell-Before+I+Met+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"470efbb17be3353b534232fa901626e12dadbc60","infoHashBuffer":{"type":"Buffer","data":[71,14,251,177,123,227,53,59,83,66,50,250,144,22,38,225,45,173,188,96]},"announce":[],"urlList":[]}}