{"title":"X-Men:  Legacy  (Complete)  (No Ads)","uid":7779620,"size":1470568799,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:472402c74fa7b083ee0c3d818eef3787c994afee&amp;dn=X-Men%3A++Legacy++%28Complete%29++%28No+Ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1351745615,"description":"X-Men:  Legacy is a comic book series published by Marvel Comics featuring the mutant superhero team, the X-Men.\n\nThe title began its publication in October, 1991 as X-Men.  From 2001-2004 it was published as New X-Men.  It had reverted (as of issue 157) to its original title, but changed again (from issue 208) to X-Men:  Legacy.  It is usually referred to as X-Men, Volume 2 because the first series, currently Uncanny X-Men, was titled The X-Men, prior to 1981.\n\nThe retitled series follows on from the conclusion of the Messiah Complex crossover, where Professor X was accidentally shot in the head by Bishop.  Shortly after the X-Men presumed him deceased, his body disappeared and his whereabouts were unknown.  X-Men:  Legacy initially followed the Professor's presumed road to recovery as well as the encounters he faced, such as a battle with the mutant Exodus on the psychic plane, and discoveries about his past that include Mr. Sinister.\n\nMany characters have been featured in the title, including Rogue, Magneto, Gambit, and the Acolytes.  The title also featured flashbacks relevant to the ongoing present story as well as answered dangling plot lines throughout X-Men continuity. \n\nAs of issue 226, Rogue replaced Professor Xavier as the central character, having now achieved control over her absorption powers.  Scott Summers (aka Cyclops) has repositioned Rogue as mentor to the younger mutants under the protection of the X-Men on Utopia.  Rogue is in the unique position to be able to help the students, due to her abilities, allowing fresh insight to their use and control.  She has faced off against notable deadly adversaries including:  Emplate and Proteus.  She also took part in the X-Men:  Second Coming crossover, acknowledging her special link to Hope.\n\nThe title was one of two ongoing books to house the Age Of X crossover.  The comic briefly followed the fallout from that story and featured a team composed of Rogue, Magneto, Gambit, Professor X, Legion, and Frenzy, but now follows Rogue's team of X-Men affiliated with the Jean Grey School For Higher Learning, featuring Gambit, Frenzy, Cannonball and Rachel Grey.\n\nDuring the Marvel NOW! event, issue 275 of X-Men:  Legacy has been announced as the final issue.  The name X-Men Legacy will be re-used to launch a new series with a new first issue, written by Simon Spurrier and pencilled by Tan Eng Huat.  This new series will focus on Legion.\n\nFor your downloading and perusing pleasures, I have inclueded ALL issues in this torrent.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and of course the authors, artists and publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:472402c74fa7b083ee0c3d818eef3787c994afee","amp;dn":"X-Men%3A++Legacy++%28Complete%29++%28No+Ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"472402c74fa7b083ee0c3d818eef3787c994afee","infoHashBuffer":{"type":"Buffer","data":[71,36,2,199,79,167,176,131,238,12,61,129,142,239,55,135,201,148,175,238]},"announce":[],"urlList":[]}}