{"title":"Reverend Peyton's Big Damn Band - 2011 - Peyton On Patton FLAC","uid":8467493,"size":229754635,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:477186372bc1552a90c10ff1a63b004b7661ab8e&amp;dn=Reverend+Peyton%27s+Big+Damn+Band+-+2011+-+Peyton+On+Patton+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1368395274,"description":"Reverend Peyton's Big Damn Band - 2011 - Peyton On Patton\n\nReverend Peyton's Big Damn Band is a three-piece outfit that plays a combination of roots music and alternative country that is also heavily influenced by country blues. At its center is Josh Peyton (vocals, guitar), who grew up listening to his father's blues-rock albums. After receiving an electric guitar and amp when he was 13, Josh formed his first band with his brother Jayme Peyton on drums and a friend playing bass. A friend who recognized the blues influences in Josh's playing recommended that he study earlier blues artists, which in turn led to Josh's discovery of country blues. The young guitarist's career was nearly derailed, however, after a performance at his high-school graduation left his hands in extreme pain. Doctors who examined Josh diagnosed him with tendonitis and gave him a grim prognosis -- as a result, he abandoned music for a year before undergoing surgery to correct the problem. While recovering, Josh met Breezy, the woman who would become his wife. After comparing notes on musical influences, Breezy bought a washboard and began writing songs with Josh and Jayme. The trio began touring and eventually decided to make music a full-time endeavor. They released their first album, The Pork 'n' Beans Collection, in 2004. It was followed by albums released on a yearly basis, including The Big Damn Band Sampler in 2005, Big Damn Nation in 2006, and The Gospel Album in 2007. Wages appeared in 2010. With a wonderfully ragged and swampy deep Delta sound that kicked like a mule, the trio thankfully didn't deviate from that core sound on 2012's Between the Ditches, produced by Peyton and Paul Mahern. (AllMusic)\n\nTrack list:\n01. Jesus Is A Dying-Bed Maker\n02. Some Of These Days I'll Be Gone (Charley Version)\n03. Mississippi Boweavil Blues\n04. Elder Greene Blues\n05. Tom Rushen Blues\n06. Some Happy Day\n07. Some Of These Days I'll Be Gone (Banjo Version)\n08. Green River Blues\n09. Prayer Of Death Pt. 1\n10. A Spoonful Blues\n11. You're Gonna Need Someone (When You Come To Die)\n12. Shake It And Break It\n13. Some Of These Days I'll Be Gone (Rev. Peyton Slide Version)\n\nSplit with Medieval CUE Splitter. Sorry.\nEnjoy and share! ","torrent":{"xt":"urn:btih:477186372bc1552a90c10ff1a63b004b7661ab8e","amp;dn":"Reverend+Peyton%27s+Big+Damn+Band+-+2011+-+Peyton+On+Patton+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"477186372bc1552a90c10ff1a63b004b7661ab8e","infoHashBuffer":{"type":"Buffer","data":[71,113,134,55,43,193,85,42,144,193,15,241,166,59,0,75,118,97,171,142]},"announce":[],"urlList":[]}}