{"title":"Candy Stripers (2006)[DVDRIP]","uid":4158493,"size":740544704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:47fbab44a0c56c84823176ac7f915ba9057b8971&amp;dn=Candy+Stripers+%282006%29%5BDVDRIP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"circlensess","files":2,"time":1209258518,"description":"Sexy Killer [DVDRIP][Spanish][2007] Rated R for horror violence and gore, sexuality and some language.\n\nGenre: Horror / Sci-Fi more \nTagline: They&amp;#039;re running out of patients...\n\nPlot Summary: In a lonely road in Wucaipa, something attacks the driver of a car and her blind friend Tammy.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0463935/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0463935/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagehost.ro/pict/270157044813b340c2ea7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagehost.ro/pict/270157044813b340c2ea7.jpg&lt;/a&gt;\n\n\nCast (Cast overview, first billed only)\n         Scott Aaronson\t... \tCoach\n\tBrian Lloyd\t... \tMatt\n\tSarah McGuire\t... \tTammy (as Sarah Ball)\n\tBrianna Berman\t... \tVoluptuous Nurse #2\n\tDeanna Brooks\t... \tJanine\n\tRichard Burke\t... \tBo\n\tMonique Cooper\t... \tSue\n\tWilliam Edwards Jr.\t... \tJoey\n\tKevin Thomas Fee\t... \tBrian\n\tLeah Foster\t... \tGayle\n\tTerri Lynn Harris\t... \tDr. Webber\n\tPearl Anne Lopez\t... \tVoluptuous Nurse #1\n\tBarry J. Ratcliffe\t... \tDr. Dixon\n\tNicole Rayburn\t... \tKrystal\n\tGerald Brodin\t... \tRepairman (as Gerald Smith)\n\nmore\n\n\nNurse! I&amp;#039;ll need some of that sweet sugary medicine!, 12 December 2007\n\nAuthor: Coventry from the Draconian Swamp of Unholy Souls \n\nYou can derive a whole lot from a movie&amp;#039;s title as well as from the image displayed on the DVD-cover. If you&amp;#039;re going to complain about how terrible, amateurish and stupid THIS particular movie is, perhaps you should have thought about that before, for example when choosing to watch a movie that is called &quot;Candy Stripers&quot; and that cheerfully depicts three sexy nurses with half-rotten faces licking lollipops on the cover. Obviously this is a pretty insignificant and quite retarded B-movie, but it&amp;#039;s undeniably entertaining and at least it respects the good old principle of the three B&amp;#039;s. Blood, boobs and beast! There&amp;#039;s enough blood &amp; gore to fill a couple of buckets, boobs of the sexiest type of women (=nurses) and beast because the yummy girls are in fact malicious aliens. Slimy alien creatures invade a small American town&amp;#039;s hospital. What exactly their purpose is or why specifically they chose this offbeat location is apparently of no importance whatsoever. They exclusively prefer to use the bodies of attractive young candy striper nurses as hosts (hey, who can blame them?), force them to feed on sugary treats and transform them into even hotter &amp; sexier man-eaters. The girls then subsequently seduce the men in the hospital and unleash throbbing monster before the horny victims can unleash theirs. Among the endangered remaining humans trying to escape the hospital are a clique of teenage basketball players and their cheerleader girlfriends. Personally, I look at &quot;Candy Stripers&quot; as a cheesy and amusingly inept homage to silly B-movies of the 80&amp;#039;s. The main characters are all stereotypes, the script is incoherent as can be, the candy stripers are purely cast on their looks and may elements in the story don&amp;#039;t make the least bit of sense. The hospital, for example, had issues long before the aliens ever took over the place. The doctors were already sexist men that drink Schnapps during their shifts and the nursing staff has meetings about the outbreak of deadly viruses in the middle of the hall where patients and visitors can hear them. The teenage protagonists are all insufferable and you hope for them to die quick and painfully. Especially the main cheerleader is a true caricature. Nobody can be that vain and shallow! The concept of &quot;Candy Stripes&quot; has a lot in common with another recently released horror/comedy called &quot;Decoys&quot;. Both films are recommended, albeit very forgettable.\n\n\n\n","torrent":{"xt":"urn:btih:47fbab44a0c56c84823176ac7f915ba9057b8971","amp;dn":"Candy+Stripers+%282006%29%5BDVDRIP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47fbab44a0c56c84823176ac7f915ba9057b8971","infoHashBuffer":{"type":"Buffer","data":[71,251,171,68,160,197,108,132,130,49,118,172,127,145,91,169,5,123,137,113]},"announce":[],"urlList":[]}}