{"title":"Flush Decks and Four Pipes (Sea History).pdf","uid":13512998,"size":14807111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48629e081b890630acdbccbcf7edd729cadcad64&amp;dn=Flush+Decks+and+Four+Pipes+%28Sea+History%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1455303324,"description":"Flush Decks and Four Pipes\r\nUnited States Naval Institute | 1965 | English | 124 pages | PDF | 14 MB\r\n\r\nThe famous American flush-deck destroyer, that hardy and versatile class of ships which made its dramatic entrance on the stage of war in 1917 and remained active for more than three decades, is fully examined in this lavishly illustrated history by warship expert John Alden. Each page of text is accompanied by a full facing page of photographs. Drawing on a lifetime of study he presents a fascinating view of these unique destroyers, often called &quot;four pipers&quot; because of the four tall funnels most of them carried. Alden not only highlights the individual careers of many of the ships, but also traces the ways in which they were adapted to perform a variety of duties as the navy's needs changed. As escort ships in hunter-killer groups, minelayers, minesweepers of flying boats, they served in nearly every theatre of war in World War II. The fifty flush-deckers involved in President Roosevelt's &quot;destroyers for bases&quot; trade with Winston Churchill are examined and their service in other navies chronicled. In addition, the book includes a complete statistical summary of the destroyers. All 273 flush-deckers are listed by hull numbers and cross-indexed by name and number. Dates of commissioning and decommissioning, as well as final disposition, are given along with information about conversions, renamings, reclassifications, transfers to other countries, and citations awarded","torrent":{"xt":"urn:btih:48629e081b890630acdbccbcf7edd729cadcad64","amp;dn":"Flush+Decks+and+Four+Pipes+%28Sea+History%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48629e081b890630acdbccbcf7edd729cadcad64","infoHashBuffer":{"type":"Buffer","data":[72,98,158,8,27,137,6,48,172,219,204,188,247,237,215,41,202,220,173,100]},"announce":[],"urlList":[]}}