{"title":"Inside Rock Music - Vance Ferrell","uid":11773477,"size":953266,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49db9893dd1c6fc30bfedaf5dae534aea03b3cc7&amp;dn=+Inside+Rock+Music+-+Vance+Ferrell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427169050,"description":"\nWe are going to take you on stage - back stage - and into the lives of rockers. We will examine their lyrics - and how the captivating tonal elements in the music are fitted together. We will discover why rock music affects people so powerfully - and how it changes those who play it and listen to it.\n\nIn this book the reader is are taken on stage, back stage, and into the lives of rockers.\nWe examine their lyrics and how the captivating tonal elements in the music are fitted together.\nWe will discover why rock music affects people so powerfully and how it changes those who play it and listen to it.\nWe will learn what makes rock so captivating to senses and listen to men and women who tell how it changed their lives.\nWe will also discover how it originated 3,000 years ago and the purpose it has been used for ever since.\nWe will learn when and how it penetrated Christian churches and what was happened to them since.\nWe will read about how 280 rock stars died and what killed them.\nIt's all here . . . the whole story of Rock Music and related musical forms.\n\n\nAbout the author:\nVance Ferrell was raised in San Francisco, Calif. He has been a very studious man who had 22 yrs of formal education. He received a BA in 1955 from Pacific Union College (Angwin, Calif.). 1965 he received a MA from the Potomac University in (Washington DC). In 1958 he received a BD from Andrews University (Berrien Springs, Mich.). Throughout the years Vance Ferrell has been in love with his Creator and compelled to defend a loving Heavenly Father. Vance Ferrell has spent much time doing extensive research in the fields of botany, biology, geology and other sciences","torrent":{"xt":"urn:btih:49db9893dd1c6fc30bfedaf5dae534aea03b3cc7","amp;dn":"+Inside+Rock+Music+-+Vance+Ferrell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49db9893dd1c6fc30bfedaf5dae534aea03b3cc7","infoHashBuffer":{"type":"Buffer","data":[73,219,152,147,221,28,111,195,11,254,218,245,218,229,52,174,160,59,60,199]},"announce":[],"urlList":[]}}