{"title":"Democracy Now - 05 dec 2011","uid":6865951,"size":457160329,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4a5eaef5829454ea7c2f97cff50df47f5766296c&amp;dn=Democracy+Now+-+05+dec+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1323102393,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 05, 2011\n\n-  Global Emissions Climbed Record 5.9% in 2010\n-  Thousands Stage Climate Justice March at Durban Climate Talks\n-  Official Unemployment Rate Hits Lowest Mark Since March 2009\n-  Police Arrest 31 at Occupy D.C.\n-  Italy Austerity Measure Raises Retirement Age, Taxes\n-  Iran Claims Downing of U.S. Drone\n-  Thousands Protest U.S. Trade Deal in Seoul\n-  White House Renews Military Spending Bill Veto Threat Over Indefinite Detention\n-  Report: DEA Laundered Drug Money to Target Cartels\n-  Bradley Manning Attorneys Accuse U.S. of Withholding Key Evidence\n\n\nSpecial reports\n\n- Thousands March at U.N. Climate Summit in Durban to Demand Climate Justice\n\nWe are broadcasting this week from Durban, South Africa, where critical talks on fighting climate change have entered their second week. Key issues at the United Nations Climate Change Conference COP 17 remain unresolved, including the future of the Kyoto Protocol - the international treaty with enforceable provisions designed to limit greenhouse-gas emissions. Delegates are also debating how to form a green climate fund to support developing nations most affected by climate change. But we begin not inside the summit, but out in the streets of Durban, where thousands of people marched on Saturday calling for climate justice. &quot;We're here to send a solid, strong message, a simple message to the leaders and negotiators of the climate change conference that this is no time to play around,&quot; says award-winning Nigerian environmental activist Nnimmo Bassey. &quot;This is a time for real commitment to cut emissions and legally bind the agreement to cut emissions. The rich, polluting countries should understand that their inaction ... will destroy the planet ... We can't accept that.&quot;\n\n\n- Greenpeace Activists Detained After Risky Stunt Hanging Climate Change Banner Off Durban Hotel\n\nEnvironmental groups in Durban have staged a series of actions in recent days calling on world leaders to agree to a just climate change deal. Democracy Now! got an inside look at one action staged by Greenpeace to hang a banner off of a Durban hotel where a meeting of the World Business Council for Sustainable Development was taking place, bringing together representatives from a number of large corporations and delegates to the U.N. Climate Change Conference. The banner read: &quot;Listen to the people, not the polluters.&quot; &quot;Our goal today was to highlight how governments are being unduly influenced by a handful of evil corporations who returned to adversely influence the climate negotiations happening here in Durban,&quot; says Michael Baillie with Greenpeace Africa. &quot;They're holding climate hostage.&quot;\n\n\n- Greenpeace Leader Kumi Naidoo, From Anti-Apartheid Activist to Leading Voice for Climate Justice\n\nThe U.N. Climate Change Conference in Durban marks a homecoming for Greenpeace International Executive Director Kumi Naidoo. At the age of fourteen, Naidoo joined the anti-apartheid movement, and was soon forced to go underground after he was arrested for violating the apartheid government's state of emergency regulations. After nearly a year underground, he moved out of South Africa, not to return until after the release from prison of Nelson Mandela in 1990. We speak to Naidoo about the climate summit and the link between his anti-apartheid activism in the 1980s and his environmental work today. &quot;The problem is, the level of ambition and the level of urgency being exhibited in these talks do not match what the science is telling us to do,&quot; says Naidoo. &quot;We are seeing in Africa, in the Horn of Africa with the drought, the conflict in Darfur, the devastation that African women farmers are facing all over our continent, the climate change impact is taking lives right now. So in that context, we that there has to be a much greater sense of urgency to move the agenda forward.&quot;\n\n\n- The Road to Durban: Tracking Global Warming's Devastating Impact Across the African Continent\n\nFor more on the impact of climate change on the African continent and an update on the U.N. Climate Change Conference COP 17 talks, we're joined in Durban by John Vidal, environment editor for The Guardian. Vidal has just returned from a journey between Africa's two most industrialized countries - Egypt and South Africa. His route included one of Africa's poorest nations, Malawi - its newest, Southern Sudan - and its hungriest, Ethiopia. He visited some of the continent's most remote tribes in Uganda and Kenya, and coastal areas here in South Africa. For all of these countries, the stakes of what comes out of COP 17 are high. &quot;It was a terrifying journey of reality,&quot; says Vidal. &quot;Very little science has been done, but there is absolutely no doubt about the consequences - which are going to be very much hotter temperatures, making it almost impossible to live in many areas, huge effects on the poor people.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4a5eaef5829454ea7c2f97cff50df47f5766296c","amp;dn":"Democracy+Now+-+05+dec+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a5eaef5829454ea7c2f97cff50df47f5766296c","infoHashBuffer":{"type":"Buffer","data":[74,94,174,245,130,148,84,234,124,47,151,207,245,13,244,127,87,102,41,108]},"announce":[],"urlList":[]}}