{"title":"DC ENTERTAINMENT ESSENTIAL GRAPHIC NOVELS AND CHRONOLOGY 2013 (C","uid":8432422,"size":129400720,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4aaaf7afa2b8e4259967349c593536b5aa42f5b5&amp;dn=DC+ENTERTAINMENT+ESSENTIAL+GRAPHIC+NOVELS+AND+CHRONOLOGY+2013+%28C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"STFmaryville","files":-1,"time":1367532702,"description":"From Publishers Weekly:\n\nLooking to provide info to retailers, librarians, and consumers interested in its book-format comics, DC Comics is publishing the DC Entertainment Essential Graphic Novels and Chronology 2013, a 121-page reading guide and index to the publisher's extensive backlist of collected and original graphic novels. The guide will be released this month to stores in print and digital versions and will be available via the DC Comics Web site.\n\nDC executives John Cunningham and John Rood both cited the need to promote DC's backlist to the comics shop market (also known as the direct market), which is more focused than ever on book-format comics, as well as to the general book trade. &quot;We've never done this before and it's way overdue,&quot; Cunningham said. &quot;It's an imperative as our digital releases are bringing lapsed as well as longtime comics fans into stores.&quot;\n\nDC Entertainment Essential Graphic Novels and Chronology 2013 offers a detailed listing of the publisher's 25 most acclaimed graphic novels (&quot;The Essential 25&quot;), including Watchmen by Alan Moore and Dave Gibbons and Batman Year One by Frank Miller and David Maazacchelli; the trade paperbacks collecting the recent New 52 relaunch; graphic novels from DC's Vertigo imprint; and book series based on major characters such as Batman, Superman, and Wonder Woman. There are also lists of DC's children's books and books from major DC authors like Alan Moore and Grant Morrison. The guide even contains a suggested-reading sequence for its graphic novels and short plot summaries for the major entries.\n\nCompiling a backlist catalogue is routine for trade book publishers -- but not so for most comics publishers. Cunningham pointed out the ever-growing importance of the book trade to comics publishing. &quot;We follow every aspect of traditional book publishing,&quot; he said, adding, &quot;We have a library marketing specialist, we treat our collections as books, and we keep everything in print. This will really help consumers with our enormous backlist -- now about 1,800 titles.&quot;\n\nRood said that the guide will prove useful when Man of Steel, the new Superman film, is released this summer. &quot;This is just us listening constantly to retailers that want to know, 'Where do I start?'&quot; he said. Cunningham added, &quot;Booksellers and librarians have been clamoring for something like this. Our goal is to find as many avenues as we can to attract readers to our books.&quot;","torrent":{"xt":"urn:btih:4aaaf7afa2b8e4259967349c593536b5aa42f5b5","amp;dn":"DC+ENTERTAINMENT+ESSENTIAL+GRAPHIC+NOVELS+AND+CHRONOLOGY+2013+%28C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aaaf7afa2b8e4259967349c593536b5aa42f5b5","infoHashBuffer":{"type":"Buffer","data":[74,170,247,175,162,184,228,37,153,103,52,156,89,53,54,181,170,66,245,181]},"announce":[],"urlList":[]}}