{"title":"Silverbullit Discography 320kpbs","uid":10123549,"size":403923287,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4b717e56260881dc2906f2c2695c265e2b516aab&amp;dn=Silverbullit+Discography+320kpbs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"runksir","files":44,"time":1399721867,"description":"This torrent contains all three Silverbullit albums:\n\n1997: Silverbullit (with five bonus tracks)\n2001: Citizen Bird (with two bonus tracks)\n2004: Arclight\n\nIn 320 kpbs will all tags in order.\n\nThey formed in Gothenburg, Sweden in 1995. Their high energy rock 'n' roll along with the commanding voice and the unpredictable antics of frontman/singer Simon Ohlsson made many compare them to The Stooges and The Doors. The selftitled debut album came out in 1997 and they quickly got attention all over northern EUrope for their wreckless live shows.\n\nAfter much turmoil, the follow-up, Citizen Bird, was released in 2001. Gone was the all American Detroit-tinged boogie-fied r'n'r', replaced instead by influences from Spiritualized/Spacemen 3, The Velvet Underground, Suicide, D.A.F., Joy Division/New Order, krautrock and old school computer game music. Citizen Bird was recorded on and off for several years, in several different studios, and with six different drummers.\n\nTheir latest album, their masterpiece Arclight, came out in 2004. By far the best album released that year. On some days, I'm convinced it's the best album ever. Yes, ever. By anyone.\n\nEven darker, more ominous and more electronic than Citizen Bird, Arclight also drew heavily on the band's love for the shoegazing scene, whilst showing many new influences. Once Upon A Time proves you can make rock with a disco beat without sounding like Franz Ferdinand, and Seconds wouldn't have felt out of place on some of Depeche Mode's late 80's albums, like Black Celebration or Music For The Masses (in my head it's Martin Gore singing it, not Dave Gahan).\n\nThe songs were longer, more monotonous and with a sinister feel that's never in your face, it's all inbetween the lines. The lyrics are deliberately ambiguous, but leaves you with the feeling that something about this band is very, very wrong. They simply cannot be quite right in the head. Arclight is dark and bleak and disturbing and endlessly beautiful.","torrent":{"xt":"urn:btih:4b717e56260881dc2906f2c2695c265e2b516aab","amp;dn":"Silverbullit+Discography+320kpbs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b717e56260881dc2906f2c2695c265e2b516aab","infoHashBuffer":{"type":"Buffer","data":[75,113,126,86,38,8,129,220,41,6,242,194,105,92,38,94,43,81,106,171]},"announce":[],"urlList":[]}}