{"title":"Poke That Tranny In The Fanny Vol. 1 XXX 2015 WEB-DL","uid":12237601,"size":5841867291,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4ce7b9d12147dc2b7620c06cd9f7736b61812a0d&amp;dn=Poke+That+Tranny+In+The+Fanny+Vol.+1+XXX+2015+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Ctrlme","files":4,"time":1439693705,"description":"Poke That Tranny In The Fanny Vol. 1 XXX 2015 WEB-DL\n\nScreenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/N2S&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2S&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2f&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2f&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2o&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2o&lt;/a&gt;\n\nDescription: The first entry in the series begins with Christian looking for girls in an apartment until he comes across Khloe Hart in a jean jacket, a revealing skirt and knee high boots. Khloe shows off her body on the bed and Christian strips and begins making out with her and blowing her. Then she returns the favor and after a while, hops on him cowgirl. The Christian fucks her from behind while laying side by side as she strokes herself, then he fucks her on her back, doggy style, on her side and reverse cowgirl. Christian finishes with a nice facial while she strokes herself. Next up is Gianna Rivera who finds Christian in the shower. She's reluctant to stay there with Christian, but he insists, and after some making out she's well warmed up and ready to fuck. First she drops to her knees and blows him. Then after a bit, Christian pulls off her panties, rims her a bit and then fucks her while she has one leg up on the counter top. After that Christian blows her a bit and they leave the bathroom to the bedroom where they are making out more. On the bed, Christian fucks her from behind while laying beside her, then on her back, after getting blown a bit more, Christian fucks her cowgirl, reverse cowgirl, and comes in her mouth. Following that steamy performance is the beautiful and dark skinned Nody Nadia in a cheerleader outfit. She's a bit uncomfortable hanging out with Smith in his bedroom, but after some smooth talking, he has her on the bed with her titties out as he sucks on them and makes out with her. He blows her some and then fucks her on her back while she strokes herself. Then she hops on him reverse cowgirl. After a bit, she blows him some and then takes him in doggy style. Smith blows her some more and then lays on his back while she fucks him. The scene switches with the roles reversed and Nody orgasms and then Smith busts on her tits. In the next scene, Christian and Venus Lux are chatting on the couch. The conversation inevitably leads to making out, heavy petting and sex. Venus starts by blowing Christian and then he returns the favor. Then he fucks her doggy style, while laying side by side, reverse cowgirl, and then on her back. Then it switches and Venus fucks Christian on his back until he comes. Then Venus follows suit and comes all over Christian. The next scene opens with Kelly Clare trying to convince Wolf Hudson to fuck her. Surprise, surprise, she's successful. They make out some and do some heavy petting while they strip. Wolf blows her and then she blows him. Kelly sits on him and they make out some and then she lets Wolf slide his dick in her tight ass. Then they switch to Wolf fucking her on her back and then reverse cowgirl where she strokes herself until she comes. Then they switch to doggy style and Wolf finishes in her mouth. Next scene opens with Smith and Gabriel chatting. Smith hooks him up with a place where he can find gorgeous trans girls. Gabriel picks up Natalie Foxx. After paying dues, Gabriel starts blowing her, then she blows him, then they sixty-nine some. After oral, she hops on his cock cowgirl, then he fucks her side by side, on her back, doggy, and finishes with Natalie stroking him until he gives her a nice facial. In the next scene, Gabriel is in a suit and walks in with Amy Daly. He's distraught because his fraudulence finally caught up to him, his family is gone, and tomorrow he's going to the slammer. Amy is there to console him though and starts blowing him. Then Gabriel starts rimming Amy. After she's all wet and warmed up, she hops on his dick cowgirl, then reverse cowgirl, doggy, on her back and he finishes with a big smiley facial. The final scene opens with Gabriel doing an ad for his girls. He brings in Nelly Taylor as one of his prime examples. After a brief introduction, she starts blowing Gabriel. After a bit, Gabriel starts fingering and rimming her. After a little warm up, he starts blowing her too. Then he fucks her doggy style, reverse cowgirl, doggy, on her back, and finishes with a good facial.\n\nLength: 3:51:50\n\nScene 1: Khloe Hart\nScene 2: Gianna Rivera\nScene 3: Nody Nadia\nScene 4: Venus Lux\nScene 5: Kelly Clare\nScene 6: Natalie Foxx\nScene 7: Amy Daly\nScene 8: Nelly Taylor\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n\n               If you like this torrent, please post a comment!\n            \n                            Don't forget to seed!\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-Ctrlme&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-Ctrlme&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Ctrlme/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Ctrlme/&lt;/a&gt;","torrent":{"xt":"urn:btih:4ce7b9d12147dc2b7620c06cd9f7736b61812a0d","amp;dn":"Poke+That+Tranny+In+The+Fanny+Vol.+1+XXX+2015+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ce7b9d12147dc2b7620c06cd9f7736b61812a0d","infoHashBuffer":{"type":"Buffer","data":[76,231,185,209,33,71,220,43,118,32,192,108,217,247,115,107,97,129,42,13]},"announce":[],"urlList":[]}}