{"title":"Crime and Punishment","uid":7229216,"size":731940864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4dfcafff5b70536b85e0e06abf06b03bf84fd9bb&amp;dn=Crime+and+Punishment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AnthonyCaptain","files":1,"time":1335780847,"description":"Raskolnikov, a conflicted former student, lives in a tiny, rented room in Saint Petersburg. He refuses all help, even from his friend Razumikhin, and devises a plan to murder and to rob an unpleasant elderly pawn-broker and money-lender, Alyona Ivanovna. His motivation comes from the overwhelming sense that he is predetermined to kill the old woman by some power outside of himself. While still considering the plan, Raskolnikov makes the acquaintance of Semyon Zakharovich Marmeladov, a drunkard who recently squandered his family's little wealth. He also receives a letter from his sister and mother, speaking of their coming visit to Saint Petersburg, and his sister's sudden marriage plans which they plan on discussing upon their arrival.\n\nAfter much deliberation, Raskolnikov sneaks into Alyona Ivanovna's apartment where he murders her with an axe. He also kills her half-sister, Lizaveta, who happens to stumble upon the scene of the crime. Shaken by his actions, Raskolnikov manages to only steal a handful of items and a small purse, leaving much of the pawn-broker's wealth untouched. Raskolnikov then flees and, due to a series of coincidences, manages to leave unseen and undetected.","torrent":{"xt":"urn:btih:4dfcafff5b70536b85e0e06abf06b03bf84fd9bb","amp;dn":"Crime+and+Punishment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dfcafff5b70536b85e0e06abf06b03bf84fd9bb","infoHashBuffer":{"type":"Buffer","data":[77,252,175,255,91,112,83,107,133,224,224,106,191,6,176,59,248,79,217,187]},"announce":[],"urlList":[]}}