{"title":"John Mayall &amp; the Bluesbreakers - Live in German DVDR NLT-Releas","uid":6363171,"size":564910489,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4f6832abbb1f18989cffd35b7831326432c4ebe6&amp;dn=John+Mayall+%26+the+Bluesbreakers+-+Live+in+German+DVDR+NLT-Releas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"luiehond69","files":-1,"time":1304415907,"description":"John Mayall &amp; the Bluesbreakers - Live in German DVDR NLT-Release (Divx)\n\n\nJohn Mayall (born 29 November 1933) is a pioneering English blues singer, songwriter, and multi-instrumentalist.\nHis musical career spans over fifty years, but the most notable episode in it occurred during the late '60s.\nHe was the founder of John Mayall &amp; the Bluesbreakers and, as a gifted talent-scout, has been influential in the careers of many instrumentalists,\nincluding Eric Clapton, Jack Bruce, Peter Green, John McVie, Mick Fleetwood, Mick Taylor, Don &quot;Sugarcane&quot; Harris, Harvey Mandel, Larry Taylor,\nAynsley Dunbar, Hughie Flint, Jon Hiseman, Dick Heckstall-Smith, Andy Fraser, Johnny Almond, Walter Trout, Coco Montoya, and Buddy Whittington.\n\nThis concert serves to remind us of the genius with which this pioneering artist almost singlehandedly revived the blues, and how he has made them his own over a phenomenal career in music.\nFeaturing the paired lead guitars of Walter Trout and Coco Montoya,\nthe band rocks hard in a tight groove that enables searing solos from the featured guitarists as well as from Mayall himself on guitar and keyboards.\nThe gutteral power of Mayall's vocals is ever-present.\nAnd the songs - most of them Mayall originals - include the classic &quot;Room To Move&quot; with which John Mayall once electrified the world of rock and roll.\nRecorded live in Baden Baden, Germany on October 6th, 1988.\n========================================================\nJohn Mayall (geboren op 29 november 1933) is een baanbrekende Engels blues zanger, songwriter en multi-instrumentalist.\nZijn muzikale carriÃƒÂ¨re omspant meer dan vijftig jaar, maar de meest opmerkelijke episode in zijn carriere is in de late jaren '60.\nHij was de oprichter van John Mayall &amp; The Bluesbreakers en als een begenadigd talent-scout was die invloedrijk in de carriÃƒÂ¨res van vele musicanten , waaronder Eric Clapton, Jack Bruce,\nPeter Green, John McVie, Mick Fleetwood, Mick Taylor, Don &quot;Suikerriet &quot;Harris, Harvey Mandel, Larry Taylor, Aynsley Dunbar, Hughie Flint, Jon Hiseman, Dick-Smith Heckstall,\nAndy Fraser, Johnny Almond, Walter Trout, Coco Montoya, en Buddy Whittington.\n\nDit concert dient om ons te herinneren aan de genie met die bijna eigenhandig nieuw leven in de blues kreeg , en zijn eigen fenomenale carriÃƒÂ¨re in de muziek.\nMet de gekoppelde leiden gitaren van Walter Trout en Coco Montoya.\nDe band rockt hard in een strakke groove die verschroeiende solo's maakt van de aanbevolen gitaristen als van Mayall zelf op gitaar en keyboards.\nDe kracht van Mayall's zang is altijd aanwezig. En de songs - de meesten van hen Mayall originelen - onder meer de klassieker &quot;Room To Move&quot;\nDit conceert kan je niet missen in je colectie\nLive opgenomen in Baden Baden, Germany on October 6th, 1988.\n\nTrack list\n[Tracklisting:\n1. Somebody's Acting Like a Child\n2. Wild About You\n3. The Bear\n4. Riding on the L and N\n5. Pretty Woman\n6. Rolling With the Blues\n7. Room To Move\n8. I Ain't Got You\n\nGEGEVENS:\ncategorie:Music\nkwaliteit: DVDR\nLanguage: English\ntijdsduur: 56 min\nbestand: Divx\nvideo codec: XVID\nbitrate: 1328 Kbps\nafmetinge: 720 X 480\ngeluidsindeling: lame mp3 128 kb/s\n\nYoutube:\nLUIEHOND69 ;)\n========================================== &lt;a href=&quot;\nhttp://www.movierecensies.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.movierecensies.nl&lt;/a&gt;\nENJOY THE MOVIE :D ","torrent":{"xt":"urn:btih:4f6832abbb1f18989cffd35b7831326432c4ebe6","amp;dn":"John+Mayall+%26+the+Bluesbreakers+-+Live+in+German+DVDR+NLT-Releas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f6832abbb1f18989cffd35b7831326432c4ebe6","infoHashBuffer":{"type":"Buffer","data":[79,104,50,171,187,31,24,152,156,255,211,91,120,49,50,100,50,196,235,230]},"announce":[],"urlList":[]}}