{"title":"NubileFilms - Irresistible Charm (2014) [1080p].mp4","uid":10288416,"size":1829134957,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:509ef9ed2e6d2b1b4b903ce6d6c374ec7c520006&amp;dn=NubileFilms+-+Irresistible+Charm+%282014%29+%5B1080p%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"FluxXxu","files":-1,"time":1401821837,"description":"\nNubileFilms - Irresistible Charm (2014) [1080p].mp4\n\n\nPosters and Screenshots\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=36220530619202061815.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=36220530619202061815.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=48308123167038809281.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=48308123167038809281.jpg&lt;/a&gt;\n\n\n\nCast\n\nMindy \n\n\nDescription\n\n&quot;As Mindy enjoys an afternoon with her man Jason X, the cutie pretends to read a book as she's actually trying to make eye contact to convey her sexual need to her beau. When she grows bored of subtlety, she takes action to make sure that her man knows exactly what she wants.\n\nPulling Jason away from his phone, Mindy pulls off her shirt and shorts while performing a swaying striptease that really gets her guy worked up. After she has bared her small tits and full rump, she finally gives her beau permission to touch.\n\nJason doesn't hesitate, latching his mouth on to Mindy's hard nipples to lick and suck as a preview for what his tongue will do to her bald pussy. Soon he has knelt down and buried his face deep in the softness of her sweet snatch, bringing moans of pleasure to the cute coed's lips as she enjoys her pussy licking that segues into a slow and sultry pussy fingering.\n\nNot one to let her man go without oral pleasure during lovemaking, Mindy gets on her knees and eagerly takes her man's cock in her hands and sweet mouth. She sets a good rhythm that lets her take her beau's cock deep into her mouth and throat as she sucks him off like he's her favorite treat.\n\nNext, Jason takes advantage of his lover's kneeling position to plant his fuck stick deep in her tight twat doggy style. His strokes set a ball-slapping pace as he works Mindy's needy snatch until she can't hold back her climax.\n\nMindy isn't satisfied yet, though! Turning around so that she faces Jason she climbs aboard her guy's erection and rocks her hips gently at first. Keeping up such a slow pace is too much for this sex crazed babe to do, and soon she is riding her personal stud hard and fast as her body clamors to reach a second explosive release.\n\nEager to finish Jason off, Mindy lays down on the couch and takes her guy's dick between her lips for a second time. Using her skilled hands and mouth she pushes him over the edge so that he delivers a warm facial of cum that drips down Mindy's chest and leaves her smiling in happiness.&quot;\n\n\nTags \n\nHardcore, XxX, Hot, Blowjob, Facial, Cumshot, Brunette\n\n\nResolution  \n\n1920x1080\n\n\nDuration  \n\t\n00:16:57\n\n\nSize      \n\n1.70 GB\n","torrent":{"xt":"urn:btih:509ef9ed2e6d2b1b4b903ce6d6c374ec7c520006","amp;dn":"NubileFilms+-+Irresistible+Charm+%282014%29+%5B1080p%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"509ef9ed2e6d2b1b4b903ce6d6c374ec7c520006","infoHashBuffer":{"type":"Buffer","data":[80,158,249,237,46,109,43,27,75,144,60,230,214,195,116,236,124,82,0,6]},"announce":[],"urlList":[]}}