{"title":"Danava - unonou","uid":4119071,"size":74093041,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5245bca4bee0589ce82c59a8060f22ca2fb92154&amp;dn=Danava+-+unonou&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheSunAlsoRises","files":9,"time":1207451952,"description":"Track List:\n\n   1. UnonoU\n   2. Where Beauty &amp; Terror Dance   \n   3. The Emerald Snow Of Sleep \n   4. A High Or A Low  \n   5. Spinning Temple Shifting    \n   6. Down From A Cloud, Up From the Ground  \n   7. One Mind Gone Separate Ways\n\n\nREVIEW:\n\nIt would be so easy for some to label Danava as a throwback band that plays music that apes a prior generation. Sure, they&amp;#039;ve weathered the phrase &quot;prog rock&quot; left and right but they remind us that for some bands the only way forward can be looking back. Yet unlike many of the roads taken by proggers of the seventies, Danava doesn&amp;#039;t extend their music to pretentious levels or come off like a pack of showoffs. Instead, the sophomore album from these Portland boys is like the Mars Volta for those with a short attention span and that&amp;#039;s a good thing, in part, since their intricate globs of riffs and lilting keyboards are to the point and don&amp;#039;t drizzle off to a world that drops drams of tedium on the listener&amp;#039;s ears. \n\nThe formula for this album is a good buzz-inducing helping of gliding stoner rock a la the kind that Kyuss used to belt out at their all night desert parties. Its murky semblance is intertwined with the grating yelp of singer/guitarist Dusty Sparkles. Also included are revving power chords that morph into bridges of free flowing math jazz moods. The production is no less than spot-on and rather wise because it lets the arty-prog proclivities fly out left and right, sans the pomp and circumstance. There are even some speckles of Eastern influenced droning which ratchets up Danava&amp;#039;s position as a band creating some of the most aural music for the mind today. \n\nUnonoU will also please those who like heavy music as well as listeners who preferably dabble on the more mellow side of the coin. Lots of bands who ride somewhere near the same boat as Danava wear their love for Yes, Hawkwind, and Emerson, Lake and Palmer on their sleeves but hats are tipped to UnonoU for reminding vinyl aficionados that there was once a band called Uriah Heep and that they are entitled to ample kudos for the influence they were able to dish out over the decades. \n\nPlay this album within earshot of your dad and chances are that he&amp;#039;s going to have a flashback to a scene from his youth back in 1973, in which a high school party was being thrown while the folks were out of town for the weekend, and people were getting loaded on hallucinogens on the shag carpet floor while some pretty glitzy tunes were blaring from the hi-fi. But also take note that that Danava can fuse in a more contemporary punk aesthetic with a fuck-it-all and have-a-good-time attitude. It&amp;#039;s not every album that you buy which makes for apt headphone listening and speaker blowing cacophony. \n","torrent":{"xt":"urn:btih:5245bca4bee0589ce82c59a8060f22ca2fb92154","amp;dn":"Danava+-+unonou","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5245bca4bee0589ce82c59a8060f22ca2fb92154","infoHashBuffer":{"type":"Buffer","data":[82,69,188,164,190,224,88,156,232,44,89,168,6,15,34,202,47,185,33,84]},"announce":[],"urlList":[]}}