{"title":"Blaze Wyndham (Romance) prabhu_","uid":9412385,"size":8750256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54544f667ab1ee131595ce408f950dc07c73a0ce&amp;dn=Blaze+Wyndham+%28Romance%29+prabhu_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prabhu_","files":11,"time":1388336926,"description":"Blaze Wyndham (Romance)\n\nby Bertrice Small\n &lt;a href=&quot;\nhttp://topromancenovels.com/wp-content/uploads/2011/01/Blaze-Wyndham-by-Bertrice-Small.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://topromancenovels.com/wp-content/uploads/2011/01/Blaze-Wyndham-by-Bertrice-Small.jpg&lt;/a&gt;\n\nabout book :-\n\nFrom the New York Times bestselling &quot;resigning queen of romance&quot; (Literary Times), comes a love story on a grand scale, featuring an innocent country girl who catches the eye of the most powerful man in England-and filled with all the sensuality, drama, and thrilling intrigues of Henry Tudor's glittering sixteenth century court...\n\nAbout this author:-\n &lt;a href=&quot;\nhttp://d202m5krfqbpi5.cloudfront.net/authors/1268081041p5/67038.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://d202m5krfqbpi5.cloudfront.net/authors/1268081041p5/67038.jpg&lt;/a&gt;\n\nBertrice Williams was born on December 9, 1937 in Manhattan, New York City, New York, USA, the daughter of Doris S. and David R. Williams, both broadcasters. She studied at Attended Western College for Women and Katharine Gibbs Secretarial School. On October 5, 1963, she married George Sumner Small, a photographer and designer with a History Major at Princeton. They had a son Thomas David. She has lived on eastern Long Island for over 30 years, and she loves it! Her greatest passions are her family; Finnegan and Sylvester, the family cats; Nicki, the elderly cockatiel who whistles the NY Mets charge call; her garden; her work, and just life in general.\n\nPublished since 1947, Bertrice Small is the author of over 50 romance novels. A New York Times bestselling author, she has also appeared on other best-seller lists including Publishers Weekly, USA Today, and the L.A. Times. She is the recipient of numerous awards including Career Achievement for Historical Romance; Best Historical Romance; Outstanding Historical Romance Series; Career Achievement for Historical Fantasy; a Golden Leaf from the New Jersey Romance Writers chapter of Romance Writers of America; an Author of the Year (2006) and Big Apple Award from the New York City Romance Writers chapter of RWA, and several Reviewers Choice awards from Romantic Times. She has a &quot;Silver Pen&quot; from Affair De Coeur, and an Honorable Mention from The West Coast Review of Books. In 2004 she was awarded a Lifetime Achievement Award by ROMANTIC TIMES magazine for her contributions to the Historical Romance genre. And in 2008 she was named by ROMANTIC TIMES along with her friends Jennifer Blake, Roberta Gellis and Janelle Taylor, a Pioneer of Romance.\n\nBertrice Small is a member of The Authors Guild, Romance Writers of America, PAN, and PASIC. She is also a member of RWA's Long Island chapter, L.I.R.W., and is its easternmost member on the North Fork of Eastern Long Island.\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t\n","torrent":{"xt":"urn:btih:54544f667ab1ee131595ce408f950dc07c73a0ce","amp;dn":"Blaze+Wyndham+%28Romance%29+prabhu_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54544f667ab1ee131595ce408f950dc07c73a0ce","infoHashBuffer":{"type":"Buffer","data":[84,84,79,102,122,177,238,19,21,149,206,64,143,149,13,192,124,115,160,206]},"announce":[],"urlList":[]}}