{"title":"Epicurus The Sage (Restored)","uid":7625765,"size":83003239,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:549c7d28b43b07d665bb96eb3816419d00e89369&amp;dn=Epicurus+The+Sage+%28Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1347428258,"description":"Issues 1-2 of 'Epicurus The Sage'\n\nPiranha Press/DC Comics, 1989 and 1991\n\nWritten by William Messner-Loebs\n\nPencils and Inks by Sam Kieth\n\nColors by Steve Oliff\n\nEpicurus the Sage was the name of a 2-issue limited series written by William Messner-Loebs, with art by Sam Kieth. Each issue was bound in a graphic novel format, and was 48 pages long, without advertisements. It was published by Piranha Press, the &quot;alternative comics&quot; imprint of DC Comics.\n\nAncient Greek philosopher Epicurus appears as the main character of the book, traveling the ancient world with Plato and Aristotle's young pupil Alexander the Great, sometimes with Aristotle himself. Together, they wander into various major Greek myths (e.g. the kidnapping of Persephone by Hades), and discuss the philosophical questions raised, with a great deal of slapstick humor.\n\nThe book mixes history, mythology, and humor to relate the teachings of Epicurus. The narrative tends to anachronistically show other vaguely contemporary writers and thinkers, such as Aesop (who died two centuries before the historical Epicurus was even born), as backwards, foolish, fascistic, or all three, while the philosophy of Epicurus is portrayed to be more tolerant and humanistic; it is pointed out more than once that Epicurus is one of the only ancient philosophers who would teach women.\n\nVarious notable personages, from both history and mythology (e.g. Alcibiades and Zeus), appear as secondary characters.\n\n------------------------------------------------------------------------------\n\n\nPart of the 'Restoration' process is done to make it possible to enlarge these images. As such, after you have opened the files in a comic book reader some of you may actually need to shrink them down a bit to improve the image quality.\t\t","torrent":{"xt":"urn:btih:549c7d28b43b07d665bb96eb3816419d00e89369","amp;dn":"Epicurus+The+Sage+%28Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"549c7d28b43b07d665bb96eb3816419d00e89369","infoHashBuffer":{"type":"Buffer","data":[84,156,125,40,180,59,7,214,101,187,150,235,56,22,65,157,0,232,147,105]},"announce":[],"urlList":[]}}