{"title":"Real World Adobe InDesign CS4","uid":4943648,"size":28841282,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55a1b5b25e2509a05ad59f63311e9202e1779ca5&amp;dn=Real+World+Adobe+InDesign+CS4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1244559872,"description":"Adobe InDesign is a full-fledged, sophisticated program, tightly integrated with the other Adobe industry leading graphics and Web programs in the Creative Suite. It's the essential tool for anyone doing page layout and design.\n\nReal World Adobe InDesign CS4 offers industrial-strength and time-saving techniques for design professionals who need to start laying out, proofing, and printing pages with InDesign CS4, without missing a beat (or a deadline!) in their fast-paced production cycles. Design pros will find everything they need here to successfully master InDesign's advanced page layout tools, manage color, snippets, and use the program more efficiently.\n\nThey'll also find complete coverage of essential features in InDesign CS4, including: live preflight, customizable Links panel, conditional text, cross references, interactive document capability with the new SWF file, animated page transitions, export to Flash CS4 functionality, Smart Guides and Smart Spacing, spread rotation, and smart text reflow.\n","torrent":{"xt":"urn:btih:55a1b5b25e2509a05ad59f63311e9202e1779ca5","amp;dn":"Real+World+Adobe+InDesign+CS4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55a1b5b25e2509a05ad59f63311e9202e1779ca5","infoHashBuffer":{"type":"Buffer","data":[85,161,181,178,94,37,9,160,90,213,159,99,49,30,146,2,225,119,156,165]},"announce":[],"urlList":[]}}