{"title":"Throttle.6.8.9.2010.Internet.Booster","uid":5764124,"size":1586452,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:579faf0dbd63061122e9b8491dddaeca6575933c&amp;dn=Throttle.6.8.9.2010.Internet.Booster&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"do_not_delete_me_blindly","files":2,"time":1281822007,"description":"\n   Throttle 6.8.9.2010 - Internet Booster - REGISTERED !!!\n\n\n\nIncrease the speed of your internet connection with Throttle 6. \nThe best internet acceleration software available on the market,\nThrottle boosts download and upload speeds and squeezes out every \nlast bit of performance your Cable, DSL, Dial-Up, Satellite, and \nMobile Phone modem is capable of. Very easy to use and fully compatible \nwith the latest versions of Microsoft Ã‚Â® Windows and compatible with all \ninternet connection types. Download music, movies, files and play \nmultiplayer internet games faster with Throttle.\n\n\nThrottle can increase your internet connection dramatically and allows you to surf \nwebsites and download files much faster. If you are on a Dial-Up connection you may \nsuffer from constant dropped connections, with Throttle this problem can quickly be fixed. \nNot only does Throttle work with Dial-Up connections but it also works with Cable and DSL \nconnections and can reduce the time it takes to download large music, movies and games \nfrom your favorite websites. \nIncrease the speed of your internet connection and improve the stability of your \nconnection by avoiding disconnects and bandwidth congestion.\n\n\nThrottle works by making permanent modifications to the Windows system registry \nand system files, these changes affect how your modem interacts with your \ninternet service provider, download faster, play faster and surf the web faster \nby using Throttle. All settings made by Throttle can be fully reversed, \nallowing you to fully test the software and make sure it works properly \nwith your computer and modem. The settings made by Throttle work even \nafter you reboot your computer, so you do not have to worry about running \nThrottle each time you reboot Windows.\n\n\nDon't pay extra money per month to your internet service provider to get a faster \ninternet connection, download Throttle and increase your internet speed yourself. \nWhy suffer with a slow internet connection and constant disconnects when there is \na solution available to improve your internet experience today.\n\n\nLatest Update: 6.8.9.2010 - Resigned all files and installer with new Authenticode \nCode Signing 3 year certificate from Comodo. Fixes expiration of previous certificate \nfrom Thawte. Also changed the compression level of installer to minimize memory usage \nduring install and uninstall.","torrent":{"xt":"urn:btih:579faf0dbd63061122e9b8491dddaeca6575933c","amp;dn":"Throttle.6.8.9.2010.Internet.Booster","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"579faf0dbd63061122e9b8491dddaeca6575933c","infoHashBuffer":{"type":"Buffer","data":[87,159,175,13,189,99,6,17,34,233,184,73,29,221,174,202,101,117,147,60]},"announce":[],"urlList":[]}}