{"title":"RZ Video Converter v4.60-TeamGBZ","uid":9446179,"size":25385281,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:57bb50b73de8553610e0861f33811db86308f55c&amp;dn=RZ+Video+Converter+v4.60-TeamGBZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NewSky005","files":4,"time":1389054779,"description":"Now, don't need to spend more money on video converter software,\n        RZ Video Converter is the most cost-effective solution, only\n        US$39.99, Convert any video and audio files, If you need a video\n        converter software, we believe RZ Video Converter is your Best\n        choice!   \n\n        RZ Video Converter provide the total solution of converting video\n        and audio files, it is an all-in-one media converter software\n        that convert any videos and audios from one format to another, or\n        extract audio tracks from video, support all popular video and\n        audio format, built-in more video edit tools. It's the most\n        powerful and cost-effective media converter for you.   \n\n        RZ Video Converter Key Features:\n        Â· Support all popular video files as source, including AVI, MP4\n          (MPEG-4), H.264, H.263, Xvid, DivX, MPG(Mpeg-1, Mpeg-2), Mkv,\n          WMV, MOV, RM, RMVB, 3GP, Flv(flash file, Youtube video file),\n          ASF, TS, M2TS, NUT, RoQ, DSM, Evo, DVD/VOB, OGM, OGG, Theora,\n          etc.\n        Â· Support all popular audio files as source, including MP3, M4A,\n          AC3, AAC, OGG(Vorbis), WMA, AMR, FLAC, RA, WAV, etc.\n        Â· Convert any videos to AVI, MP4, MPG, WMV, MOV, OGG, FLV, ASF,\n          H264/AVC, etc.\n        Â· Convert any videos and audios to MP3, M4A, WMA, AMR, AC3, AAC,\n          Ogg(Vorbis), etc.\n        Â· Convert any videos and audios to play on almost any Mobile\n          Devices(Portable device) including iPod, iPad, iPad mini, iPod\n          touch, iPhone, PSP, Zune, ZEN, MP4 Player, video capable MP3\n          players, 3GP, Blackberry, video capable mobile phones, PDA, and\n          Pocket P.C, etc. Supports Sony PS, Xbox360, Apple TV, etc.\n        Â· Extract audio tracks from all popular media files, and save to\n          MP3, M4A, AC3, AAC, OGG(Vorbis), WMA, AMR, etc.\n        Â· Support SRT subtitle, can put subtitles on the movies.\n        Â· Crop video like an image, support auto crop black bar.\n        Â· Cut/Split large video files into smaller pieces.\n        Â· Merge/Join multiple video files in various formats into one\n          files.\n        Â· Convert all popular image files to video.\n        Â· Customize the target video/audio file, such as video\n          resolution, video compressor, video encoder, video bitrate,\n          video frame rate, video size, aspect ratio, audio encoder,\n          audio bitrate, audio sample rate, audio channels, etc.\n        Â· Our High Performance and High Quality processor engine, offer\n          the best video/audio quality.\n        Â· Support multi-conversion-threading, offer the faster speed.\n        Â·\nNotes\n1]Install using exe\n2]Apply crack from crack folder\n","torrent":{"xt":"urn:btih:57bb50b73de8553610e0861f33811db86308f55c","amp;dn":"RZ+Video+Converter+v4.60-TeamGBZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57bb50b73de8553610e0861f33811db86308f55c","infoHashBuffer":{"type":"Buffer","data":[87,187,80,183,61,232,85,54,16,224,134,31,51,129,29,184,99,8,245,92]},"announce":[],"urlList":[]}}