{"title":"Futurama - Season 2 - Audio Commentary - DVDRip - AAC","uid":7503648,"size":221369273,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:58da445d45dfa2cfc88bad0bd27873f9a2b89754&amp;dn=Futurama+-+Season+2+-+Audio+Commentary+-+DVDRip+-+AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"schleicher","files":20,"time":1344097950,"description":"A Bicyclops Built for Two (2ACV09) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Eric Kaplan, Susan Dietter, John DiMaggio and Billy West)\n\nA Clone of My Own (2ACV10) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Patrick M. Verrone, Scott Vanzo and John DiMaggio)\n\nA Head In The Polls (2ACV03) (Audio Commentary by Matt Groening, David X. Cohen, Bret Haaland, Rich Moore, Scott Vanzo, J. Stewart Burns, Billy West and John DiMaggio)\n\nAnthology Of Interest 1 (2ACV16) (Audio Commentary by Matt Groening, John DiMaggio, Billy West, Ken Keeler, David X. Cohen and Rich Moore)\n\nBender Gets Made (2ACV13) (Audio Commentary by Rich Moore, Peter Avanzino, David X. Cohen, Eric Horsted, John DiMaggio and Matt Groening)\n\nBrannigan, Begin Again (2ACV02) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Jeffrey Lynch, Lewis Morton, Christopher Tyng and Billy West)\n\nHow Hermes Requisitioned His Groove Back (2ACV11) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Bill Odenkirk, Paul D. Calder and John DiMaggio)\n\nI Second That Emotion (2ACV01) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Patrick M. Verrone and John DiMaggio)\n\nMother's Day (2ACV14) (Audio Commentary by Matt Groening, David X. Cohen, Christopher Tyng, Brian Sheesley, Rich Moore, Lewis Morton and Billy West)\n\nPut Your Head on My Shoulder (2ACV07) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Ken Keeler, John DiMaggio and Billy West)\n\nRaging Bender (2ACV08) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Lewis Morton, Ron Hughart, Christopher Tyng and Billy West)\n\nThe Cryonic Woman (2ACV19) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, J. Stewart Burns, Bret Haaland, Scott Vanzo, John DiMaggio and Billy West)\n\nThe Deep South (2ACV12) (Audio Commentary by Matt Groening, J. Stewart Burns, John DiMaggio, Billy West, David X. Cohen, Bret Haaland and Rich Moore)\n\nThe Honking (2ACV18) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Ken Keeler, Susan Dietter, John DiMaggio and Billy West)\n\nThe Lesser of Two Evils (2ACV06) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Eric Horsted, Peter Avanzino and John DiMaggio)\n\nThe Problem With Popplers (2ACV15) (Audio Commentary by Matt Groening, Billy West, Christopher Tyng, Patric M. Verrone, David X. Cohen and Rich Moore)\n\nWar Is The H-Word (2ACV17) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Eric Horsted, Ron Hughart and John DiMaggio)\n\nWhy Must I Be A Crustacean In Love (2ACV05) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, John DiMaggio, Paul D. Calder, Eric Kaplan and Brian Sheesley)\n\nXmas Story (2ACV04) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Peter Avanzino, Paul D. Calder, Bill Odenkirk and John DiMaggio)","torrent":{"xt":"urn:btih:58da445d45dfa2cfc88bad0bd27873f9a2b89754","amp;dn":"Futurama+-+Season+2+-+Audio+Commentary+-+DVDRip+-+AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58da445d45dfa2cfc88bad0bd27873f9a2b89754","infoHashBuffer":{"type":"Buffer","data":[88,218,68,93,69,223,162,207,200,139,173,11,210,120,115,249,162,184,151,84]},"announce":[],"urlList":[]}}