{"title":"PBS.Empires.The.Greeks.Crucible.of.Civilization.3of3.Empire.of.M","uid":6351646,"size":854816768,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:591908c94702cfe837742c756a83c7a7f27e20e2&amp;dn=PBS.Empires.The.Greeks.Crucible.of.Civilization.3of3.Empire.of.M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DocFreak08","files":1,"time":1304018225,"description":"It was perhaps the most spectacular flourishing of imagination and achievement in recorded history. In the Fourth and Fifth Centuries BC, the Greeks built an empire that stretched across the Mediterranean from Asia to Spain. They laid the foundations of modern science, politics, warfare and philosophy, and produced some of the most breathtaking art and architecture the world has ever seen. This series, narrated by Liam Neeson, recounts the rise, glory, demise and legacy of the empire that marked the dawn of Western civilization. The story of this astonishing civilization is told through the lives of heroes of ancient Greece. The latest advances in computer and television technology rebuild the Acropolis, recreate the Battle of Marathon and restore the grandeur of the Academy, where Socrates, Plato and Aristotle forged the foundation of Western though.\nThe series combines dramatic storytelling, stunning imagery, new research and distinguished scholarship to render classical Greece gloriously alive.\n\nApprox. running time: 165 min.\n\nSeries Director And Writer : Cassian Harrison\nAtlantic Productions in association with PBS and Devillier Donegan Enterprises (1999)\n\nEpisode 3 : Empire of Mind\nThe final segment describes how Athens, at the height of her glory, engaged in a suicidal conflict with her greatest rival, Sparta. Through the eyes of Socrates, Athens' first philosopher, viewers see the tragic descent of Athenian democracy into mob rule.The episode opens in 399 B.C., after the great philosopher Socrates has been sentenced to death and Athens lies in ruins after a war with Sparta. This episode goes back to 431 B.C., to an Athens at the height of its cultural, political, and economic power. Having taken great leaps forward in every field of learning, and with a strong economy that dominates Mediterranean trade, Athens and its 150,000 residents are the envy of their neighbors, in particular, bellicose Sparta. Jealous of Athenian success, the Spartans yearn to spill Athenian blood and dominate the region. Of course, Pericles knows what is coming, and he orders the citizens to abandon open areas and take refuge inside the walls of Athens. The mighty Athenian fleet will provide supplies for the citizens through the port of Piraeus and a walled corridor between that city and Athens. Over time, the navy will prevail, as it had against the Persians, and win yet another victory. Much is at stake -- democracy, freedom, the whole Athenian way of life. As expected, the Spartans invade and burn the open areas around the city. But it is the unexpected that deals the most devastating blow to Athens. Incoming ships with supplies for the walled-in Greeks carry plague-bearing rats feeding on grain. The disease ravages the Athenians, inflicting agony on them and killing one out of every three. The Spartans are of little concern; what matters is surviving until tomorrow. Pericles' esteem plummets even as he himself contracts the plague and eventually dies. Finally in 404 B.C., Athens surrenders. The Athenians, shattered and stripped of their empire, take revenge on their most vocal critic and condemn Socrates to death before a people's court.\n\nTechnical Specs\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2039 kbps\nVideo Resolution: 704x400\nVideo Aspect Ratio: 1.760:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 50:53.581\nNumber Of Parts: 3\nPart Size: 854,843,392 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:591908c94702cfe837742c756a83c7a7f27e20e2","amp;dn":"PBS.Empires.The.Greeks.Crucible.of.Civilization.3of3.Empire.of.M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"591908c94702cfe837742c756a83c7a7f27e20e2","infoHashBuffer":{"type":"Buffer","data":[89,25,8,201,71,2,207,232,55,116,44,117,106,131,199,167,242,126,32,226]},"announce":[],"urlList":[]}}