{"title":"HISTORY OF POP AND ROCK MUSIC - part 479","uid":8232735,"size":172755078,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5977af7437f52fcbc0f594dd94bb32c7e62f253f&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+479&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1362765679,"description":"                         PART  479 \n\n\n\n            FRAZEY FORD  -  One More Cup Of Coffee (2010) \n\n\n\n        &quot;One More Cup of Coffee&quot;  is a song written and recorded by Bob Dylan from his  1976 album &quot;Desire&quot;. &quot;One More Cup of Coffee&quot; tells the tale of a girl whose family are gypsies and drifters, and of the man who must leave her to enter the &quot;valley below&quot;. The narrator describes a character who is beautiful: &quot;your eyes are like two jewels in the sky&quot; but for whom the narrator's love and admiration are not reciprocated (&quot;but I don't sense affection no gratitude or love, your loyalty is not to me but to the stars above&quot;). The song deals with themes of abandonment; the apparent end of a relationship and the concept of a coming journey. The song could be seen as a metaphor for Dylan's relationship with Sara Dylan.; however, this is unsubstantiated. The song is also thought to have been inspired by a visit Dylan made to Saintes Maries de Mer in Provence, France, where there is an annual gathering of Romany people who venerate Saint Sarah the Egyptian.\n        The song is a duet between Dylan and Emmylou Harris; as an incidental to its use of the harmonic minor scale it has a decidedly Middle Eastern flavor in the vocal melody. It was covered by The White Stripes on their eponymous debut album. Furthermore there is a version by Roger McGuinn and Calexico for the 2007 film I'm Not There. Calexico also perform the song at their concerts. Robert Plant covered the song in his 2002 album Dreamland. In 2003, Sertab Erener covered this song which in turn became the soundtrack of the movie Masked and Anonymous. In 2009 Italian rock noir band Belladonna covered the song in their Rome, Italy show.\n\n        Frazey Ford included a cover of the song on her 2010 debut solo album,&quot; Obadiah&quot;. It is Ford's debut solo album. She had previously released albums as a member of The Be Good Tanyas. Ben Ratliff of the New York Times gave the album a favorable review and commended Ford's blending of soul and country influences. He compared her singing to a diverse group of artists including Dolly Parton, Ann Peebles and Feist","torrent":{"xt":"urn:btih:5977af7437f52fcbc0f594dd94bb32c7e62f253f","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+479","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5977af7437f52fcbc0f594dd94bb32c7e62f253f","infoHashBuffer":{"type":"Buffer","data":[89,119,175,116,55,245,47,203,192,245,148,221,148,187,50,199,230,47,37,63]},"announce":[],"urlList":[]}}