{"title":"LastBit Password Tools v11.0.8051 (The Joker)","uid":4082723,"size":15068838,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:59bbbd67e7c092f19ade23b96867cd1c677d75ad&amp;dn=LastBit+Password+Tools+v11.0.8051+%28The+Joker%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jokeri1971","files":5,"time":1205638831,"description":"Lost your password? Former employees leave without un-protecting their database? Password is forgotten? Our software will help! We offer wide range of password recovery software for all popular application types.\n\nAll available password recovery modules listed in alphabetical order:\nAccess (both database and user passwords) -- Act! -- Excel (100% success guarantee! no brute-force!) -- Lotus Organizer -- MS Backup -- MS Money -- OneNote -- Outlook -- PDF Files -- Pocket Excel (Excel for PDA) -- PowerPoint -- Project -- Quickbooks -- Quicken -- Schedule+ -- VBA Macros -- Word (100% success guarantee! no brute-force!) -- Zip/WinZip\n\nLastBit software was the first who provided such unique password recovery method that guaranteed successful password recovery regardless of password length.\n\n\nA lot of software applications allow users to protect their files with passwords. Passwords you use to secure data can be forgotten or lost. How to unlock your file if you forgot or lost password?\n\nLastBit Software offers you effective password recovery software. Using it you can easy and fast solve problems with forgotten and lost passwords. We launched first password recovery application in 1997. We were the first who developed password recovery tools for Microsoft Office Word and Excel. Since 1997 we developed a lot of password recovery solutions for most popular applications.\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:59bbbd67e7c092f19ade23b96867cd1c677d75ad","amp;dn":"LastBit+Password+Tools+v11.0.8051+%28The+Joker%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59bbbd67e7c092f19ade23b96867cd1c677d75ad","infoHashBuffer":{"type":"Buffer","data":[89,187,189,103,231,192,146,241,154,222,35,185,104,103,205,28,103,125,117,173]},"announce":[],"urlList":[]}}