{"title":"Led Zeppelin - Southampton University - 22-01-73","uid":4044580,"size":268988888,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5a2b8765d4ce76867b5076fa692de805b108a20f&amp;dn=Led+Zeppelin+-+Southampton+University+-+22-01-73&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esserhaddon","files":16,"time":1203844922,"description":"Led Zeppelin, Southampton University\nJanuary 22, 1973, Southampton, England\n\nMP3/VBR 245kbps - 256MB - 16files\n\n01. Rock and Roll\n02. Over The Hills And Far Away\n03. Black Dog\n04. Misty Mountain Hop\n05. Since I&amp;#039;ve Been Loving You\n06. Dancing Days\n07. The Song Remains The Same\n08. The Rain Song\n09. Dazed and Confused\n10. Stairway to Heaven\n11. Whole Lotta Love\n12. Heartbreaker\n13. Thank You\n14. How Many More Times\n15. Communication Breakdown\n\nReview\n\nLive At Southampton - Working Tapes  (Empress Valley Supreme Disk)\n2 CD set in paper gatefold sleeve case\nLive at the Old Refectory, Southampton University,\nJanuary 22, 1973\n\nYes, EVSD has done it again!  EVSD&amp;#039;s release of the long awaited Southampton 1/22/73 MULTI-TRACK recording is quite spectacular.  Definately one of my favorite EVSD releases ever.  Sound quality is simply stunning.  Although comparing it to Presence&amp;#039;s raw master, which surfaced online on August 10, 2007, there is no difference whatsoever in sound quality.  But Presence&amp;#039;s release had many digital clicks, crackles, and pops.  EVSD&amp;#039;s release doesn&amp;#039;t seem to have as many.  Also, on EVSD&amp;#039;s release, they did screw up the tracklisting on the second disc partially.  On the artwork, it shows a separate track for the Keyboard Solo, but on the disc, the Keyboard Solo is blended with Thank You, and the Organ Solo is actually Heartbreaker.  Kind of odd, but let me assure you, THERE IS NOTHING MISSING.  THIS RELEASE IS COMPLETE.  Also, one more thing, I don&amp;#039;t think I would call it an Organ Solo, because JPJ ditched the organ solo by 1971 because it sounded too &quot;churchish&quot; for him.  He actually did a Mellotron Solo, so I would probrably call it a &quot;Mellotron Solo&quot;.  But the song titles don&amp;#039;t bother me, so no biggie.  I wish EVSD would have used some of the EQ tricks they have down their sleeve on this release, as it would&amp;#039;ve enhanced the sound quality even more.  But with or without, it still sounds AMAZING!  I love the artwork they gave it, a very nice job has been done.  Maybe they could&amp;#039;ve put a little bit more effort into it, but I&amp;#039;m not complaining, because they made it up with the sound quality, and the price (haha)!  This is a &quot;Special 10th Anniversary Release&quot;, so they they dropped the price dramatically.  Only $37!  Very nice packaging too, a nice cardstock paper gatefold sleeve case.  All I can say is, this is definately a release that many of us will be listening to until something just as amazing surfaces.  Southampton, Oh Sweet Southampton!  Great performance (besides Plant&amp;#039;s flu infested voice), and great sound quality.  Amazing release, GET IT! (Irishfighter Aug 07)\n\nEnjoy!","torrent":{"xt":"urn:btih:5a2b8765d4ce76867b5076fa692de805b108a20f","amp;dn":"Led+Zeppelin+-+Southampton+University+-+22-01-73","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a2b8765d4ce76867b5076fa692de805b108a20f","infoHashBuffer":{"type":"Buffer","data":[90,43,135,101,212,206,118,134,123,80,118,250,105,45,232,5,177,8,162,15]},"announce":[],"urlList":[]}}