{"title":"Barren Cross - Discography Reworked","uid":9566239,"size":896338827,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5aa9390b221c7880f03782e92029991395142fe3&amp;dn=Barren+Cross+-+Discography+Reworked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"godrulz","files":135,"time":1391520821,"description":"Barren Cross\nFrom Wikipedia, the free encyclopedia\nBarren Cross is a Christian metal band that was formed in Los Angeles, California in 1983 by high school friends Ray Parris (guitar) and Steve Whitaker (drums). The band released six albums from 1986 to 1994. They have reunited for a few shows in recent years, and plan to record a new album.\nBy 1984, bassist Jim LaVerde and vocalist Mike Lee (born Mike Naeyert) were added. In 1989, the band appeared on The Morton Downey Show alongside members of KISS and Anthrax.[1] In 1990, Mike Lee left and joined the band Bare Bones but would appear on the Barren Cross' later releases.[1]\nMusically, Barren Cross is often compared to Iron Maiden, mainly due to the similarity of the vocals between Mike Lee and Maiden frontman Bruce Dickinson.[2] Lyrically, the band is noted for its stance on a number of social issues. Their songs addressed, from a Christian worldview, personal and societal issues such as suicide, abortion, terrorism, and prejudice.[1]\nOver the years, Barren Cross has seen their share of successes since their start out of high school in 1982. In 1985, their first EP, Believe, an independent release, garnered national attention and trademarked their raw metal sound. The following year, Star Song Records released their first full-length album, Rock for the King. 1988 saw a second full-length release, Atomic Arena, this time on Enigma Records (now Capitol Records) alongside label mates Poison, Ratt, Slayer, Stryper, and others.\nIn 1989, as a follow-up to their Enigma debut, they released State of Control, and Hotter than Hell Live!, a full production live album on Medusa Records, was released the following year (1990). A few months later, Rock for the King was reissued and has since become a collector's item. Subsequent to lead singer Michael Lee (now known as Michael Drive) pursuing another project (becoming writer and lead vocalist for the band Bare Bones), vocalist Vincent Van Voltenburg, aka, (Vin Van Volt) of the Christian Metal quartet, (Full Armor), was introduced as the new lead singer and took the reins for all live performances during the 1990 &quot;State of Control World Tour&quot; which included sold out shows in Ireland, Germany, Austria and the U.S. Soon after the 1990 World Tour ended, the new lineup with Ray Parris on (Guitar), Jim LaVerde (Bass), Vin Van Volt (vocals) and David LaVai (drums), was to begin writing for the next record which might have included a Vin Van Volt song called &quot;Pain Reliever&quot;. The song, a new sound for Barren Cross, was well received by audiences on the State of Control tour. The record with this new lineup would never materialize, and Barren Cross went on hiatus until their last full-length release (to date), the stylistically evolved Rattle Your Cage, released on Rugged Records in 1994. &quot;Rattle Your Cage&quot; featured all of the original members of Barren Cross.\nBarren Cross earned some airplay on VH1, MTV, radio stations, and several label and metal music compilations. For over twenty years, international music magazines have featured the band consistently. Besides six major label releases, five of them full-length, Barren Cross was known for relentless touring[citation needed].\nIn 2007, Barren Cross teamed with artist manager Jeff McLain and his company the North Coast Agency to help book, manage, and market their return.[3] On May 8, 2008, the band officially announced they would be returning to the music scene, launching MySpace and Facebook pages for the band and remaining active in communication. The band initially announced a reunion which included original lead singer, Mike Lee,[4] but would eventually announce experienced singer, Dean Kohn, (ATTAKK, Loudness, Malice) would be fulfilling vocal duties.[5] A successful short-term reunion with a few international reunion concerts ensued, with announcements of a return to the recording studio with new music. In 2010, Barren Cross announced a special re-release of their debut album, Believe EP, marking the 25 Year Anniversary of its original 1985 independent release. Mike Lee has since appeared on the Barren Cross' most recent live performances.","torrent":{"xt":"urn:btih:5aa9390b221c7880f03782e92029991395142fe3","amp;dn":"Barren+Cross+-+Discography+Reworked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aa9390b221c7880f03782e92029991395142fe3","infoHashBuffer":{"type":"Buffer","data":[90,169,57,11,34,28,120,128,240,55,130,233,32,41,153,19,149,20,47,227]},"announce":[],"urlList":[]}}