{"title":"Revolution - Season 1 - Episodes 1 thru 20","uid":9535774,"size":10729626059,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5b8f1038662695d3f9f8e3427decdad228e08302&amp;dn=Revolution+-+Season+1+-+Episodes+1+thru+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":-1,"time":1390928569,"description":"\n\nThe series takes place in a post-apocalyptic future. All electricity on Earth has been disabled within a single night, ranging from computers and electronics to car and jet engines. Trains and cars stopped where they were, ships went dead in the water, and fly-by-wire aircraft fell from the sky and crashed.\n\nPeople were forced to adapt to a world without electricity over the next fifteen years. Due to the collapse of government and public order, many areas are now ruled by warlords and militias.\n\nIt starts with the surviving Matheson family: Ben, Charlie, and Danny, now living near what used to be Chicago, who possessed a pendant-shaped device (a USB flash drive contained in a pendant) that is the key to not only finding out what happened fifteen years ago, but also a possible way to reverse its effects. However, Sebastian Monroe, the General of the Monroe Militia and self-appointed President of the Monroe Republic, an area of the former United States east of the Mississippi River northward of Kentucky and the Carolinas, now possesses that power for himself seeking conquest of the entire former United States of America. The remaining Matheson family, joined initially by Miles Matheson, Aaron Pittman, and Nora Clayton now strive to counter the Monroe Militia. Monroe's new benefactor, Randall Flynn, a former U.S. Assistant Secretary of Defense who 15 years earlier ordered the deployment of the weaponized technology that caused the blackout, now seeks to fortify Monroe in his efforts after Rachel escaped from his custody.[7]\n\nOpening Introduction:\n\n   We lived in an electric world. We relied on it for everything. And then the power went out. Everything stopped working. We weren't prepared. Fear and confusion led to panic. The lucky ones made it out of the cities. The government collapsed. Militias took over, controlling the food supply and stockpiling weapons. We still don't know why the power went out. But we're hopeful someone will come and light the way.\n\nIn Season 1 Episode 5, &quot;Soul Train&quot;, a map of North America is shown.[8] The map showed the former continental United States, Canada, and Mexico divided into six parts: the Monroe Republic in the northeast, Maritime Provinces and Great Lakes region; the Georgia Federation in the southeast; the Plains Nation in the northern Midwest and Rocky Mountain states; Texas which controls portions of Mexico, Oklahoma, Arkansas, and Louisiana; the California Commonwealth which has the Pacific Coast from Baja California to British Columbia; and the Wasteland in the vicinity of Arizona, New Mexico, Utah, and Mexico.[9]\n\nThe same episode also indicates that the Georgia Federation and Plains Nation have allied against the Monroe Republic. Border skirmishing in southwest Illinois, near St. Louis, is mentioned.\n\nAccording to the wife of Captain Thomas Neville (Julia) in a letter to her husband, the Monroe Republic capital of Philadelphia, Pennsylvania is relatively safe; however, life outside west of Pittsburgh is subject to rebel attacks and other dangers such as bandits.[7]","torrent":{"xt":"urn:btih:5b8f1038662695d3f9f8e3427decdad228e08302","amp;dn":"Revolution+-+Season+1+-+Episodes+1+thru+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b8f1038662695d3f9f8e3427decdad228e08302","infoHashBuffer":{"type":"Buffer","data":[91,143,16,56,102,38,149,211,249,248,227,66,125,236,218,210,40,224,131,2]},"announce":[],"urlList":[]}}