{"title":"Until the End of the World","uid":8420126,"size":16862900318,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5bb662412ede56c99d5dd252693d649040fce6ec&amp;dn=Until+the+End+of+the+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"augustinwinter","files":-1,"time":1367166825,"description":"From Wikipedia:\n\nUntil the End of the World (German: Bis ans Ende der Welt) is a 1991 drama science fiction film by the German film director Wim Wenders; the screenplay was written by Wenders and Peter Carey, from a story by Wenders and Solveig Dommartin. An initial draft of the screenplay was written by American filmmaker Michael Almereyda. Wenders, whose career had been distinguished by his mastery of the road movie, had intended this as the Ultimate Road Movie.\n\nThe film takes place in late 1999. India has an out-of-control nuclear satellite in orbit that is about to reenter the atmosphere at any time, contaminating large areas of the Earth. This has caused a massive panic, with everyone trying to flee the likely impact sites. Caught in a traffic jam, impatient and disconnected Claire Tourneur (Solveig Dommartin) escapes the highway congestion by taking a side road. Her dashboard computer system announces she left the map zone database and is on her own. She then has a couple of odd encounters, first with a pair of bank robbers (which leaves her with a large amount of cash), then with a hitchhiker being pursued by an armed party. Claire discovers, after falling in love with the enigmatic fugitive, that he is the son of a scientist (played by Max von Sydow), and has absconded with the prototype of a secret research project. Multiple government agencies and freelance bounty hunters are chasing him to recover the device.\n\nAs the chase moves across the globe, the nuclear satellite is shot down, causing an EMP effect that wipes out all unshielded electronics worldwide. The characters wind up in a cave in the Australian Outback, where the recordings are played back. After the death of the hitchhiker's mother, his scientist father discovers a way to use the device to record human dreams. Several characters become addicted to viewing their own dreams, while Claire's estranged lover, a novelist, remains unaffected. He writes a novel about the adventure, which ultimately rescues Claire from her addiction to the device, via the power of words.\n\nVideo:720 x 576; direct DVD rip to MKV container, no recompression.\n\nAudio: English\n\nSubtitles: English for French and Japanese dialogue.\n\nLength: 279 minutes over three parts.","torrent":{"xt":"urn:btih:5bb662412ede56c99d5dd252693d649040fce6ec","amp;dn":"Until+the+End+of+the+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bb662412ede56c99d5dd252693d649040fce6ec","infoHashBuffer":{"type":"Buffer","data":[91,182,98,65,46,222,86,201,157,93,210,82,105,61,100,144,64,252,230,236]},"announce":[],"urlList":[]}}