{"title":"Yask Agirov x2 (Bulgarian Gypsy Clarinet)","uid":4832806,"size":90810688,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5d259f1a6f725962aa9d9bdfe9643634cc95f082&amp;dn=Yask+Agirov+x2+%28Bulgarian+Gypsy+Clarinet%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1239201271,"description":"Yasko Agirov - Yasko\nFormat / Calitate: MP3 128 kbps\nMÃ„Æ’rime: 43 Mb\n\nYASKO is the first recording commercially available by the Bulgarian clarinet master Yasko Argirov accompanied by his band. Produced by Nikola Parov (Zsaratnok, Marta Sebestyen, Muszikas) who also plays in the recording this recording makes it clear why Argirov has such high consideration in his homeland.\n\nYasko Agirov - Bavno makedonsko i Cocek\nYasko Agirov - Ciganski cocek\nYasko Agirov - Graovsko horo\nYasko Agirov - Karsilama\nYasko Agirov - Kopanica\nYasko Agirov - Rumanian tune\nYasko Agirov - Sirto\nYasko Agirov - Sopska rucenica\nYasko Agirov - Strandjanska rucenica\nYasko Agirov - Strandjanski mohabet\nYasko Agirov - Taxim i Oriental cocek\nYasko Agirov - Trakijsko horo \n\nMusicians:\nYasko Argirov clarinet\nIliya Argirov drum Kit\nSlavtcho Lambov accordion\nAngel Lambov saxophone\nDimitar Draganov (Jimi) electric guitar\nIvan Barvich kontra tambura\nNikola Parov tapan, dumbek, percussion, acoustic guitar\nRecorded, mixed and mastered at Ethnic Studio - Budapest (Hungary) 1999\nProduced by Nikola Parov \n\n\n\nYasko Agirov - Hot Blood\nFormat / Calitate: MP3 128 kbps\nMÃ„Æ’rime: 44,4 Mb\n\nMore hot music from the Bulgarian clarinetist and his phenomenal band. Big bonus is that the CD includes 15 minutes of informal and concert performance footage (including a wonderful if brief duet with accordionist Slavko Lambrov) and some chat with the artists.\n\nYasko Agirov - Cocek\nYasko Agirov - Gorbet\nYasko Agirov - Kasapsko\nYasko Agirov - Majcina taga\nYasko Agirov - Pazardzijsko horo\nYasko Agirov - Smeseno horo\nYasko Agirov - Sopsko horo\nYasko Agirov - Srpsko kolo\nYasko Agirov - Tamba\nYasko Agirov - Trakijska rucenica\nYasko Agirov - Turkish dance \n\nMusicians:\nYasko Argirov, clarinet\nIliya Argirov, drums\nSlavtcho Lambov, accordeon\nAngel Lambov, alto sax\nDanko Kristef, keyboard\nMaksim Nicolu, voice (track #8)\n\n\n\nNotes/quotes:\n\n&quot;Yasko&quot; - Nilola Parov writes in the linear notes of the CD:\nFor nearly a decade a living legend has been in the making in a remote region, practically unknown to us in the West: Yasko Argirov, poet of the clarinet. Born and based in the village of Brestovitza - Central Bulgaria - for more than 25 years he has been working to satisfy that most essential need of hard working country people: Entertainment.\nHailing from a musical family, since the age of ten Yasko has provided music for countless weddings, christenings, funerals and other events. At the age of twenty he was already the best known player in the region. Of gypsy origin he has managed, even during the hard times of the communist era when racial discrimination was rife, to hold on to his dignity thanks to a combination of great natural intelligence and incredible charisma. It is no exaggeration to say that Yasko holds the key to one of the most important secrets in life: how to cheer people up or bring tears to their eyes. His playing draws on a wealth of different traditions, not only those of his people, the gypsies, but of every ethnic subgroup of his country whether it be Greek, Macedonian, Turkish. Rumanian, Serb or Bulgarian.\nJust mentioning the word Yasko anywhere in Bulgaria, is enough to bring a smile to people's faces and evoke pleasant memories in their eyes.\nYasko has never been a high-flyer or big money-maker, not has he striven to catch the attention of sensation-hungry producers for whom importing culture for Western consumers is simply a question of business. He has simply gone and done his own thing and put heart and soul into it: MUSIC. But talent, wisdom and modesty such as those possessed by Yasko are surely the recipe to have people queuing at your door. This album contains only a small fraction of his repertory. Listen to it and dream\n\n&quot;Hot Blood&quot; - Press release from the record label:\nYASKO ARGISOV, the Bulgarian clarinet virtuoso who first came to the public's attention in Western Europe with his 1999 debut &quot;Yasko&quot; (Dunya 8021), is now back in splendid form with a new album recorded in the studio during the Turin date of his Italian tour last summer. Hot Blood is sure to enthuse listeners who have warmed to Yasko's musicianship and humanity. Gradually Yasko's legend is now spreading beyond the bounds of his native land where he is renowned as one of the leading musicians of the Gypsy tradition, the core of much of the music of the Balkans. &quot;Hot Blood&quot; is a collection of traditional tunes given an imaginative overhaul by ARGIROV himself. Famous Bulgarian rhythms and melodies (from both the capital and outlying areas), gypsy dances and Thracian dance music are interwoven with pieces of Turkish or Serbian origin, creating a powerful mÃƒÂ©lange where instrumental improvisation plays a key role in reshuffling the cards and injecting the music with a dose of the modern that rescues it from the dusty corridors of the folklore museum. Joyously lyrical, contemplative and spontaneous in the same moment, the sounds that erupt from ARGIROV's clarinet are the fruit of a passionate exploration of Bulgarian tradition begun when he was still a child born into a family for whom music was as important as breathing. ARGIROV learned his trade playing at wedding parties and other local festivals; a school of life and art that has led directly to the ears of the &quot;educated&quot; listener without having to hitch a ride on some dubious marketing bandwagon. ARGIROV has always said that his main inspiration is a desire to delight and entertain, but the resulting music is much more than mere entertainment and stands as a testimony to the clarinettist's ability to bring past and present into perfect harmony. Hot Blood includes 15 minutes of live video concert footage in which ARGIROV, among other things, tells of his friendship and artistic partnership with the accordionist Slavko Lambrov, who plays alter-ego to him on this top quality recording.","torrent":{"xt":"urn:btih:5d259f1a6f725962aa9d9bdfe9643634cc95f082","amp;dn":"Yask+Agirov+x2+%28Bulgarian+Gypsy+Clarinet%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d259f1a6f725962aa9d9bdfe9643634cc95f082","infoHashBuffer":{"type":"Buffer","data":[93,37,159,26,111,114,89,98,170,157,155,223,233,100,54,52,204,149,240,130]},"announce":[],"urlList":[]}}