{"title":"Star Force Series (full) B. V. Larson","uid":7247646,"size":3458665,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5eb6fb78aa5438d15267676eebd11fbebe3a5ede&amp;dn=Star+Force+Series+%28full%29+B.+V.+Larson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AvianFlu","files":9,"time":1336348586,"description":"BOOK 1: SWARM is the story of Earth's annexation by an alien empire. Long considered a primitive people on a backwater planet, humanity finds itself in the middle of a war, and faced with extinction. SWARM is an 88,000 word novel of science fiction by bestselling author B. V. Larson. \n\nBOOK 2: EXTINCTION is the story of Earth's entry into an interstellar war between living creatures and machines. To buy the peace, we've signed up with the machines.... EXTINCTION is an 111,000 word novel of science fiction by bestselling author B. V. Larson. \n\nBOOK 3: REBELLION is the turning point in the great interstellar war between all living creatures and the machines. Star Force is on the side of the machines--but for how long?\n\nIn the third book of the Star Force series, Kyle Riggs learns just what kind of war Earth is caught up in. At the mercy of the Macros, his marines fight against new alien races, big and small. They battle the innocent and the vile alike, until their situation becomes grim.\n\nBOOK 4: CONQUEST In the fourth book of the Star Force series, Kyle Riggs has freed Earth from the chains of the Macros--but at what cost? The Macros no longer trust him. He is a mad dog that must be put down--and all Star Force must be stamped out with him. The war expands in this story, and mankind is once again faced with annihilation.","torrent":{"xt":"urn:btih:5eb6fb78aa5438d15267676eebd11fbebe3a5ede","amp;dn":"Star+Force+Series+%28full%29+B.+V.+Larson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb6fb78aa5438d15267676eebd11fbebe3a5ede","infoHashBuffer":{"type":"Buffer","data":[94,182,251,120,170,84,56,209,82,103,103,110,235,209,31,190,190,58,94,222]},"announce":[],"urlList":[]}}