{"title":"Mannheim Steamroller - Christmas Extraordinaire - [FLAC]","uid":7903523,"size":481731765,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5f1f6d07f9f06a0df629bc4f017f767224e9563b&amp;dn=Mannheim+Steamroller+-+Christmas+Extraordinaire+-+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Macport","files":-1,"time":1355020365,"description":"Chip Davis's Mannheim Steamroller hasn't lost any ground in the six years since their last Yuletide offering. Christmas Extraordinare is another innovative and heartfelt collection of seasonal treasures played on a combination of 18th-century instruments and modern-day synthesizers, drums, and electric guitars. While not the first to marry different ages of musical instruments, Davis and his cohorts use them with imagination and an intensity that gives new life and drama to this rather inert genre. For material, Mannheim Steamroller asked their fans to choose their favorite holiday selections and vote on their Web site. The results of the poll are a fine mix of old and new--with slightly more emphasis on the modern--ranging from the bracing &quot;Fum, Fum, Fum,&quot; a traditional Catalan carol, to Tchaikovsky's &quot;Faeries&quot; from The Nutcracker. Mannheim Steamroller imbues this beloved song with an almost militaristic edge, grounding it with an ominous tuba that gives the usually fey &quot;Dance of the Sugar Plum Fairies&quot; an edgy tension. &quot;Winter Wonderland&quot; is a spectacular work, bordering on prog rock, as if Emerson, Lake &amp; Palmer had re-formed to whip up a winter blizzard gone amok. While most of the Mannheim Steamroller's Christmas albums are largely instrumental, Davis has employed the considerable talents of University of Michigan's Glee Club to sing on &quot;O Tannenbaum,&quot; respectfully fading their elegant, full vocals around the pristine voice of Johnny Mathis, elevating this German carol to a cinematic peak. Don't miss out on the clever liner notes, which give the reader a whimsical, anecdotal history of the 12 songs.","torrent":{"xt":"urn:btih:5f1f6d07f9f06a0df629bc4f017f767224e9563b","amp;dn":"Mannheim+Steamroller+-+Christmas+Extraordinaire+-+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1f6d07f9f06a0df629bc4f017f767224e9563b","infoHashBuffer":{"type":"Buffer","data":[95,31,109,7,249,240,106,13,246,41,188,79,1,127,118,114,36,233,86,59]},"announce":[],"urlList":[]}}