{"title":"Melgounov-Red Terror in Russia(eye-witness report of Cheka terro","uid":5217573,"size":2590746,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f7c037e17d2f5ea93ffd396d77cc9471f2e6f46&amp;dn=Melgounov-Red+Terror+in+Russia%28eye-witness+report+of+Cheka+terro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1260806932,"description":"This is Sergey Petrovich Melgounov's shocking book The Red Terror in Russia (1975) which is a classic eye-witness report which clearly describes what is liable to occur in any country which dispenses completely with the rule of law. Originally published in 1926 by this Russian historian and emigre during the years 1923 and 1924, it thoroughly documents the gruesome tortures and mass murders committed by the Bolshevik &quot;Extraordinary Commission&quot; (Che-Ka) during the so-called &quot;Red Terror.&quot; There are 15 photographs depicting murder victims, the murderers themselves (including women) and other niceties such as &quot;human gloves&quot; (flayings of human hands) and an execution cell floor &quot;littered with chips of skull, clots of brain, etc.&quot; The atrocities described within are so depraved and inhuman that it defies the imagination. One of the most bizarre examples of torture was practiced by the Kiev Che-Ka. After a victim was bound, an iron tube was clamped to his torso and then a rat was inserted into the other end and closed off with wire netting. The tube was then held over a flame until the rat became so maddened that it began gnawing through the victim's guts in an effort to escape the heat. This torture could last for hours - sometimes all through the night into the following day, and in any event until the victim died. This is just the tip of the iceberg. In pursuit of utopia and their glorious 'new' world, the Communists felt any amount of barbarism was justified, which is why they set the record for mass murder in the 20th century, sending nearly 100 million people to their deaths. The Red Terror in Russia is the perfect book to counter the &quot;useful idiots&quot; who still believe in the myth of the &quot;Good Czar Lenin&quot; and continue to spread propaganda about the &quot;Great Socialist October Revolution.&quot; Melgounov's descriptions, culled from contemportary writings and from his own experiences, reveal to what unfathomable depths of depravity a cornered criminal class will descend, as it seeks to avoid the retribution that is its due. 295 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:5f7c037e17d2f5ea93ffd396d77cc9471f2e6f46","amp;dn":"Melgounov-Red+Terror+in+Russia%28eye-witness+report+of+Cheka+terro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f7c037e17d2f5ea93ffd396d77cc9471f2e6f46","infoHashBuffer":{"type":"Buffer","data":[95,124,3,126,23,210,245,234,147,255,211,150,215,124,201,71,31,46,111,70]},"announce":[],"urlList":[]}}