{"title":"AT LENINGRAD'S GATES: The Combat Memoirs of a Soldier with Army","uid":8603170,"size":2242617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60c80a3543167e679b8c89fac8a702fd35540510&amp;dn=AT+LENINGRAD%27S+GATES%3A+The+Combat+Memoirs+of+a+Soldier+with+Army+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"candymancan","files":1,"time":1371937904,"description":"This is the remarkable story of a German soldier who fought throughout World War II, rising from conscript private to captain of a heavy weapons company on the Eastern Front.\n\nWilliam Lubbeck, age 19, was drafted into the Wehrmacht in August 1939. As a member of the 58th Infantry Division, he received his baptism of fire during the 1940 invasion of France. The following spring his division served on the left flank of Army Group North in Operation Barbarossa. After grueling marches admidst countless Russian bodies, burnt-out vehicles, and a great number of cheering Baltic civilians, Lubbeck's unit entered the outskirts of Leningrad, making the deepest penetration of any German formation. \n\nThe Germans suffered brutal hardships the following winter as they fought both Russian counterattacks and the brutal cold. The 58th Division was thrown back and forth across the front of Army Group North, from Novgorod to Demyansk, at one point fighting back Russian attacks on the ice of Lake Ilmen. Returning to the outskirts of ","torrent":{"xt":"urn:btih:60c80a3543167e679b8c89fac8a702fd35540510","amp;dn":"AT+LENINGRAD%27S+GATES%3A+The+Combat+Memoirs+of+a+Soldier+with+Army+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60c80a3543167e679b8c89fac8a702fd35540510","infoHashBuffer":{"type":"Buffer","data":[96,200,10,53,67,22,126,103,155,140,137,250,200,167,2,253,53,84,5,16]},"announce":[],"urlList":[]}}