{"title":"EXPLOITED COLLEGE GIRLS - Ravenna - Her First Multiple Orgasms","uid":9128477,"size":1342854097,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:63009f29037213db397d8a96c9fc454c9a10cb9f&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Ravenna+-+Her+First+Multiple+Orgasms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beta2008x","files":1,"time":1383269133,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=yz9bj_rvn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=yz9bj_rvn.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=rkhq7_ecg_13_10_31_ravenna.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=rkhq7_ecg_13_10_31_ravenna.jpg&lt;/a&gt;\n\nThis 19 year old checks all the boxes: tall and leggy, nearly perfect body, gives great head, loves to fuck and orgasms easily. On top of all that, she's a genuinely fun (if slightly geeky) and totally down to earth girl next door. Of course, if there was a girl like this who lived next door to me, I never would have started the site because I'd never leave my house. Ravenna (not her real name, mind = blown, amirite???) made it to me from far off Chicago, which means she's got that classic 'da bears' accent. Normally I find accents objectionable, but for some reason on this girl it's adorable. Actually, almost everything about her is adorable from her long legs to her tight little camel toe pussy to her perky B cups to her near perfect bubble butt. As she strips and tries on a few outfits, we get started with the interview and learn a little about our midwest import. I think she talks about her hopes and dreams and stuff, but the only thing I remember is that she informs me that she loves to give head and has had enough practice to consider herself an expert. As loyal fans know, this is a claim I never let pass without putting it to the test, so I have her drop to her knees and wrap her big smile around my dick. Turns out she is indeed an expert and I eventually have to pull out before I end up blowing my load. We move to the bedroom for the main event and while I try to continue with the interview, Ravenna is already rubbing her puss in anticipation of getting fucked, so I cut the chit chat short and have her strip. Turns out she's already wet and ready to go, so when I get busy with my fingers it hardly takes anytime at all to bring her to her first (of many) orgasms. This girl is really dynamite. After getting her off I want more of her fantastic oral so I have her drop to her knees again to suck my cock. She's been telling me since we met that she really just wants to get fucked, so after she gets me hard I let her have it. She does NOT disappoint. I try all of my favorite positions and she orgasms in every one of them. I get her on her back, I pound her face down, and I even have her ride me and she cums over and over. Finally I can't hold out any more, so I get her back to her knees and coat her face in my cum in a near perfect facial. ","torrent":{"xt":"urn:btih:63009f29037213db397d8a96c9fc454c9a10cb9f","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Ravenna+-+Her+First+Multiple+Orgasms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63009f29037213db397d8a96c9fc454c9a10cb9f","infoHashBuffer":{"type":"Buffer","data":[99,0,159,41,3,114,19,219,57,125,138,150,201,252,69,76,154,16,203,159]},"announce":[],"urlList":[]}}