{"title":"Commandos 3 Destination Berlin Portable - [Espera]","uid":6730526,"size":1527297614,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:645ad7b82a99ce10031cdc1ecf5b65921fb4ae6c&amp;dn=Commandos+3+Destination+Berlin+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1318120904,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Commandos 3 Destination Berlin 1 Click.exe&quot; the game will start, then minimize, click the tab to go to full screen and play normally.\n3.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nCommandos 3: Destination Berlin is the fourth installment of the critically acclaimed Commandos series. It is developed by Pyro Studios and published by Eidos Interactive. Gonzo Suarez, who wrote the previous installments, was not involved in this project, having left Pyro Studios. The game is the first in the series to use a true 3D engine, and the last to use real-time tactics before being converted to a first-person shooter genre.\nThe game contains very similar gameplay to the previous games, with the similar 'point and click' approach. However, it has fewer hotkeys compared to the previous instalment, and the user has to press buttons at the bottom of the screen on the action bar.\n\nAs in Commandos 1 and 2, you are able to see all enemies on the map, follow their movements, and make attacks depending on their behavior. There are a few differences, such as the addition of an 'Assault Rifle' - a weapon less powerful than a rifle, but more powerful than a pistol. Also, all units are able to use weapons such as the grenade, rather than just the Sapper as in previous games. The previous &quot;knapsack&quot; setup, simply showing a picture of all the items the currently selected commando has in his possession, superimposed over a picture of a rucsac, has been abandoned in favor of a &quot;box&quot;. When the inventory is selected, there are multiple blocks to put items in, such as grenades (1 block), pistols (1 block), rifles (4 blocks horizontal), enemy uniforms (4 blocks square), sub-machineguns (4 blocks square) and time-bombs (2 blocks horizontal).\n\nWhen searching enemies bodies or supply crates, a similar, but smaller box is shown for their capacity. Commandos such as the green beret or spy, who in earlier games have only been armed with the regulation pistol, can now use almost all the small arms available, except for the sniper rifle. While adding realism (the commandos are no longer useless outside their area of expertise), some players complain that this robs the commandos of their individual roles within the group, making them more generic. This does however, make the missions less linear, because the same job can done by different commandos.\n\nThe new &quot;cover mode&quot; ability allows the player to leave commandos waiting at a door or behind cover (this mode was also available in Commandos 2-Men of Courage) ready to shoot at any enemy that comes within range, often with more accuracy than when controlled manually. This gives the option of ambushes, and more defensive tactics.\n\nInstead of the previous, long, single campaign, this game is broken down into 3 campaigns: Central Europe, Normandy and Stalingrad; each containing a various amount of missions, some shorter than others. Each campaign has different players involved but not all.\n\nUnlike the earlier instalments, Destination Berlin has a time limit on most missions.\n\nMinimum System Requirements\n\nSystem:\n    Pentium III 700MHz or equivalent\nRAM:\n    128 MB\nVideo Memory:\n    32 MB\nHard Drive Space:\n    2000 MB\n\nRecommended System Requirements\n\nSystem:\n    Pentium 4 2GHz or equivalent\nRAM:\n    512 MB\nVideo Memory:\n    128 MB\n\n","torrent":{"xt":"urn:btih:645ad7b82a99ce10031cdc1ecf5b65921fb4ae6c","amp;dn":"Commandos+3+Destination+Berlin+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"645ad7b82a99ce10031cdc1ecf5b65921fb4ae6c","infoHashBuffer":{"type":"Buffer","data":[100,90,215,184,42,153,206,16,3,28,220,30,207,91,101,146,31,180,174,108]},"announce":[],"urlList":[]}}