{"title":"dupeGuru Music Edition 5.6.0-serial incl(duplicate remover)","uid":4921125,"size":9806379,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:65acf25d1e10a52c70daa02b5518d5bf9695fcf8&amp;dn=dupeGuru+Music+Edition+5.6.0-serial+incl%28duplicate+remover%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmb2012","files":2,"time":1243665730,"description":"dupeGuru Music Edition 5.6.0(ME for short) is a tool to find duplicate songs in your music collection. It can scan filenames, tags or contents. dupeGuru ME is a big brother of dupeGuru. It does everything dupeGuru does, but it has more information columns (such as bitrate, duration, tags, etc..) and more scan types (filename with fields, tags and audio content). dupeGuru ME runs on Windows and Mac OS X.\n\ndupeGuru ME is efficient. Find your duplicate files in minutes, thanks to its quick fuzzy matching algorithm. dupeGuru ME not only finds filenames and tags that are the same, but it also finds similar ones. For example, with the right settings, dupeGuru ME can determine that &quot;The White Stripes - Seven Nation Army&quot; and &quot;White Stripe - Seven Nation Armies&quot; are duplicates.\n\ndupeGuru ME is customizable. You can tweak its matching engine to find exactly the kind of duplicates you want to find. The Preference page of the help file lists all the scanning engine settings you can change.\n\ndupeGuru ME is safe. Its engine has been especially designed with safety in mind. Its reference directory system as well as its grouping system prevent you from deleting files you didn't mean to delete.\n\ndupeGuru ME rocks. With support for MP3, WMA, AAC (iTunes format), OGG, FLAC, loss-less AAC and loss-less WMA, we can say that it got music built-in. Therefore, it rocks.\n\nDo whatever you want with your duplicates. Not only can you delete duplicates files dupeGuru ME finds, but you can also move or copy them elsewhere. You can also easily weed the bad duplicates out, thanks to the Power Marker.\n\nRequirements\n\n    * Windows: 2k/XP/Vista.","torrent":{"xt":"urn:btih:65acf25d1e10a52c70daa02b5518d5bf9695fcf8","amp;dn":"dupeGuru+Music+Edition+5.6.0-serial+incl%28duplicate+remover%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65acf25d1e10a52c70daa02b5518d5bf9695fcf8","infoHashBuffer":{"type":"Buffer","data":[101,172,242,93,30,16,165,44,112,218,160,43,85,24,213,191,150,149,252,248]},"announce":[],"urlList":[]}}