{"title":"All Roads Lead Home by Diane Greenwood Muir","uid":9684004,"size":476631,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65eac902e422d8bdf0301fc67be9489636779a64&amp;dn=All+Roads+Lead+Home+by+Diane+Greenwood+Muir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1393720424,"description":"\nPolly Giller returned to Iowa from Boston to start a new life, not that her old one was all that bad. With her inheritance, she purchased an old school building in Bellingwood and is in the middle of renovating it when the bones of two bodies are pulled out of a ceiling.\n\nThe whole town knows who those bones belong to, but when she also finds crates and crates of items from the sixties through the early nineties in the old root cellar, they wonder if the two things are connected.\nA welcoming committee shows up at Polly's front door and these women soon become her fast friends. Fortunately, the leader of the group is married to the Sheriff and he is there to make sure mysteries are solved and everyone stays safe, but when Polly's old boyfriend from Boston shows up, that becomes a little more difficult.\n\nThe women might be a little older than Polly, but she finds out they might be even more wild than the friends she had when living back east. Lydia Merritt, the Sheriff's wife, is a woman filled with love and passion. Beryl Watson is an artist and more than a little flamboyant. Andy Saner wants to organize and label the world, but loves with a great big heart and Sylvie Donovan, with her two young sons is trying to make it as a single mother.\n\nThe men in Polly's world are just as interesting. Henry Sturtz is the carpenter and contractor in charge of construction and might have a little crush on his boss, while Doug Randall and Billy Endicott are her Jedi Knights in Shining Armor.\nPolly's immediate family might be gone, but her new family offers a great deal of love, fun and entertainment.\n\nGenre: Mystery","torrent":{"xt":"urn:btih:65eac902e422d8bdf0301fc67be9489636779a64","amp;dn":"All+Roads+Lead+Home+by+Diane+Greenwood+Muir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65eac902e422d8bdf0301fc67be9489636779a64","infoHashBuffer":{"type":"Buffer","data":[101,234,201,2,228,34,216,189,240,48,31,198,123,233,72,150,54,119,154,100]},"announce":[],"urlList":[]}}