{"title":"Black Moon - Enta da Stage (1993) - (iTunes Rip)","uid":10235679,"size":119420029,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:670e60756a995f88eb0ca7cda8f88d7a6aa9e112&amp;dn=Black+Moon+-+Enta+da+Stage+%281993%29+-+%28iTunes+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"A7XmattA7X","files":14,"time":1401174295,"description":"Enta da Stage is the debut album of American East Coast hip hop group Black Moon, released on October 19, 1993 through Nervous Records. The album was produced by DJ Evil Dee and Mr. Walt of Da Beatminerz. Enta da Stage features the debut of underground hip hop duo Smif-n-Wessun, as well as appearances from Havoc of Mobb Deep and Dru Ha, the co-founder of Duck Down Records.\n\nDespite being critically acclaimed and having two singles that charted on the Billboard Hot 100 (&quot;Who Got da Props?&quot; and &quot;I Got Cha Opin&quot;), the album sold poorly, and is often overlooked in favor of subsequent East Coast albums such as Enter the Wu-Tang (36 Chambers), Illmatic, Ready to Die, Only Built 4 Cuban Linx..., and The Infamous. Nonetheless, Enta da Stage preceded those releases and served as a precursor to the resurgence of the New York hip hop scene in the mid-1990s.\n\n\n#\tTitle\tSongwriters\tProducer(s)\tPerformer(s)\tSamples[12]\n1\t&quot;Powaful Impak!&quot;\tEwart Dewgarde, Kenyatta Blake\tDJ Evil Dee of Da Beatminerz, Buckshot\tBuckshot\t\n&quot;Hard Times&quot; by Baby Huey\n&quot;Scenario&quot; by A Tribe Called Quest\n2\t&quot;Niguz Talk Shit&quot;\tEwart Dewgarde, Kenyatta Blake\tDJ Evil Dee of Da Beatminerz\tBuckshot\t\n&quot;Bitches Brew&quot; by Miles Davis\n3\t&quot;Who Got da Props?&quot;\tEwart Dewgarde, Kenyatta Blake\tDJ Evil Dee of Da Beatminerz\tBuckshot\t\n&quot;Sport&quot; by Lightnin Rod\n&quot;It's a New Day&quot; by Skull Snaps\n&quot;Tidal Wave&quot; by Ronnie Laws\n&quot;Fantastic Freaks at the Dixie&quot; by Grand Wizard Theodore\n4\t&quot;Ack Like U Want It&quot;\tEwart Dewgarde, Walt Dewgarde, Kenyatta Blake, Kasim Reid\tDJ Evil Dee &amp; Mr. Walt of Da Beatminerz\tBuckshot, 5 ft\t\n&quot;Tell Me How Do You Feel&quot; by Lee Michaels\n&quot;Son of Mr. Greene Genes&quot; by Frank Zappa\n5\t&quot;Buck Em Down&quot;\tEwart Dewgarde, Kenyatta Blake, Larry Mizell\tDJ Evil Dee of Da Beatminerz\tBuckshot\t\n&quot;Hihache&quot; by Lafayette Afro Rock Band\n&quot;Wind Parade&quot; by Donald Byrd\n6\t&quot;Black Smif-n-Wessun&quot;\tEwart Dewgarde, Tekomin Williams, Kenyatta Blake, Darrell Yates\tDJ Evil Dee of Da Beatminerz\tTek, Buckshot, Steele\t\n&quot;Misdemeanor&quot; by Ahmad Jamal\n&quot;Spinning Wheel&quot; by Lonnie Smith\n7\t&quot;Son Get Wrec&quot;\tKasim Reid, Ewart Dewgarde\tDJ Evil Dee of Da Beatminerz\t5 ft\t\n&quot;Message from the Soul Sisters&quot; by Myra Barnes\n&quot;Sport&quot; by Lightnin Rod\n&quot;Oblighetto&quot; by Brother Jack McDuff\n&quot;Season of the Witch&quot; by Mike Bloomfield, Al Kooper and Steve Stills\n8\t&quot;Make Munne&quot;\tWalt Dewgarde, Kenyatta Blake\tMr. Walt of Da Beatminerz\tBuckshot\n9\t&quot;Slave&quot;\tEwart Dewgarde, Kenyatta Blake\tDJ Evil Dee of Da Beatminerz\tBuckshot\t\n&quot;Rule of Mind&quot; by 9th Creation\n10\t&quot;I Got Cha Opin&quot;\tWalt Dewgarde, Kenyatta Blake\tMr. Walt of Da Beatminerz\tBuckshot\t\n&quot;Come Live with Me&quot; by Ten Wheel Drive\n11\t&quot;Shit Iz Real&quot;\tEwart Dewgarde, Kenyatta Blake\tDJ Evil Dee of Da Beatminerz\tBuckshot\t\n&quot;Ridin' High&quot; by Faze-O\n&quot;Love Song to Catherine&quot; by John Klemmer\n12\t&quot;Enta da Stage&quot;\tWalt Dewgarde, Kenyatta Blake, Ernie Watts, Fredro Scruggs, Kirk Jones, Tyrone Taylor, Marlon Fletcher\tMr. Walt of Da Beatminerz\tBuckshot\t\n&quot;It's a New Day&quot; by James Brown\n&quot;Eye of the Cosmos&quot; by Cannonball Adderley\n&quot;Spinning Wheel&quot; by Lonnie Smith\n&quot;Shifftee&quot; by Onyx\n&quot;Journey in Satchidananda&quot; by Alice Coltrane\n13\t&quot;How Many MC's...&quot;\tEwart Dewgarde, Walt Dewgarde, Kenyatta Blake, Grover Washington Jr.\tDJ Evil Dee &amp; Mr. Walt of Da Beatminerz\tBuckshot\t\n&quot;Hydra&quot; by Grover Washington, Jr.\n&quot;Nice Girl&quot; by Kellee Patterson\n&quot;My Philosophy&quot; by Boogie Down Productions\n14\t&quot;U da Man&quot;\tEwart Dewgarde, Kasim Reid, Drew Friedman, Kejuan Muchita, Tekomin Williams, Darrell Yates, Kenyatta Blake\tDJ Evil Dee of Da Beatminerz\t5 ft, Dru-Ha, Havoc, Tek, Steele, Buckshot\t\n&quot;Risin' to the Top&quot; by Keni Burke\n&quot;Get out of My Life, Woman&quot; by Lee Dorsey\n&quot;Ack Like U Want It&quot; was not on the cassette or the vinyl release.","torrent":{"xt":"urn:btih:670e60756a995f88eb0ca7cda8f88d7a6aa9e112","amp;dn":"Black+Moon+-+Enta+da+Stage+%281993%29+-+%28iTunes+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"670e60756a995f88eb0ca7cda8f88d7a6aa9e112","infoHashBuffer":{"type":"Buffer","data":[103,14,96,117,106,153,95,136,235,12,167,205,168,248,141,122,106,169,225,18]},"announce":[],"urlList":[]}}