{"title":"Spider-Man 3 - iPhone","uid":4580133,"size":618257159,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:6712eb02cf3c7f5e3f5631fa10e578d12f0254e6&amp;dn=Spider-Man+3+-+iPhone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aced6","files":1,"time":1229388941,"description":"Length:  2:13:26\nYear:    2007\nRating:  PG-13\nGenre:   Action &amp; Adventure\nSize:    603,767 KB\n\nSummary: \n\nPeter Parker has begun to feel secure in his life and plans to propose to Mary Jane. One night in a park, while Peter and Mary Jane are on a date, a small meteorite crashes nearby, and an alien symbiote oozes out, attaching itself to Peter's moped. Meanwhile, escaped convict Flint Marko falls into a particle accelerator, which fuses his body with the surrounding sand. The result allows him to shape shift at will, becoming the Sandman. Peter's best friend, Harry Osborn, who seeks vengeance for his father's death, which he believes Peter caused, attacks him. The battle leaves Harry with short-term amnesia, making him forget his vendetta\n\nNotes:\n\nSpider-Man 3 is a 2007 superhero film written and directed by Sam Raimi, with a screenplay by Ivan Raimi and Alvin Sargent. It is the third film in the Spider-Man film franchise based on the fictional Marvel Comics character Spider-Man. The film stars Tobey Maguire, Kirsten Dunst, James Franco, Thomas Haden Church and Topher Grace.\n\nThe film begins with Peter Parker basking in his success as Spider-Man, while Mary Jane Watson continues her Broadway career. Harry Osborn still seeks vengeance for his father's death, and an escaped convict, Flint Marko, falls into a particle accelerator and is transformed into a shape-shifting sand manipulator. An alien symbiote crashes to Earth and bonds with Peter, influencing his behavior for the worse. When the symbiote is abandoned, it finds refuge in Eddie Brock, Jr., a rival photographer, causing Peter to face his greatest challenge.\n\nSpider-Man 3 was commercially released in multiple countries on May 1, 2007, and released in the United States in both conventional and IMAX theaters on May 4, 2007 by Columbia Pictures. Although the film received generally mixed reviews from critics, in contrast to the previous two films' highly positive reviews, it stands as the most successful film in the series worldwide, as well as the second highest-grossing superhero film behind The Dark Knight.\n","torrent":{"xt":"urn:btih:6712eb02cf3c7f5e3f5631fa10e578d12f0254e6","amp;dn":"Spider-Man+3+-+iPhone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6712eb02cf3c7f5e3f5631fa10e578d12f0254e6","infoHashBuffer":{"type":"Buffer","data":[103,18,235,2,207,60,127,94,63,86,49,250,16,229,120,209,47,2,84,230]},"announce":[],"urlList":[]}}