{"title":"Alex Jones Show - 2013 Mar 12 TU [sebaygo1]","uid":8249377,"size":88118716,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:672d4b9a642a596d7c642dca2518ae9a65747084&amp;dn=Alex+Jones+Show+-+2013+Mar+12+TU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":13,"time":1363130238,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nTuesday, 12 Mar 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Tuesday, March 12 edition of the Alex Jones Show, Alex declares a victory of sorts as a recent Pew Research Center poll finds that a majority of Americans are becoming increasingly distrustful of the federal government -- a huge blow to the establishment's oversized ego. Alex also breaks down the groundwork being laid for possibly a third Bush presidency, with former Florida Gov. Jeb Bush not ruling out a 2016 run. \n\nOn today's show, Alex welcomes American attorney, columnist, lecturer, and author Jonathan W. Emord to analyze Whole Foods' decision to label their GMO foods and what it means on a wider scale.\n\nNote: As has become standard practice, when Alex has a guest who is an affiliate of his business partnership supplement manufacturer Youngevity, that guest is not mentioned in the official show description. Today Alex has naturopath Peter Glidden on as a guest in much of the 3rd hour and turns the show over to him 17 minutes into a full fourth hour. I only edited out the network commercial breaks in hour 4. If I had elided promos of Youngevity products and Glidden's books, there would not have been much left.\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n","torrent":{"xt":"urn:btih:672d4b9a642a596d7c642dca2518ae9a65747084","amp;dn":"Alex+Jones+Show+-+2013+Mar+12+TU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"672d4b9a642a596d7c642dca2518ae9a65747084","infoHashBuffer":{"type":"Buffer","data":[103,45,75,154,100,42,89,109,124,100,45,202,37,24,174,154,101,116,112,132]},"announce":[],"urlList":[]}}