{"title":"Constantine's Sword: The Church and the Jews, A History","uid":8889894,"size":4997030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:674d3af1f5080a8f28f644949ced38304c815eb6&amp;dn=Constantine%27s+Sword%3A+The+Church+and+the+Jews%2C+A+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1378513422,"description":"From Publishers Weekly\nPart history, part memoir, this hefty tome by novelist Carroll (Mortal Friends, etc.) traces the record of anti-Semitism and anti-Judaism in the Catholic Church, suggesting that centuries of animus culminated in the Holocaust. Carroll also traces the development of his own thinking about Judaism: as a Catholic seminarian, he knew no Jews and little about Judaism, except what he learned in classrooms, i.e., that Judaism had been superceded by Christ's new covenant. As a young priest at Boston U (which his colleagues disparagingly referred to as B-Jew, since so many Jews were enrolled), Carroll began to spend time with rabbis and Jewish students whose political and social commitments he found congenial. Eventually he left the priesthood; his increased discomfort with the Church's attitudes toward Judaism played no small part in that decision. But this book is more than guilty Catholic breast-beating. It also offers a sweeping look at instances of anti-Jewish sentiment throughout European history, from the blood libel to the Dreyfus affair, from the Inquisition to Auschwitz. Carroll offers fresh, provocative analysis, as in his discussion of the idea that the God of the Jews is a judgmental God concerned with law, whereas Jesus is about loveDa foundation of much anti-Semitism. Carroll argues that Jesus' emphasis on love was his most Jewish attribute. Carroll makes these incisive arguments in his characteristically vigorous prose; fans of An American Requiem, his National Book Award-winning memoir, won't be disappointed. This magisterial work will satisfy Jewish and Christians readers alike, challenging both to a renewed conversation with one another. (Jan.) Forecast: A Book-of-the-Month Club alternate selection, this book has a built-in market among Jewish and Catholic readers. Carroll is a columnist for the Boston Globe, so he has a dedicated readership there that will be boosted further by publicity appearances in that city and around the country. Two major events in the Boston area will kick off the book's publicity: a symposium at Brandeis and one at Harvard Divinity School, both featuring a discussion of the book by leading religious scholars.\n\nDownload Documentary Constantine's Sword Here:\n\n","torrent":{"xt":"urn:btih:674d3af1f5080a8f28f644949ced38304c815eb6","amp;dn":"Constantine%27s+Sword%3A+The+Church+and+the+Jews%2C+A+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"674d3af1f5080a8f28f644949ced38304c815eb6","infoHashBuffer":{"type":"Buffer","data":[103,77,58,241,245,8,10,143,40,246,68,148,156,237,56,48,76,129,94,182]},"announce":[],"urlList":[]}}