{"title":"Mark Hatmaker E-book Collection (No Holds Barred Fighting)","uid":8063013,"size":147405254,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67ba2448f45446e6b959c1fa24d28b665fca4e07&amp;dn=Mark+Hatmaker+E-book+Collection+%28No+Holds+Barred+Fighting%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"JinRohEX","files":-1,"time":1359127608,"description":"ABOUT THE AUTHOR:\nMark Hatmaker is the bestselling author of 13 titles including the No Holds Barred Fighting Series, the MMA Mastery Series, No Second Chance, and Boxing Mastery. He also has produced more than 150 instructional videos and is a columnist for Black Belt Magazine. His resume includes extensive experience in the Western combat arts including Old School Boxing and All-In Wrestling.\n\nBooks included in this torrent:\n1.\tBoxing Mastery: Advanced Technique, Tactics, and Strategies from the Sweet Science\n2.\tBoxing's Ten Commandments:  Essential Training for the Sweet Science\n3.\tMMA Mastery: Ground and Pound\n4.\tMore No Holds Barred Fighting: Killer Submissions\n5.\tNo Holds Barred Fighting, Savage Strikes, Complete Guide to Real World Striking for NHB Competition and Street Defense Martial Arts Self Defense\n6.\tNo Holds Barred Fighting: Take-downs: Throws, Trips, Drops and Slams for NHB Competition and Street Defense\n7.\tNo Holds Barred Fighting: The Book of Essential Submissions\n8.\tNo Holds Barred Fighting: The Kicking Bible: Strikes for MMA and the Street\n9.\tNo Holds Barred Fighting: The Ultimate Guide to Conditioning: Elite Exercises and Training for NHB Competition and Total Fitness \n10.\tNo Holds Barred Fighting: The Ultimate Guide to Submission Wrestling\n11.\tNo Second Chance: A Reality-Based Guide to Self-Defense\n","torrent":{"xt":"urn:btih:67ba2448f45446e6b959c1fa24d28b665fca4e07","amp;dn":"Mark+Hatmaker+E-book+Collection+%28No+Holds+Barred+Fighting%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67ba2448f45446e6b959c1fa24d28b665fca4e07","infoHashBuffer":{"type":"Buffer","data":[103,186,36,72,244,84,70,230,185,89,193,250,36,210,139,102,95,202,78,7]},"announce":[],"urlList":[]}}