{"title":"Lost in the Grooves: Scrams Capricious Guide to the Music You Mi","uid":8976933,"size":3475889,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:689498451da116e565544d7e08c6306ceaebe794&amp;dn=Lost+in+the+Grooves%3A+Scrams+Capricious+Guide+to+the+Music+You+Mi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KaavaBoT","files":2,"time":1380465651,"description":"Lost in the Grooves: Scrams Capricious Guide to the Music You Missed (PDF) LittleFairyRG\n &lt;a href=&quot;\nhttp://i.imgur.com/sEakJ89.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/sEakJ89.jpg&lt;/a&gt;\n\nPaperback: 296 pages\nPublisher: Routledge (November 6, 2004)\nLanguage: English\nISBN-10: 0415969980\nISBN-13: 978-0415969987\n\nFor the past 12 years, the L.A.-based magazine Scram has championed the work of musicians who might otherwise fly beneath the mainstream critical radar. Here, Scram co-editors Cooper and Smay display the sense of fun that distinguished their previous collection, Bubblegum Music Is the Naked Truth, in an immensely entertaining, informative and sometimes exasperating encyclopedia, in which more than 75 contributors offer over 250 entries (a series of &quot;miniature love letters&quot;) about their favorite artists and albums. With praise offered for works by Captain Beefheart alongside the Cowsills, no genre or artist is considered outside the sphere of this book   s interests: a sampling from the &quot;Ks&quot; includes late-   60s pop master Andy Kim, mid-   90s blues minimalist Junior Kimbrough, early-   70s conceptual art-rockers King Crimson and an overlooked 1971 masterpiece by the Kinks, Muswell Hillbillies, which influenced plenty an alt-country boy. While most of the albums and artists fall into the vast category that is pop music, there are also interesting offerings in the areas of Latin jazz (Cal Tjader), dub reggae (Scientist) and soul (Swamp Dogg). Spirited, knowledgeable writing by rockers (Meat puppets drummer Derrick Bostrom), novelists (Rick Moody and George Pelecanos) and a host of self-proclaimed music geeks might actually make you want to go out and buy Buckner &amp; Garcia   s Pac-Man Fever.\n\nReviews:\n\nLost in the Grooves is a genre-surfing Smithsonian of overlooked musical marvels. Without fetishizing obscurity for its own sake, the Guide sidesteps cynical cool vs. uncool upsmanship and celebrates castoffs -- by both the forgotten and the famous -- which exude trend-transcending merit. Each entry compels you to seek out the music. -- Irwin Chusid, WFMU DJ and author of Songs in the Key of Z: The Curious Universe of Outsider Music\n\nCaprice is everything, and SCRAM's lost grooves are a music geek's very heaven. The zinester spirit of lauding the officially uncool lives on in this eminently dip-worthy collection. -- Barney Hoskyns, author and editor of Rock's Backpages, The Online Library of Rock &amp; Roll\n\nKim Cooper and David Smay have scored again with their invaluable guide to the best sounds you've never heard. Impeccably researched, refreshingly subjective, they almost make being obscure as much fun as being rich and famous. Of course, they forgot to mention my band.. -- Blag Dahlia of The Dwarves\n\nScram is truly a resource for those musicians just outside the windows of top-forty-land, those songwriters and guitar slingers looking for an outlet for their own particular brand of art. Accordingly, Lost in the Grooves takes up where Scram leaves off -- a compilation of ruminations from 75 critics and music aficionados detailing their favorite slices of the scene... Lost in the Grooves is not a book for fans mad about one band or one particular singer. Instead, this is a book for the serious music fan, for those serious students of the art form curious about who-influenced-who and what sound rose out of what region. Like turning on a radio station and listening to a feverish wounded-voiced DJ tell you the reason behind every record you never heard, there's 20 new things to be learned on every page here\n. -- Electric Review\n\nWhat makes Lost in the Grooves a real groovy read is the honest passion its contributors exhibit for their lost-and-found faves. -- Mojo Magazine\n\nMusic trivia fans who enjoy the offbeat and odd get all the stories behind these selected notables-but-not-greats. Highly recommended. -- Bookwatch\n\nIf you download our uploads, please make sure you seed them till atleast 1:1 ratio. We all work very hard to get this stuff. We'll all greatly appreciate some help.","torrent":{"xt":"urn:btih:689498451da116e565544d7e08c6306ceaebe794","amp;dn":"Lost+in+the+Grooves%3A+Scrams+Capricious+Guide+to+the+Music+You+Mi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"689498451da116e565544d7e08c6306ceaebe794","infoHashBuffer":{"type":"Buffer","data":[104,148,152,69,29,161,22,229,101,84,77,126,8,198,48,108,234,235,231,148]},"announce":[],"urlList":[]}}