{"title":"Pride and Prejudice (BBC 1995) 720p H.264 6GB moviesbyrizzo","uid":7064099,"size":6108048827,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:689cef56c6041a75e59b2e6f3a023e4f15b53058&amp;dn=Pride+and+Prejudice+%28BBC+1995%29+720p+H.264+6GB+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1330450668,"description":"Jane Austen has always been a most favourite novelist! Her wit and candor\nhave always been truly impressive to those that come upon her in one way or\nanother.\n\ngreat 1280 X 720p DivX H.264 MKV at 2200k video bitrate  approx 320k audio\ngreat 6 channel sound for five of the episodes - episode three has dual channel\nstereo this time around and came from a different batch originally in this\nrespect only.\n\n \nOptional SRT subtitles found on the net and included here are in Dutch Italian\nSpanish Bulgarian and Russian (we don't have Russian subtitles for one of the\nepisodes however).\n\n\nPride and Prejudice is a wake-up call for those that choose to display\na tendency to hatefulness which they need not do, and which they can instead\ncontrol using their better instincts and judgment. This is true of the character\nof Mr. Darcy who nonetheless has his own idea of redeeming qualities I suppose,\nguided by the alluring Ms. Elizabeth. I find myself personally quite taken by \nMs. Charlotte who it appears is resigned to her lot in life absent of romantic\nfulfillment in what is an era concerned with security and comfort in the basics\nof life equally - or even more so perhaps.\n\nAs to the culture that saw many women as lower forms of beings in some respect\nif their families didn't match in attainment of wealth as similar levels to\nthe superior achievers, or who might be ostracized in all of their prospects for \nhappiness or fortune for the mishap of a single elopement in the family (and what\nhave you), thank goodness for progress in our world! It is an education indeed\nto hear British culture as practiced at the time described in the words used\nin plain fashion in this writing of Jane Austen most particularly I think -\namidst other such writers in any event.\n\nLets decide to equally render obsolete (anachronistic in respect of propriety)\nthe musings of Mr. Darcy who Miss Elizabeth describes as a man lacking true\nvirtue at the start in that he displays too much of a propensity to hate all\nthat he encounters rather than putting some more sense into his views as she\nthinks he might do instead.\n\nIn any event, her beauty and charm win the day as he is certainly won over in his\nefforts to improve himself morally in this respect.\n\nAll's well that ends well - A great story in perhaps what remains the most celebrated of novels ever written in the English language.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\nBy the way, whether its this series or the Upstairs Downstairs series\netc - the British have an unequaled mind for what is supremely \nbeautiful music to the ears around Europe I say!","torrent":{"xt":"urn:btih:689cef56c6041a75e59b2e6f3a023e4f15b53058","amp;dn":"Pride+and+Prejudice+%28BBC+1995%29+720p+H.264+6GB+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"689cef56c6041a75e59b2e6f3a023e4f15b53058","infoHashBuffer":{"type":"Buffer","data":[104,156,239,86,198,4,26,117,229,155,46,111,58,2,62,79,21,181,48,88]},"announce":[],"urlList":[]}}