{"title":"Killswitch Engage - Killswitch Engage (2009) V0","uid":4964644,"size":81913823,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ba7c7d86e5c1d62f89af55ce530dd927cf118ae&amp;dn=Killswitch+Engage+-+Killswitch+Engage+%282009%29+V0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxGravexx","files":11,"time":1245467470,"description":"Tracks\n\n01.Never Again 03:11\n02.Starting Over 03:53\n03.The Forgotten 03:20\n04.Reckoning 02:43\n05.The Return 04:31\n06.A Light in A Darkened World 02:53\n07.Take Me Away 02:48\n08.I Would Do Anything 03:25\n09.Save Me 03:49\n10.Lost 03:47\n11.This is Goodbye 04:18\n-----\n38:38 Min:Sec\n\nNotes\n\n&quot;This album will be the death of me,&quot; groans Killswitch\nEngage frontman Howard Jones as he sinks into a couch. The\nMassachusetts-based metal band has just finished work on\nits fourth album, and Jones is feeling a bit worked-over.\n&quot;There was nothing comfortable about it for any of us,&quot; he\nsays of making the record, most of which took place in\nAtlanta under the watchful eye of superproducer Brendan\nO'Brien (Bruce Springsteen, AC/DC, Pearl Jam), marking the\nfirst time Killswitch guitarist Adam Dutkiewicz has stepped\naside for an outside producer.\n\nOn first listen, things kick off in the established\nKillswitch fashion, as power-riffing guitars race alongside\ngalloping drums, but once Jones' voice joins the mix, it's\nevident where his strain comes from. O'Brien has pushed\nJones farther than he's gone before vocally, especially in\nthe clean singing department: every song sounds like he's\nswinging for the fences to get just the right epic chorus\nand turn the songs into sing-along anthems. But this time\naround, things are a little less upbeat.\n\n&quot;We're known for being a pretty positive band - we're\nalmost a self-help band,&quot; Jones says. &quot;I feel like Tony\nRobbins or something. We're known for anthems, but this\ntime I really tried to write from a different place. I've\ngot enough to draw on to write some stuff that can be dark.\nMaybe there's still a hint of positivity in it, but there\nare some songs on there that are not positive at all.&quot;\n\nJones says that the album - which will be self-titled and\nreleased on June 30th - will continue Killswitch's\nreputation as a stepping stone for listeners who are just\nstarting to explore the heavier side of things. The band\nhas made a trademark out of mixing its abrasiveness with\nlarge doses of melody, as well as for Jones' clean lyrical\nenunciation, even while screaming.\n\n&quot;With the amount of melody that's in Killswitch, it just\nmakes sense to try to enunciate and be clear, and a lot of\npeople pick up on that, people who don't normally listen to\nheavier music,&quot; he says. &quot;In a lot of ways, we can be a\ncool gateway band into heavier stuff. You'll start\nlistening to us, and a few months later, you could be\nlistening to Nile or Decapitated.&quot; - rollingstone.com","torrent":{"xt":"urn:btih:6ba7c7d86e5c1d62f89af55ce530dd927cf118ae","amp;dn":"Killswitch+Engage+-+Killswitch+Engage+%282009%29+V0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba7c7d86e5c1d62f89af55ce530dd927cf118ae","infoHashBuffer":{"type":"Buffer","data":[107,167,199,216,110,92,29,98,248,154,245,92,229,48,221,146,124,241,24,174]},"announce":[],"urlList":[]}}