{"title":"Natural Gas - Fuel for the 21st Century","uid":15060000,"size":10553232,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ca8d34e5cb895066ab51c2671e6f08e2bce0296&amp;dn=Natural+Gas+-+Fuel+for+the+21st+Century&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466756284,"description":"Natural Gas - Fuel for the 21st Century - Vaclav Smil (Wiley, 2015).pdf\r\n\r\nISBN 978-1-119-01286-3\r\n\r\nNatural gas is the world’s cleanest fossil fuel; it generates less air pollution and releases less CO2 per unit of useful energy than liquid fuels or coals. With its vast supplies of conventional resources and nonconventional stores, the extension of long-distance gas pipelines and the recent expansion of liquefied natural gas trade, a truly global market has been created for this clean fuel.\r\n\r\nNatural Gas: Fuel for the 21st Century discusses the place and prospects of natural gas in modern high-energy societies. Vaclav Smil presents a systematic survey of the qualities, origins, extraction, processing and transportation of natural gas, followed by a detailed appraisal of its many preferred, traditional and potential uses, and the recent emergence of the fuel as a globally traded commodity. The unfolding diversification of sources, particularly hydraulic fracturing, and the role of natural gas in national and global energy transitions are described. The book concludes with a discussion on the advantages, risks, benefits and costs of natural gas as a leading, if not dominant, fuel of the 21st century.\r\n\r\nThis interdisciplinary text will be of interest to a wide readership concerned with global energy affairs including professionals and academics in energy and environmental science, policy makers, consultants and advisors with an interest in the rapidly-changing global energy industry","torrent":{"xt":"urn:btih:6ca8d34e5cb895066ab51c2671e6f08e2bce0296","amp;dn":"Natural+Gas+-+Fuel+for+the+21st+Century","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ca8d34e5cb895066ab51c2671e6f08e2bce0296","infoHashBuffer":{"type":"Buffer","data":[108,168,211,78,92,184,149,6,106,181,28,38,113,230,240,142,43,206,2,150]},"announce":[],"urlList":[]}}