{"title":"Silverchair - Studio Discography (320kbps)","uid":7541024,"size":592994650,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6cfd3d8512e092315946845790e5a8287b7a1e69&amp;dn=Silverchair+-+Studio+Discography+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"piratetorrent1989","files":58,"time":1345216578,"description":"Silverchair were an Australian rock band, which formed in 1992 as Innocent Criminals in Merewether, Newcastle with the line-up of Ben Gillies on drums, Chris Joannou on bass guitar and Daniel Johns on vocals and guitars. The group got their big break in mid-1994 when they won a national demo competition conducted by SBS TV show Nomad and ABC radio station, Triple J. The band were signed by Murmur, and were successful on the Australian and international rock stages.\nAs from 2011, Silverchair have won a record number of 21 ARIA Music Awards from 49 nominations. The band have also received six APRA Awards with Johns winning three songwriting awards at the 2008 ceremony. All five of their studio albums have peaked at number-one on the ARIA Albums Chart: Frogstomp (1995), Freak Show (1997), Neon Ballroom (1999), Diorama (2002) and Young Modern (2007). Three of the group's singles have reached number-one on the related ARIA Singles Chart: &quot;Tomorrow&quot; (1994), &quot;Freak&quot; (1997) and &quot;Straight Lines&quot; (2007).\nSilverchair's alternate rock sound has evolved throughout their career, differing styles on specific albums steadily growing more ambitious over the years, from grunge on their debut to more recent work displaying orchestral and art rock influences. The songwriting and singing of Johns has improved steadily while the band has developed an increased element of complexity. In 2003, following the release of Diorama, the band announced a hiatus, during which time members recorded with side projects The Dissociatives, The Mess Hall, and Tambalane. Silverchair were reunited at the 2005 Wave Aid concerts, and, in 2007, they played the Across the Great Divide tour with contemporaries Powderfinger. In May 2011, Silverchair announced an indefinite hiatus. As from that month, the group have sold in excess of six million albums.\n\nAlbums:\n\nFrogstomp (1995)\nFreak Show (1997)\nNeon Ballroom (1999)\nDiorama (2002)\nYoung Modern (2007)","torrent":{"xt":"urn:btih:6cfd3d8512e092315946845790e5a8287b7a1e69","amp;dn":"Silverchair+-+Studio+Discography+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cfd3d8512e092315946845790e5a8287b7a1e69","infoHashBuffer":{"type":"Buffer","data":[108,253,61,133,18,224,146,49,89,70,132,87,144,229,168,40,123,122,30,105]},"announce":[],"urlList":[]}}