{"title":"Disney Kids Games 1 - 26in1 (AIO)","uid":4425502,"size":135799714,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6d11a149712650e273354db16679675aab2662a3&amp;dn=Disney+Kids+Games+1+-+26in1+%28AIO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"babblenoodle","files":2,"time":1223005854,"description":"Disney Kids Games 1 - 26in1 (AIO)\n\n\nbugout.exe\nBugs Life Burn  M.exe\nBugs Life Burn  Ma.exe\nCrocodile Projector.exe\nGrub Grabber.exe\nhide.exe\nhockey.exe\njoe_pc.exe\nJuncle Cubs.EXE\nkuzco.exe\nlion_king.exe\nMake Flubber.EXE\nMighty Ducks Puck Hunt.exe\nmowgli.exe\npanvs.exe\npixie.exe\npocohontas dress.exe\nquackgam.exe\nrescuer.exe\nSimba Jigsaw.exe\nspartapc.exe\nTARZAN.exe\ntink.exe\ntoobz.exe\nToy Story Match.EXE\ntrouble.exe\n\nWelcome to Timon &amp; Pumbaa&amp;#039;s Jungle Games. \n\nSTARTING TIMON AND PUMBAA&amp;#039;S JUNGLE GAMES\n\nBURPER\n\nYou can use the keyboard, mouse or joystick to play Burper.\n\nUsing the Default Keyboard Settings, press left and right arrow keys to move\nPumbaa left and right. Press the X key or spacebar to make Pumbaa burp.\nPress the up and down arrow keys for mondo burps.  Press the Z key and\nleft/right arrow key to produce a left/right tail swipe.\n\nUsing the Mouse, move Pumbaa left or right by moving the mouse left or right.\nClick the left mouse button to burp. Move the mouse up to mondo burp. Click\nthe right mouse button while moving the mouse left/right to produce a\nleft/right tail swipe.   \n\nUsing the Joystick, move Pumbaa left/right with the left/right axis.\nPress button 1 to burp.  The up/down axis produces mondo burps.\nA combination of button 2 and the left/right axis produces a left/right\ntail swipe.\n\nJUNGLE PINBALL\n\nYou can use the keyboard, mouse or joystick to play Pinball.\n\nUsing the Default Keyboard Settings, press z to move the left flipper and\npress / to move the right flipper. The up arrow key controls both flippers\nsimultaneously. Press Enter key to launch the ball. Press the Spacebar to\ntilt the game.\n\nUsing the Mouse, click the left mouse button to move the left flipper \nand click the right mouse button to move the right flipper. Press both mouse\nbuttons simultaneously to move both flippers. Press the right button or Enter\nkey to launch the ball. Press the Spacebar to tilt the game. \n\nUsing the Joystick, press button 1 to move the left flipper and button 2 to\nmove the right flipper.  The up axis controls both flippers simultaneously.\nButton 2 launches the ball. Down axis tilts the game. \n\nAddendum to the documentation:  You start with 5 pill bug balls instead of 3.\n\nSLINGSHOT\n\nUse the Mouse to play Slingshot.\n\nMove the mouse to aim at the target, then click the left mouse button \nto fire at your target.\n\nHIPPO HOP\n\nYou can use the keyboard or joystick to play Hippo Hop.\n\nUsing the Default Keyboard Settings, press the X key or Spacebar to make Timon\njump. Press the up arrow to make Timon jump forward. Press the down arrow to\nmake Timon jump backward.  Press the left/right arrow keys and the X key to make\nTimon jump left/right.  Press the left/right arrow keys to make Timon walk\nleft/right.  Pressing the Z key in conjunction with any of the above key\ncombinations accelerates Timon.\n\nUsing the Joystick, the up/down axis makes Timon jump forward/backward.\nThe left/right axis walks Timon left/right.  A combination of left/right axis\nand button 1 makes Timon jump left/right.  Pressing button 2 in conjunction with\nany of the above key combinations accelerates Timon.\n\nBUG DROP\n\nPlay as either Timon or Pumbaa. Timon is player 1 and Pumbaa is player 2.\n\nYou can use the keyboard or joystick to play Bug Drop. \n\nUsing the Default Keyboard Settings to control Timon, press the left and right\narrow keys to move the bug pair left and right.  The &lt; key rotates the bug pair\ncounterclockwise.  The &gt; key rotates the bug pair clockwise.  The down arrow key\nincreases the drop speed of the bug pair.\n\nUsing the Default Keyboard Settings to control Pumbaa, press the Z key and C key\nto move the bug pair left and right.  Press the 1 key to rotate the bug pair\ncounterclockwise.  Press the 2 key to rotate the bug pair clockwise.  The X key\nincreases the drop speed of the bug pair.\n\nUsing the Joystick for both Timon &amp; Pumbaa, the left and right axis moves the bug\npair left and right.  Press button 1 to rotate the bug pair counterclockwise. Press\nbutton 2 to rotate the bug pair clockwise.  The down axis increases the drop speed\nof the bug pair.","torrent":{"xt":"urn:btih:6d11a149712650e273354db16679675aab2662a3","amp;dn":"Disney+Kids+Games+1+-+26in1+%28AIO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d11a149712650e273354db16679675aab2662a3","infoHashBuffer":{"type":"Buffer","data":[109,17,161,73,113,38,80,226,115,53,77,177,102,121,103,90,171,38,98,163]},"announce":[],"urlList":[]}}