{"title":"Richard Buckner - Bloomed [1995][FLAC]","uid":11679517,"size":361156597,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ddffd02a2ec768e00718671da94d26e98a60c0a&amp;dn=+Richard+Buckner+-+Bloomed+%5B1995%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":21,"time":1423017678,"description":"When it was first released in 1994, Richard Buckner's debut album, Bloomed, seemed little short of miraculous, a beautifully spare but rich and compelling set of songs about the sweet and bitter sides of love, accompanied by a superb, primarily acoustic ensemble led by producer Lloyd Maines. In retrospect, Bloomed turned out to reveal just one of the many facets of Buckner's musical personality, but if his muse took him many places after this (and continues to guide him in fascinating ways), this still remains one of the most satisfying and engaging albums in his catalog. Buckner's songs on Bloomed dig deep, whether he's pondering the mysteries of love on &quot;Blue and Wonder&quot; and &quot;Mud&quot; or sketching an indelible portrait of a young man succumbing to despair and self-pity on &quot;22,&quot; and his wordplay is at once artful and down to earth, and all the more effective for Buckner's strong, burnished voice and thoughtful phrasing; it's hard to imagine another voice putting so much effortless resonance behind lines like &quot;This is where things start going bad&quot; and &quot;Christ, how this life, from mud to miracles, is just the prettiest little burden.&quot; Maines and his small crew of musicians (including Butch Hancock on harmonica and longtime Joe Ely sideman Ponty Bone on accordion) give Buckner's songs all the care they deserve, adding to the nuances of the melodies and moods with a master's touch, and Maines' own steel guitar work is especially striking, from the determined drift of &quot;Gauzy Dress in the Sun&quot; to the sharp, howling report of &quot;Rainsquall.&quot; The rootsy sound of Bloomed gave way to more ambitious approaches on Devotion + Doubt and Since, but if Buckner wanted to show people just how much he had to offer on his first album, he succeeded beyond anyone's wildest dreams; Bloomed is about as masterful and confident as debuts can get, and it's a heady joy to hear","torrent":{"xt":"urn:btih:6ddffd02a2ec768e00718671da94d26e98a60c0a","amp;dn":"+Richard+Buckner+-+Bloomed+%5B1995%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ddffd02a2ec768e00718671da94d26e98a60c0a","infoHashBuffer":{"type":"Buffer","data":[109,223,253,2,162,236,118,142,0,113,134,113,218,148,210,110,152,166,12,10]},"announce":[],"urlList":[]}}