{"title":"Handel - Semele - Gardiner","uid":4749856,"size":777349156,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6dff1acc59330bddc1061dc96d8e097a84e7ae94&amp;dn=Handel+-+Semele+-+Gardiner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sheila6","files":20,"time":1236115498,"description":"Music : Classical : Lossless\n\n\nHandel: Semele\n\nBurrowes Ã‚Â· Kwella Ã‚Â· Priday Ã‚Â· D Jones Ã‚Â· Denley Ã‚Â· Penrose Ã‚Â· Rolfe Johnson Ã‚Â· M Davies Ã‚Â· Lloyd Ã‚Â· D Thomas Ã‚Â· English Baroque Soloists Ã‚Â· Gardiner.\n\n\n\n&quot;Semele&quot; cannot be satisfactorily described as either an Italianate opera or an English oratorio. It doesn't conform to the strict structure of opera seria nor, with a plot derived from classical mythology (one of Ovid's Metamorphoses), does it conform to the religious character of the oratorio. Instead, it lies somewhere in between. I tend to refer to it as an English baroque opera anwyay and, considering opera in English was never really a flourishing genre, I think this is fair.\n\nThis recording is really very good, and for several reasons is preferrable, in my opinion, to the recent recording by John Nelson which features Kathleen Battle in the title role, John Aler as Jupiter and Marylin Horne as both Ino and Juno - and this latter veteran, it has to be said, is probably the recording's most disappointing aspect (along with Battles' sucking in of breath). One may complain that Gardiner has made a few cuts - but the only cut I genuinely regret is part of the emotional exchange between Athamas and Ino, which is potentially one of the work's most moving scenes (Horne's delivery, by the way, ultimately becomes too harsh on the ear). Catherine Denley, though deprived part of this moving scene, is a most accomplished mezzo-soprano, and sings the role of Ino with the necessary maturity but without the constricted throat (and audible age) of her counterpart on Nelson's recording.\n\nIt was absolutely the right choice to cast Norma Burrowes in the title role. She is perfectly suited to it - a naturally pretty and naturally high soprano. Youthful, gentle and unaffected in comparison her Nelson counterpart, her first recitative and aria (Can Semele forego thy love) is simply stunning. One of her arias (Endless pleasure, endless love) suffers from poor recording levels (perhaps the result of the live recording - she sounds a little distant at times), but that is my only complaint. She portrays the character of Semele and her unfortunate obsession with her divine lover beautifully. Indeed, it is the tragic unfolding of the fate of Semele alongside Ino's unrequited love for Athamas, her sister's betrothed, that, for me, is the appeal of this opera-oratorio, besides the wealth of lovely tunes.\n\nAnthony Rolfe-Johnson sings the role of Jupiter perfectly, with sensitivity to the text; he delivers a touching, if slightly melancholy, rendition of &quot;Where'er you walk&quot; (it's meant to be a reassuring aria but, to my limited knowledge, no singer has quite manged to realise/convey that sense in it yet).\n\nDella Jones gives a sparkling performance: she suits the jealous Juno down to the ground. Her excellent diction and dramatic flare are breathtaking - she seizes the stage uttering but a few words, relishing every moment - her involvement and commitment to the part - or, indeed, any part she plays - can only be marvelled at. In fact, she, more than Denley, makes clear why Marylin Horne just isn't up to it. Her first accompanied recitative where she condemns &quot;the cursed Semele&quot; to &quot;the flood of Acheron&quot; has to be heard to be believed.\n\nPatrizia Kwella, as Juno's attendant, Iris, does her best to keep up with Jones and does a decent job - her somewhat two-dimensional voice showing its unfortunate face mainly on her first aria, managing to must greater conviction for the recitatives.\n\nRobert Lloyd, an excellent bass, is a marvellous and very human King Cadmus of Thebes (father of Semele) - and his counterpart on Nelson's recording, Samuel Ramey, simply doesn't possess the intent, or the involvement in the part, to deliver the words convincingly. Timothy Penrose is certainly an adequate Athamas (even in Semele's eyes, I'm sure) but he's not the most pleasing countertenor - in Michael Chance, Nelson has the better singer.\n\nDavid Thomas, who, for me, is usually the bane of any recording with his hammy, thoughtless delivery that often is more showmanship than singing, surprised me on this occasion with a tolerable Somnus' - his odd, 'do-ey' (by which I suppose I mean thoughtless or excessive) quality remains just audible even in his 'peaceful' air and he becomes a little excited, but I suppose this is to be expected given the nature of the scene - the sad irony is that although his scene is meant to be comic, Thomas manages to sound comic at the same time as sounding as though he doesn't intend to. I'm probably being fussy there - to be fair, this is one of his best performances.\n\nCatherine Prierard, as Cupid, has a convincingly boyish voice, but it is sometimes difficult to make out what she is singing and the aria is a little high for her. (Having heard Nancy Argenta sing Cupid splendidly on Medlam's recording of John Blow's &quot;Venus and Adonis&quot;, I can't help comparing the two). Maldwyn Davies, who makes an even briefer appearance as Apollo, gives a fine delivery. The choruses, especially of the priests, are brilliant (they sound suffocated on Nelson's recording).\n\nSo, Nelson's recording has the advantage of more recent recording technology but surpasses Gardiner's recording in neither soloists nor choir. Though I suspect the event of a more ideal recording is not too many years away, I would recommend this, Gardiner's recording, in the meantime.\n\nBy the way, thanks to the reviewer who corrected me on the points of Nelson's orchestra being modern, not period, and Chance being his countertenor as opposed to Asawa! I've corrected my review today, just to avoid misleading or annoying any future readers.\n\nIf only the radio broadcast of Gardiner's other recording with Eiddwen Harrhy in the title role (and Jones as Juno) or Minkowski's recording with (with Jones as Juno) were available . . . Perhaps Ponto or Chandos will get their hands on them one day.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:6dff1acc59330bddc1061dc96d8e097a84e7ae94","amp;dn":"Handel+-+Semele+-+Gardiner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dff1acc59330bddc1061dc96d8e097a84e7ae94","infoHashBuffer":{"type":"Buffer","data":[109,255,26,204,89,51,11,221,193,6,29,201,109,142,9,122,132,231,174,148]},"announce":[],"urlList":[]}}