{"title":"Norah Nova - I can show you, daddy 720p ","uid":12402205,"size":335010577,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:707cb0c8925fe53c61c6df680f65f25f60d676a5&amp;dn=Norah+Nova+-+I+can+show+you%2C+daddy+720p+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TKTh3K1ng","files":1,"time":1442044229,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/CMU&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/CMU&lt;/a&gt;\n\nNorah is planning on going out with her boyfriend Michael. Her dad is not very happy about this. He doesnt like Michael, because he knows what its like to be a boy his age and he doesnt like his daughter spending time with miscreants like that. But Norah is some what of an excellent negotiator. She proposes a deal. If she shows her daddy what shes going to do with Michael, he will let her go out with him. At first hes not sure what shes talking about. She tells him to get on the bed and climbs on top of him. She lifts up her skirt to reveal sexy lacy lingerie. His baby girl is so sexy. After taking off her clothes she starts to kiss down his chest until she gets to his dick. She sucks his dick with her stockings and shoes and panties still on.Then he flips her over and lifts her legs up above her head while he sucks on her clit and flicks it around with his tongue. She moans, throwing her head back in pleasure and grinding her pussy against his mouth. He grabs her and holds her so he can fuck her while he stands with her legs wrapped around his waist. Then he fucks her from behind until she climbs on top of him to bounce on his dick. They continue to fuck in several different positions until he cums in her mouth","torrent":{"xt":"urn:btih:707cb0c8925fe53c61c6df680f65f25f60d676a5","amp;dn":"Norah+Nova+-+I+can+show+you%2C+daddy+720p+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"707cb0c8925fe53c61c6df680f65f25f60d676a5","infoHashBuffer":{"type":"Buffer","data":[112,124,176,200,146,95,229,60,97,198,223,104,15,101,242,95,96,214,118,165]},"announce":[],"urlList":[]}}