{"title":"Country Life UK - 23 July 2014","uid":10626085,"size":72028013,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70830b0819a7c77fc8a7d18af58d7d4d8a8df5db&amp;dn=Country+Life+UK+-+23+July+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1406234014,"description":"Country Life UK - 23 July 2014\n English | 100 Pages | HQ PDF | 68.70 Mb\n\nCountry Life is a British weekly magazine, based in London at 110 Southwark Street, and owned by IPC Media, a Time Inc. subsidiary.\nThe magazine covers the pleasures and joys of rural life, as well as the concerns of rural people. It is primarily concerned with rural communities and their environments as well as the concerns of country dwellers and landowners and has a diverse readership which, although mainly UK based is also international. Much of its success has historically been built on its coverage of country houses, architecture and gardening. The first several dozen pages of each issue are devoted to colour advertisements for upmarket residential property, which are one of the best known attractions of the magazine, and popular with everyone from the super rich looking for a country house or estate to those who can only aspire to own such a property.\n\nThe pursuits and interests covered include hunting, shooting, farming, equestrian news and gardening and there are regular news and opinion pieces as well as a firm engagement with rural politics. There are reviews of books, food and wine, art and architecture (also many offers) and antiques and crafts. Illustrative material includes the Tottering-by-Gently cartoon by Annie Tempest. The property section claims to have more prime agents than anywhere else.\n\nRecent feature articles have included Britain's Best View, The Cream of Counties survey, England's Favourite Village, Britain's oldest inhabited dwelling (2003), and Dream Acres[2] imaginary landscape (2009).\n","torrent":{"xt":"urn:btih:70830b0819a7c77fc8a7d18af58d7d4d8a8df5db","amp;dn":"Country+Life+UK+-+23+July+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70830b0819a7c77fc8a7d18af58d7d4d8a8df5db","infoHashBuffer":{"type":"Buffer","data":[112,131,11,8,25,167,199,127,200,167,209,138,245,141,125,77,138,141,245,219]},"announce":[],"urlList":[]}}