{"title":"Tor Project- Internet Anonymizer","uid":4082722,"size":6698889,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:710a9e719a5b3278beabee5db0c5560d893d4c2e&amp;dn=Tor+Project-+Internet+Anonymizer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kaos_Kommander","files":2,"time":1205638810,"description":"Tor is a software project that helps you defend against traffic analysis, a form of network surveillance that threatens personal freedom and privacy, confidential business activities and relationships, and state security. Tor protects you by bouncing your communications around a distributed network of relays run by volunteers all around the world: it prevents somebody watching your Internet connection from learning what sites you visit, and it prevents the sites you visit from learning your physical location. Tor works with many of your existing applications, including web browsers, instant messaging clients, remote login, and other applications based on the TCP protocol.\n\nHundreds of thousands of people around the world use Tor for a wide variety of reasons: journalists and bloggers, human rights workers, law enforcement officers, soldiers, corporations, citizens of repressive regimes, and just ordinary citizens. See the Who Uses Tor? page for examples of typical Tor users. See the overview page for a more detailed explanation of what Tor does, why this diversity of users is important, and how Tor works.\n\nThere are three pieces of fine print you need to know about.\n\n   1. Tor does not protect you if you do not use it correctly. Read our list of warnings and make sure to follow the instructions for your platform carefully.\n   2. Even if you configure and use Tor correctly, there are still potential attacks that could compromise Tor&amp;#039;s ability to protect you.\n   3. No anonymity system is perfect these days, and Tor is no exception: you should not rely solely on the current Tor network if you really need strong anonymity.\n\nTor&amp;#039;s security improves as its user base grows and as more people volunteer to run relays. (It isn&amp;#039;t nearly as hard to set up as you might think, and can significantly enhance your own security against some attacks.) If running a relay isn&amp;#039;t for you, we need help with many other aspects of the project, and we need funds to continue making the Tor network faster and easier to use while maintaining good security. Please donate. \n\n\n\n\n\n\nTo install:\n1. Download Tor\n2. Close Firefox (if using it, which is recommended)\n3. Install\n\n &lt;a href=&quot;\nhttp://www.torproject.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torproject.org/&lt;/a&gt;\n\nThis is the latest stable release.  Have fun!!","torrent":{"xt":"urn:btih:710a9e719a5b3278beabee5db0c5560d893d4c2e","amp;dn":"Tor+Project-+Internet+Anonymizer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"710a9e719a5b3278beabee5db0c5560d893d4c2e","infoHashBuffer":{"type":"Buffer","data":[113,10,158,113,154,91,50,120,190,171,238,93,176,197,86,13,137,61,76,46]},"announce":[],"urlList":[]}}