{"title":"Don't_Stop_Movin'_-_S_Club_7_[Sbyky]","uid":7072292,"size":101272717,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:720c6aed5e22ab0ee5e4682d7d36dc79d95339e1&amp;dn=Don%27t_Stop_Movin%27_-_S_Club_7_%5BSbyky%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Sbyky","files":-1,"time":1330720449,"description":"&quot;Don't Stop Movin'&quot; is a song by S Club 7, released as a single on 23 April 2001.\n\nS Club 7 recorded the song in early 2001 after they finished making their second album, 7, with their regular songwriter, Simon Ellis, and Shep Solomon, who had worked on hits in the 90s by Eternal, Michelle Gayle etc. The song is notable for being made in a disco style and it features real violins and string instruments. The song was believed to be their &quot;coolest yet&quot;, and some even cited that this new sound of S Club 7's was a result of the infamous cannabis incident with the male members of the band. The song was released in April 2001, and hit #1 twice in the space of a month (incidentally, it was Geri Halliwell's &quot;It's Raining Men&quot; that spent two weeks atop the #1 position in between), becoming the year's seventh biggest-selling single, and scooping the BRIT Award for Best British Single in 2002 and ITV's Record of the Year accolade. The song made it to number 3 in Q's &quot;Guilty Pleasures&quot; list in August 2006.[1] A new mix will be included on the ultimate collection.\n\nThe video was filmed at the Camden Palace nightclub in Dublin, Ireland. Halfway through the shoot, a camera knocked a giant antique chandelier which fell down from the ceiling, narrowly missing band members Tina Barrett and Bradley McIntosh and the crowd of dancers.\n\nThe song has sold 740,000 copies in the UK as stated by the Official UK Charts Company.\n\nThe song samples Michael Jackson's &quot;Billie Jean&quot; - a fact the band widely spoke about during promotion of the single. In one of the interviews the band members mentioned the song's producers asking Jackson's management for permission to sample &quot;Billie Jean&quot; through fax and having been granted a permission smoothly.\n\nA fan-made mash-up remix video of both songs is available on YouTube, but much to Jackson's fans' displeasure, the remix is panned for an S Club 7 song to be mixed with Michael Jackson. On other accounts the song seems to resemble Madonna's &quot;Vogue&quot; from the album I'm Breathless.\n\nThe song features Bradley McIntosh and Jo O'Meara on lead vocals.","torrent":{"xt":"urn:btih:720c6aed5e22ab0ee5e4682d7d36dc79d95339e1","amp;dn":"Don%27t_Stop_Movin%27_-_S_Club_7_%5BSbyky%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"720c6aed5e22ab0ee5e4682d7d36dc79d95339e1","infoHashBuffer":{"type":"Buffer","data":[114,12,106,237,94,34,171,14,229,228,104,45,125,54,220,121,217,83,57,225]},"announce":[],"urlList":[]}}