{"title":"Lindsay Lohan - Rumors","uid":4302370,"size":132720644,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:735dca03baf9f1e33c7daa3ec01b6b63ec128932&amp;dn=Lindsay+Lohan+-+Rumors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1216375763,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Rumors&quot; is the first single from Lindsay Lohan&amp;#039;s debut album, Speak, and the most successful single from that album. Her album also features the music video for the track.\n\nThe music video for &quot;Rumors&quot; shows Lohan in a club where she wants to spend the night with friends, but is followed by people who want to take pictures of her. It begins with paparazzi following her in a parking garage. Lohan gets into a car with a chauffeur and they drive away. The car comes to a stop and she then steps into an elevator and sings the first verse of the song while she is filmed by a CCTV camera in the elevator. The next sequence shows her running through a hallway, dressed up, before getting into the club. There, she dances in the crowd, where she takes a picture of one of the paparazzi herself to get back at him. In the next sequence she&amp;#039;s walking slowly through the club where she finds the man who seems to be her boyfriend. She takes a seat next to her lover and they begin kissing and touching each other, all the while being constantly filmed by cameras in the club. While Lohan sings the second chorus she&amp;#039;s trapped in a cage in the middle of the club and the whole crowd is watching her. After this Lohan is shown dancing in the club with her friends. At the end of the music video Lohan and her friends enter the top of a high-rise and dance a routine while helicopters are circling around them. Finally Lohan gets into a helicopter and escapes. In the end she throws her camera away with all the pictures taken of her.\n\nThe music video was directed by Jake Nava who also directed the music video for &quot;My Prerogative&quot; by Britney Spears. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:735dca03baf9f1e33c7daa3ec01b6b63ec128932","amp;dn":"Lindsay+Lohan+-+Rumors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"735dca03baf9f1e33c7daa3ec01b6b63ec128932","infoHashBuffer":{"type":"Buffer","data":[115,93,202,3,186,249,241,227,60,125,170,62,192,27,107,99,236,18,137,50]},"announce":[],"urlList":[]}}