{"title":"Inferno  (Complete)  (No Ads)","uid":7782948,"size":698105823,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:735e0b4ce0b293dbce5dcf033736948224c511a4&amp;dn=Inferno++%28Complete%29++%28No+Ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1351817679,"description":"Inferno was a Marvel Comics company-wide crossover, published in 1989, that mainly involved the mutant titles:  The Uncanny X-Men; X-Factor; X-Terminators; Excalibur; and The New Mutants.  The story concerned:  the corruption of Madelyne Pryor into the Goblin Queen; the final transformation of Illyana Rasputin into the Darkchylde; the demonic transformation of Hobgoblin; and a demonic invasion of New York City proper.  The series was written by Louise Simonson, Chris Claremont, Steve Engelhart, Gerry Conway, David Michelinie, Ann Nocenti, Walter Simonson, Jon Bogdanove, Terry Austin, and Julianna Jones.\n\nJean Grey's clone, Madelyne Pryor, was taken in by the demons from Limbo, S'ym and N'astirh.  They planned for a demonic invasion of Earth, beginning with Manhattan.  Illyana Rasputin of the New Mutants began to mutate into a demon and N'astirh tricked her into opening a gateway.  The city of Manhattan fell under siege, and the Avengers, Fantastic Four, Daredevil, Power Pack, and Spider-Man had to fight numerous demons, most importantly Hobgoblin (who was now possessed by a demon that did not disappear with the others when the crisis was over, and the mutant-hating Boogeyman, transformed into a monster by N'astirh.)  Even objects became demonically tainted and people's souls became twisted.  Havok, Dazzler, Wolverine, Longshot, Archangel, and Storm all fell to the darkness to some extent.  Colossus was one of the few who remained wholly immune to the effects of Inferno, due to the protection of his organic steel armor, which is a naturally disruptive force against magic.  Some civilians weren't so lucky; some were maimed, others were simply devoured and/or killed.\n\nAs shown in Daredevil, life tried to continue as normal in the city:  buses still ran (under an all-volunteer force since the drivers had either been eaten or subsequently transformed into demons themselves;) subways functioned (though Daredevil had to save one from being sucked into the depths of Hell;) stores still sold products; helicopter tours still ran.\n\nOther parts of the city did not function as well. The Daily Bugle was under siege, though fortunately for the untrained civilians and an injured Spider-Man inside, the demons shattered under one blow.  Demons also attacked Osborn Chemical, and Harry Osborn put on his Green Goblin suit to defend it.  Kang, The Conqueror sought control of Mantis.\n\nDespite all of the destruction and death, many human Inferno survivors were convinced it was all a shared hallucination.\n\nThe chronology is imperfect because of the many different points of view (of the same events) presented, so an exact chronology would break individual issues into parts.  Starting with Excalibur 6, the story moves into Aftermath phase, and most of the subsequent issues show the demons leaving New York.\n\nA sequel has been made called X-Infernus starring Magik. It is a four-issue mini-series written by C. B. Cebulski.  A second sequel, Fall of the New Mutants, centers around Project Purgatory, a government operation that took the mutant babies used to make the portal to Hell, who were recovered alive and well, to make an Army controlled base in Hell, as well as trying to figure out how to activate the powers of the mutant babies.\n\nALL three storylines are included in this torrent for your downloading and perusing pleasures.\n\nEnjoy, and please seed.\n\n","torrent":{"xt":"urn:btih:735e0b4ce0b293dbce5dcf033736948224c511a4","amp;dn":"Inferno++%28Complete%29++%28No+Ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"735e0b4ce0b293dbce5dcf033736948224c511a4","infoHashBuffer":{"type":"Buffer","data":[115,94,11,76,224,178,147,219,206,93,207,3,55,54,148,130,36,197,17,164]},"announce":[],"urlList":[]}}