{"title":"Bainerman-Inside Covert Operations of CIA&amp;Mossad(1994)","uid":5740573,"size":830434,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73efdfe033d042e28831bbf9bd10ef1d3ad575c9&amp;dn=Bainerman-Inside+Covert+Operations+of+CIA%26Mossad%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1281018772,"description":"This is Joel Bainerman's shocking book Inside the Covert Operations of the CIA &amp; Israel's Mossad - Undercover With the Spymasters of America &amp; Israel (1994) which uncovers secret hand-in-hand relations between the CIA and the Mossad, including covert operations to topple Third-World regimes, the Reagan administration's manipulation of details on the Iran-contra affair, and more. Throughout the 1980s, the CIA and Israel's Mossad worked hand-in-hand on some of the most sophisticated and delicate intelligence operations ever. Bainerman takes you deep undercover and behind the scenes of recent history's most astonishing cloak and dagger actions. For the first time ever, the author uncovers the deepest secrets of US-Israeli relations revealing: Joint CIA-Mossad covert operations to topple Third World regimes; Israel's role in the Reagan Administration's &quot;October Surprise&quot;; How the Reagan administration skillfully manipulated the mainstream press to blame Israel for the Iran-Contra affair, and why and how CIA Director William Casey conducted a parallel &quot;arms-for-hostages&quot; deal behind the Mossad's back; The mysterious deaths of Israeli counter-intelligence official and Oliver North pointman - Amiram Nir; the &quot;Supergun&quot; to Iraq - Gerald Bull, and others. 290 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:73efdfe033d042e28831bbf9bd10ef1d3ad575c9","amp;dn":"Bainerman-Inside+Covert+Operations+of+CIA%26Mossad%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73efdfe033d042e28831bbf9bd10ef1d3ad575c9","infoHashBuffer":{"type":"Buffer","data":[115,239,223,224,51,208,66,226,136,49,187,249,189,16,239,29,58,213,117,201]},"announce":[],"urlList":[]}}