{"title":"Cassavetes - She's So Lovely (1997) ","uid":6828320,"size":4081209344,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7459841bb795229cc6252efefa94cf9108e6aa50&amp;dn=Cassavetes+-+She%5C%27s+So+Lovely+%281997%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"oddeven","files":53,"time":1321671555,"description":"Again, the image server is on strike.\n\nWritten and originally to be directed by John (with Sean Penn) but mortality stood in the way. Son Nick stepped in and put it together. I'm sure he had a lot of old hands helping with the authenticity. I'd say the apple didn't fall too far from the tree, on this film at least. Seems so faithful to the source that it could have tricked a few into a double take: Didn't that guy die a few years back?\n\nThe casting, aside from a brief Gena appearance, is peopled with a few who could easily be imagined in a film by Cassavetes twenty years earlier. I'm sure some might argue that Robin Wright was channeling Gena Rowlands the wrong way, but I would defend her performance, and say &quot;don't I know her from somewhere&quot;? Harry Dean Stanton's presence made me go and check if he had actually worked with John.\n\nJohn Travolta comes off as an airhead in one of the extras, but that doesn't mean he didn't pull his weight in the film.\n\nMy impression is that Cassavetes eternally played and directed 30somethings, while this film adds a youthful dimension unseen elsewhere, and a fair level of idiocy combined with madness (a more familiar Cassavetes realm). \n\nEven if you just can't imagine a Cassavetes film with Sean Penn and/or John Travolta you might find the two short extras worth a gander (and you really should give the film a chance, while you're at it).  The extras are:\n\nJohn Cassavetes: A Discussion (2000)\nwith Peter Bogdanovich, Seymour Cassell and Al Ruban (his cinematographer on five of his films)\n\nAn Actor's Look at Cassavetes (2000)\nwith Sean Penn, Robin Wright and John Travolta\n\na meager disc, which could use an upgrade.\n\nA French dub is available, and only English for the hard of hearing subs...\n\nUncompressed DVD5 VIDEO_TS files (2.35:1 a/r)","torrent":{"xt":"urn:btih:7459841bb795229cc6252efefa94cf9108e6aa50","amp;dn":"Cassavetes+-+She%5C%27s+So+Lovely+%281997%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7459841bb795229cc6252efefa94cf9108e6aa50","infoHashBuffer":{"type":"Buffer","data":[116,89,132,27,183,149,34,156,198,37,46,254,250,148,207,145,8,230,170,80]},"announce":[],"urlList":[]}}