{"title":"M4VConverterPlus 3.0.3 [K'ed]","uid":8791076,"size":14476178,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:74c1ff45518d1f6710b2391432c8341612740bd1&amp;dn=M4VConverterPlus+3.0.3+%5BK%27ed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"weebey7","files":1,"time":1375948322,"description":"[b]M4V Purchased or Rental[/b]\n\nM4V Converter Plus is a powerful M4V video converter tool.\nRecords in High Speed and Full Size\n\nIt records m4v video you purchased or rental while playing background in high speed and full size. Then encode to MOV or MP4.\nPurchased M4V or iTunes M4V Rental\n\nPurchased M4V movies are permitted to play on 5 devices. iTunes M4V rental can only play on 1 device. These M4V movie are protected by DRM. You could NOT play them on your own mobile devices other than Apple devices.\n\nIt's really unfair if you have paid for M4V, but you can't play on your PSP or Zune.\nRemove DRM from purchased M4V or iTunes M4V rental\n\nM4V Converter Plus comes to help you. With just a few mouse clicks, you can convert DRM M4V to unprotected MOV or MP4 format.\n\nStraightforward presets allow you to easily convert M4V videos to most portable devices such as iPad, iPhone, Apple TV, PSP, and more.\n\n\n[b]Key Features[/b]\n\nConverts purchased M4V movie\n\nIt records video while play them on iTunes background. So it converts purchased M4V and M4V rental.\nConverts iTunes M4V rental\n\nIt also converts iTunes M4V rental. The only condition is your iTunes can play the M4V rental.\nFast Conversion Speed, Great Quality\n\nPlay M4V video in background at high speed and full size, record it. Encodes it to MOV or MP4 while recording.\nCustomize Settings\n\nPre-defined output formats for most portable video player. Also supports user-defined formats.\nBatch Conversion\n\nSelect a batch list of m4v videos from iTunes' library, then convert them one by one automatically.\nBest M4V DRM Removal\n\nRemove DRM from protected M4V movies, so that you play them on iPod, iPhone, PSP, Zune, and more.\nEasy to Use\n\nThe user interface is concise. To start conversion, only a few mouse clicks are needed.\n","torrent":{"xt":"urn:btih:74c1ff45518d1f6710b2391432c8341612740bd1","amp;dn":"M4VConverterPlus+3.0.3+%5BK%27ed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74c1ff45518d1f6710b2391432c8341612740bd1","infoHashBuffer":{"type":"Buffer","data":[116,193,255,69,81,141,31,103,16,178,57,20,50,200,52,22,18,116,11,209]},"announce":[],"urlList":[]}}