{"title":"Julia (1977) (Jane Fonda, Vanessa Redgrave)","uid":4002084,"size":692362665,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:758d9c015fc9217bf2948930236568e7171687f5&amp;dn=Julia+%281977%29+%28Jane+Fonda%2C+Vanessa+Redgrave%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JayRay","files":-1,"time":1201626904,"description":"JULIA - 1977\n\n  Nominated for 11 Academy Awards. Won 3.\n\n  From &quot;Pentimento,&quot; the memoirs of late playwright Lillian Hellman, JULIA covers those years in the 1930s when Lillian attained fame with the production of her first play &quot;The Childrens' Hour&quot; on Broadway. Not surprisingly, it centers on Lillian's relationship with her lifelong friend, Julia. It is a relationship that goes beyond mere acquaintance and one for which the word &quot;love&quot; seems appropriate. While Julia attends the University in Vienna, studying with such luminaries as Sigmund Freud and Albert Einstein, Lillian suffers through revisions of her play with her mentor and sometimes lover Dashiel Hammett at a New England beachhouse. After becoming a celebrated playwright, Lillian is invited to a writers conference in Russia. Julia, having taken up the battle against fascism, enlists Lillian en route to smuggle money through Nazi Germany which will assist in the Anti-Fascist cause. It is a dangerous mission especially for a Jewish intellectual on her way to communist Russia. During a brief meeting with Julia on this trip, Lillian learns that Julia has had a child which is called Lilly. Shortly after returning to the States, Lillian is informed of Julia's murder. The details of her death are shrouded in secrecy. Lillian sadly travels to England to search for her namesake the child she had promised Julia to care for.\n\n  Starring: Jane Fonda, Vanessa Redgrave, Jason Robards, Maximilian Schell, Hal Holbrook, Meryl Streep.\n\n  Directed by: Fred Zinnemann.\n\n  Quality: Very Good Xvid from DVD.\n\n  Length: 1hr. 57min.\n\n  Language: English.\n\n  Size: 720 x 448","torrent":{"xt":"urn:btih:758d9c015fc9217bf2948930236568e7171687f5","amp;dn":"Julia+%281977%29+%28Jane+Fonda%2C+Vanessa+Redgrave%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"758d9c015fc9217bf2948930236568e7171687f5","infoHashBuffer":{"type":"Buffer","data":[117,141,156,1,95,201,33,123,242,148,137,48,35,101,104,231,23,22,135,245]},"announce":[],"urlList":[]}}