{"title":"D.O.A discography (1978 - 2012) by susan1973","uid":10345249,"size":1561000116,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7604b074dc6e1c4699ed72147ecce4e937d5b1dc&amp;dn=D.O.A+discography+%281978+-+2012%29+by+susan1973&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"susan1973","files":372,"time":1402596728,"description":"D.O.A. was a hardcore punk band from Vancouver, British Columbia, Canada. They are often referred to as the &quot;founders&quot; of hardcore punk, along with Black Flag, The Germs, Negative Trend, and Middle Class. Their second album Hardcore '81 was thought by many[1] to have been the first actual reference to the second wave of the American punk sound as hardcore. Singer/guitarist Joey &quot;Shithead&quot; Keithley is the only founding member to have stayed in the band throughout its entire history. However, original bassist Randy Rampage has been active in the band in recent years and has played on one of the band's last three albums, although he is not in the current lineup. D.O.A. has often released music on Jello Biafra's Alternative Tentacles Records, and they have released an album with Jello Biafra titled Last Scream of the Missing Neighbors.\n\nD.O.A. has always maintained an uncompromising leftist political stance. The band is known for its outspoken political opinions and has a history of performing for many causes and benefits. Its slogan is &quot;Talk minus Action equals Zero.&quot; The band has been active on many issues, including anti-racism, anti-globalization, freedom of speech, and the environment.\n\nFounder Joe Keithley now spends a great deal of time working with his record company Sudden Death Records which has branched off into many areas of music.","torrent":{"xt":"urn:btih:7604b074dc6e1c4699ed72147ecce4e937d5b1dc","amp;dn":"D.O.A+discography+%281978+-+2012%29+by+susan1973","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7604b074dc6e1c4699ed72147ecce4e937d5b1dc","infoHashBuffer":{"type":"Buffer","data":[118,4,176,116,220,110,28,70,153,237,114,20,126,204,228,233,55,213,177,220]},"announce":[],"urlList":[]}}