{"title":"The Philosophy of Steven Soderbergh (pdf){Zzzzz}","uid":11388448,"size":1426836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76809ada99437ca46b9a1947c4b9682bdcfdd4f8&amp;dn=The+Philosophy+of+Steven+Soderbergh+%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415297361,"description":"Widely regarded as a turning point in American independent cinema, Steven Soderbergh's sex, lies, and videotape (1989) launched the career of its twenty-six-year-old director, whose debut film was nominated for an Academy Award and went on to win the Cannes Film Festival's top award, the Palme d'Or. The Philosophy of Steven Soderbergh breaks new ground by investigating salient philosophical themes through the unique story lines and innovative approaches to filmmaking that distinguish this celebrated artist. Editors R. Barton Palmer and Steven M. Sanders have brought together leading scholars in philosophy and film studies for the first systematic analysis of Soderbergh's entire body of work, offering the first in-depth exploration of the philosophical ideas that form the basis of the work of one of the most commercially successful and consistently inventive filmmakers of our time.\n\nProduct Description\n\nReview\n&quot;&quot;This book provides provocative, insightful, and instructive analysis of the cinematic and philosophical significance of Steven Soderbergh's work.&quot; -- Jason Holt, editor of &quot;The Daily Show and Philosophy: Moments of Zen in the Art of Fake News&quot;&quot; --\nAbout the Author\nR. Barton Palmer is Calhoun Lemon Professor of Literature at Clemson University and the author or editor of several books, including &quot;Hollywood's Tennessee: the Williams Films and Postwar America.&quot; Steven M. Sanders is professor emeritus of philosophy at Bridgewater State College. He is the author of &quot;Miami Vice&quot; and editor of &quot;The Philosophy of Science Fiction Film&quot; and &quot;The Philosophy of TV Noir.&quot;\n\nPublisher: The University Press of Kentucky (15 January 2012)\nLanguage: English\nISBN-10: 0813126622\nISBN-13: 978-0813126623","torrent":{"xt":"urn:btih:76809ada99437ca46b9a1947c4b9682bdcfdd4f8","amp;dn":"The+Philosophy+of+Steven+Soderbergh+%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76809ada99437ca46b9a1947c4b9682bdcfdd4f8","infoHashBuffer":{"type":"Buffer","data":[118,128,154,218,153,67,124,164,107,154,25,71,196,185,104,43,220,253,212,248]},"announce":[],"urlList":[]}}