{"title":"Bruce Springsteen Greatest Hits - 1995","uid":3740963,"size":74006810,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:76b397c3a300c1f71136c4fc3d6ac83015bfc5a8&amp;dn=Bruce+Springsteen+Greatest+Hits+-+1995&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ekolb","files":20,"time":1184356091,"description":"Bruce Frederick Joseph Springsteen (born September 23, 1949) is an American rock singer-songwriter and guitarist, born in Long Branch, New Jersey. Throughout his career, Springsteen has won fifteen Grammys, an Oscar, an induction into the Rock and Roll Hall of Fame, and a large, devoted and long-lasting fan base. His best-known albums, such as Born to Run and Born in the U.S.A., epitomize his penchant for finding grandeur in the struggles of daily life.\n\nSpringsteen&amp;#039;s lyrics often concern people struggling to make ends meet. He has gradually become identified with progressive politics, various charitable causes, and his response to the September 11, 2001 attacks, on which his album The Rising reflects. In recent years Springsteen&amp;#039;s recordings tended to alternate between mainstream rock and more sombre, topical, folk-oriented music. Much of Springsteen&amp;#039;s iconic status stems from his concert performances: marathon shows up to four hours in length, in which he and the E Street Band energetically perform intense ballads, rousing anthems, and rock and roll party songs, interspersed with Springsteen&amp;#039;s whimsical or deeply personal stories.\n\nStreets Of Philadelphia&quot; won 1995 Grammy Awards for Song Of The Year, Best Male Rock Vocal Performance, Best Rock Song and Best Song Written Specifically For A Motion Picture Or For Television. &quot;Streets Of Philadelphia&quot; was also nominated for Record Of The Year.\n\nYou can grumble about the early romps that aren&amp;#039;t here--what, no &quot;Rosalita&quot;?--or about your favorite B-side not being included, but the fact is these are the songs that have lasted through Bruce Springsteen&amp;#039;s first two decades, and you could hardly ask for more Springsteen on a single disc. This really is the cream.\n\nThe four blockbusters that open GREATEST HITS weren&amp;#039;t actually hits--&quot;Born To Run&quot; peaked at #23 on the charts, &quot;Badlands&quot; didn&amp;#039;t break the top 40, and the other two weren&amp;#039;t singles at all--but they laid down the rules for all the hits that followed and they&amp;#039;ve remained concert and rock radio staples. &quot;Born To Run&quot; wraps a restless American dream into one of the most rollicking rock &amp;#039;n&amp;#039; roll singles ever made; the latter couple find the dreamer waking up and finding real folk struggling with that dream everywhere he looks. What follows is one of the greatest strings of singles to ever deal head-on with that confrontation between dreams and realities.\n\nThe four new songs on GREATEST HITS find Springsteen finally finding a way to incorporate his E Street Band--which hadn&amp;#039;t performed on a studio album for 11 years before this--into his current infatuation with mellower, though no less hard-hitting rock. &quot;Murder Incorporated&quot; is actually an E Street outtake from 1982, and it&amp;#039;s an all-out, searing track. The others, all 1995 recordings (though &quot;This Hard Land&quot; was also written in the early eighties) form a cycle about unrealized dreams, in love, friendship and life.\n\nGreatest Hits CD\nBruce Springsteen\n\nCategory Rock, Rock/Pop \nLabel Columbia (USA) \nOrig Year 1995 \nDiscs 1 \nStreet Date Feb 28, 1995 \nStudio/Live Studio \nMono/Stereo Stereo \n\nTrack Listing\n \n  1. Born To Run \n  2. Thunder Road \n  3. Badlands \n  4. River, The \n  5. Hungry Heart \n  6. Atlantic City \n  7. Dancing In The Dark \n  8. Born In The U.S.A. \n  9. My Hometown \n  10. Glory Days \n  11. Brilliant Disguise \n  12. Human Touch \n  13. Better Days \n  14. Streets Of Philadelphia \n  15. Secret Garden - (&amp;#039;95) \n  16. Murder Incorporated - (previously unreleased) \n  17. Blood Brothers - (&amp;#039;95) \n  18. This Hard Land - (&amp;#039;95) \n\nEnjoy! and please seed..\nEkolb","torrent":{"xt":"urn:btih:76b397c3a300c1f71136c4fc3d6ac83015bfc5a8","amp;dn":"Bruce+Springsteen+Greatest+Hits+-+1995","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76b397c3a300c1f71136c4fc3d6ac83015bfc5a8","infoHashBuffer":{"type":"Buffer","data":[118,179,151,195,163,0,193,247,17,54,196,252,61,106,200,48,21,191,197,168]},"announce":[],"urlList":[]}}