{"title":"Joe Dirt(2001)DVDRip.AC3(ENG)-DROCK","uid":6496797,"size":733646833,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76d58be92c7447c09d22061ba35314f3ff22d18a&amp;dn=Joe+Dirt%282001%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"drock232","files":-1,"time":1309102983,"description":"As the title character of Joe Dirt, David Spade plays a &quot;white trash&quot; janitor at an L.A. radio station, whose mullet hairdo is just one of many personal oddities that make him the object of much ridicule. And the sanitation gig is just the most recent of Joe's many incarnations during a tumultuous life, which got off on the wrong foot when Joe was abandoned at the Grand Canyon by his parents as a young child. After stumbling into the on-air studio, Joe steadily recounts the sad and comical story of how he cared for himself and journeyed around the country trying to relocate his family, all while being prodded, teased, and eventually embraced by a sarcastic deejay (Dennis Miller) and a rapt listening audience. His travels involve stints selling fireworks, wrangling alligators, riding aloft in a car dealership display balloon, and being held captive by a Silence of the Lambs-style serial killer. Despite numerous setbacks and bruising physical injuries, Joe emerges from each episode with his spirit intact as he searches optimistically for his roots, and eventually for the chance to return to the one place he was accepted -- a rural farm where the girl of his dreams (Brittany Daniel) awaits. The directorial debut of Dennie Gordon, Joe Dirt was produced by Adam Sandler's production company, Happy Madison, and features musician Kid Rock, also debuting, in the supporting role of Joe's rival. \n\nRipped with Handbrake.\n\nLength: 1 Hour 31 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:76d58be92c7447c09d22061ba35314f3ff22d18a","amp;dn":"Joe+Dirt%282001%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76d58be92c7447c09d22061ba35314f3ff22d18a","infoHashBuffer":{"type":"Buffer","data":[118,213,139,233,44,116,71,192,157,34,6,27,163,83,20,243,255,34,209,138]},"announce":[],"urlList":[]}}