{"title":"The Lords of Midnight  (+ Extras) GOG","uid":8824867,"size":58569366,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:76e0c94b06cbf8d64f0a53b1010d00e560489d56&amp;dn=The+Lords+of+Midnight++%28%2B+Extras%29+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1376820302,"description":"\nThe 2013 PC remake of the &quot;The Lords of Midnight&quot;, a video game written by Mike Singleton, released in 1984 for the ZX Spectrum. Also available for Amstrad CPC and Commodore 64.\n\nThe Lords of Midnight is a wargame/adventure game. The player starts with four characters (Luxor the Moonprince, Rorthron the Wise, Corleth the Fey, and Morkin), and then has the option to recruit up to twenty eight further Lords (Ithrorn, The Utarg of Utarg, Blood, Xajorkith, Shadows, and so on) to the cause in the quest to destroy Doomdark, the Witchking of Midnight.\n\nThe game can be played in three ways; firstly, as a straight adventure game, where the focus is on Morkin's quest to destroy the Ice Crown, the source of Doomdark's power, then secondly as a wargame, where the focus is on recruiting lords and troops to defeat Doomdark's armies. The third variation, described in the manual as the 'Epic', required the player to complete the game in both ways simultaneously.\n\nThe human player has the advantage in that only one of two objectives is required to defeat Doomdark. If the Ice Crown is destroyed, or Doomdark's home citadel of Ushgarak falls, the game is won. In order for Doomdark to win, he has to complete two objectives; firstly Morkin must be killed, for as long as Morkin is alive the game will continue, and secondly he must subdue the armies of the Free. He can do this by either killing Luxor the Moonprince or conquering Xajorkith, the capital citadel of the Free lands.\n\nThe game featured a groundbreaking technique called landscaping to depict the lands of Midnight from a first-person perspective,\n\nIt's hard to say exactly how much of this is preserved in this Windows remake, but it's pretty true to the original apparently.\n","torrent":{"xt":"urn:btih:76e0c94b06cbf8d64f0a53b1010d00e560489d56","amp;dn":"The+Lords+of+Midnight++%28%2B+Extras%29+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76e0c94b06cbf8d64f0a53b1010d00e560489d56","infoHashBuffer":{"type":"Buffer","data":[118,224,201,75,6,203,248,214,79,10,83,177,1,13,0,229,96,72,157,86]},"announce":[],"urlList":[]}}