{"title":"Birgitta Bergin - En oemotståndlig affär - Svensk","uid":12585766,"size":324939017,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7777181e5adb95bda9f6ed1f3d2ba9c728007362&amp;dn=Birgitta+Bergin+-+En+oemotst%26aring%3Bndlig+aff%26auml%3Br+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"totomas1","files":137,"time":1445014995,"description":"Birgitta Bergin – En oemotståndlig affär\r\n\r\nLägenheten på Riddargatan i Stockholm har blivit vårt hem, vår lilla fristad. Det är där vi har hittat vårt nya liv livet utan Calle och utan Jesper. Livet som det ser ut idag: bara min lille Lucas och jag.\r\n\r\nAnna Holm har gått vidare efter att hennes stora kärlek Calle omkom i en olycka. Hon är numera styrelseordförande för Vansbo fastigheter och försöker få livspusslet att gå ihop. En ny kärleksrelation står långt ner på listan, efter styrelsemöten och matsäckar till treårige Lucas dagisutflykter.\r\n\r\nPå en mässa i Cannes träffar Anna den karismatiske bankmannen Fabian och sveps in i en passionerad relation. Men det är inte bara passionen som lockar henne Fabian kommer också med ett helt oemotståndligt affärserbjudande, en stor fastighetsaffär i Berlin.\r\nDet innebär mer tid för Anna i Berlin, och mer tid tillsammans med Fabian.\r\nSamtidigt har hon konstant dåligt samvete när det gäller Lucas. Hon är alltid sist att hämta på dagis och blir mer och mer irriterad på dagisfröken Filip, som Lucas avgudar. Filip med sina slitna jeans och t-shirt och sina oceanblå ögon som verkar se rakt igenom henne.\r\n\r\nMan ska skilja på affärer och nöjen eller behöver man verkligen det? Affären med Fabian kräver allt mer av Anna, både i jobbet och privat. Snart känner hon att hon håller på att tappa fotfästet. Och som om det inte vore nog vägrar Filip lämna henne ifred. Nu vill han till och med träffa henne och Lucas och fika! Vad är det han är ute efter egentligen?\r\n\r\nEn oemotståndlig affär är den fristående fortsättningen på succéromanen Ett oemotståndligt förslag. Liksom i den första boken om Anna Holm får vi här en vindlande historia som inte släpper taget. Birgitta Bergin är den typen av författare, hon skriver rappt och rakt på sak och hennes böcker berör och väcker känslor hos läsarna.\r\n\r\n\r\nAntal CD: 9 CD\r\nUppläsare: Anna Maria Käll\r\nSpeltid: Ca 11 timmar","torrent":{"xt":"urn:btih:7777181e5adb95bda9f6ed1f3d2ba9c728007362","amp;dn":"Birgitta+Bergin+-+En+oemotst%26aring%3Bndlig+aff%26auml%3Br+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7777181e5adb95bda9f6ed1f3d2ba9c728007362","infoHashBuffer":{"type":"Buffer","data":[119,119,24,30,90,219,149,189,169,246,237,31,61,43,169,199,40,0,115,98]},"announce":[],"urlList":[]}}