{"title":"The Avenues of Salt Lake City (Art Ebook).pdf","uid":11366941,"size":10690614,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:791149d179a9256c0b0061a259362190182c501e&amp;dn=The+Avenues+of+Salt+Lake+City+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1415051275,"description":"Karl Haglund, Philip Notarianni, &quot;The Avenues of Salt Lake City&quot; \n2012 | 2 edition | ISBN-10: 1607811812 | 384 pages | PDF | 10 MB\n\nSalt Lake City's oldest residential historic district is a neighborhood known as the Avenues. During the late nineteenth century this area was home to many of the most influential citizens of Salt Lake City. Built from 1860 until 1930, it contains a mix of middle and upper middle class homes of varying architectural styles. This architectural diversity makes the Avenues unique among Utah's historic districts. For the past thirty years, as citizens have rediscovered the value of living in historic properties near downtown and the University of Utah, preservation efforts have soared in the area. \nIn 1980, the Avenues was established as a historic district and the Utah Historical Society published The Avenues of Salt Lake City. That book's authors, Karl T. Haglund and Philip F. Notarianni, gleaned much about the area's history by using information found on the historic district applications. This newly revised edition of &quot;The Avenues of Salt Lake City&quot; by Cevan J. LeSieur updates the original with a greatly expanded section on the historic homes in the neighborhood, including more than 600 new photos, and additional material covering the history of the Avenues since 1980. \nThe book is designed so that readers can take it along as a guide when exploring the neighborhoods. All the pictures of Avenues homes are accompanied with architectural information and brief histories of the properties. This volume makes a valuable resource for those interested in the history of the Avenues and its diverse architecture, and for anyone interested in Utah history, Utah architecture, and historic preservation","torrent":{"xt":"urn:btih:791149d179a9256c0b0061a259362190182c501e","amp;dn":"The+Avenues+of+Salt+Lake+City+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"791149d179a9256c0b0061a259362190182c501e","infoHashBuffer":{"type":"Buffer","data":[121,17,73,209,121,169,37,108,11,0,97,162,89,54,33,144,24,44,80,30]},"announce":[],"urlList":[]}}