{"title":"BeFit in 90 - x264 - MP4 - WEB-DL","uid":9037859,"size":1619278325,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:79f55e267d66a30d2061a6ae91a1f60761b197a5&amp;dn=BeFit+in+90+-+x264+-+MP4+-+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MrTVGuy","files":-1,"time":1381548482,"description":"BeFit In 90 Workout System - X264 - MP4- WEB-DL\n\nThe BeFit in 90 Program contains everything you need to help shed pounds and transform your body in just 90 days! This total body cross-training system offers unique daily 35-minute workouts that get progressively more challenging every month. Fitness experts Samantha Clayton and Garret Amerine will guide you through a mix of strength, cardio, flexibility, yoga and power drills to help you reach your ultimate fitness goals. This set also includes a workout calendar that makes it easy to know exactly which workouts to do each day.\n\nMonth 1: Kick-start your makeover with fat-blasting workouts strategically combined to boost your total body strength, flexibility and metabolism. This unique blend of upper- and lower-body training, calorie-crushing cardio, Mixed Martial Arts (MMA), yoga, abs sculpting, and sports stretching, will lay the foundation for revolutionary transformation!\n\nMonth 2: Move into Month 2 and marvel at the new athletic you. Phase 2 of the BeFit program revs up the pace and power of each cross-training workout to accelerate your metabolism and blast remaining fat. Each dynamic workout delivers high-fun, high-energy moves that enhance athletic performance, sculpting power, fine-tuned flexibility, and post-exercise calorie burn.\n\nMonth 3: Reach your peak, and finish Month 3 strong, with this fierce mix of explosive plyometric workouts that exert muscles to the max, power yoga that polishes muscle tone, and a dynamic sports stretch that conditions your lean and limber body. In this final phase, you will master the tools for lifelong success and celebrate your hard earned slim and strong, incredible new body!\n\nMEET THE BEFIT IN 90 TRAINERS\n \nHosted by wife and mother, Samantha Clayton and former marine, Garret Amarine, the Befit in 90 Fitness Trainers are inspirational fitness success stores and modern day heroes. Samantha Clayton, mother of 4 and wife to Baseball Star Royce Clayton, has an enviously lean body and is an inspiration in her dedication to health and fitness to women everywhere. After September 11th, Garret joined the Marine Infantry and was deployed to Iraq, where he was injured. Garret made a miraculous recovery and began his career as a Personal Trainer.\n\nThis system is fully compatible with Softmodded Wii and many other devices that support x264 in a MP4 container. The encoding of this system is designed for maximum device support, small file sizes and good quality. \n\nHave fun, Get Fit and SEED.","torrent":{"xt":"urn:btih:79f55e267d66a30d2061a6ae91a1f60761b197a5","amp;dn":"BeFit+in+90+-+x264+-+MP4+-+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79f55e267d66a30d2061a6ae91a1f60761b197a5","infoHashBuffer":{"type":"Buffer","data":[121,245,94,38,125,102,163,13,32,97,166,174,145,161,246,7,97,177,151,165]},"announce":[],"urlList":[]}}