{"title":"The Walking Dead - SE 5","uid":15808294,"size":8023006205,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7a0e9f10ed32e0733c2207777393a828b8cf248e&amp;dn=The+Walking+Dead+-+SE+5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":23,"time":1473605562,"description":"The Walking Dead - Season 5\r\n\r\nPlot\r\nRick and many from his group have been captured at Terminus and are being held prisoner in a boxcar. They learn that their captors engage in cannibalism and lure survivors to the fortified city to satisfy the practice. While Tyreese stays a safe distance away with Rick's child Judith, Carol launches an attack, enabling them to escape while a horde of walkers descends on Terminus. Rick and the others regroup with Carol and Tyreese, and Rick is elated to see that Judith is still alive. They decide not to chase after Gareth and the rest who have survived from his group. Instead, they make plans to escort Eugene to Washington, D.C. in pursuit of a cure that Eugene says exists there.\r\n\r\nThey find shelter in a nearby church occupied by Father Gabriel Stokes, who has been struggling to cope with his religious beliefs in wake of the walker outbreak. He is also tormented by an event that occurred shortly after the outbreak in which he barricaded himself inside his church refusing to help others being attacked by walkers outside. Meanwhile, Gareth's men have regrouped and stage attacks against the church. Rick and the others manage to finish off Gareth and his group, losing Bob in the process. Daryl, noticing that Carol has grown distant, follows her to a car that she was planning to flee in. As they were talking, a vehicle with the same cross markings of the one that abducted Beth drives past, and both of them drive off in close pursuit.\r\n\r\nRick attempts to convince the group to fortify the church and wait for Carol and Daryl's return, but with D.C. in mind, Abraham presses them to leave. Glenn defuses the situation by offering to go with Abraham while Rick stays behind to wait. Tara and Maggie decide to join them, and Abraham gives Rick a map of the path they plan to take, along with a handwritten note showing his appreciation of Rick's leadership skills. Not long after leaving, however, they find their route completely engulfed by walkers making passage nearly impossible. Amid an argument between Abraham and Glenn, Eugene reveals that he is not a scientist and fabricated the claim about a cure. Rattled by the revelation, Abraham strikes and severely injures Eugene","torrent":{"xt":"urn:btih:7a0e9f10ed32e0733c2207777393a828b8cf248e","amp;dn":"The+Walking+Dead+-+SE+5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a0e9f10ed32e0733c2207777393a828b8cf248e","infoHashBuffer":{"type":"Buffer","data":[122,14,159,16,237,50,224,115,60,34,7,119,115,147,168,40,184,207,36,142]},"announce":[],"urlList":[]}}