{"title":"Jerry Garcia - 1991 - Garcia / Grisman (FLAC)","uid":7637539,"size":380563651,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7a669a4080096376b5d7c3814226f2cebd910ce1&amp;dn=Jerry+Garcia+-+1991+-+Garcia+%2F+Grisman+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brizownthepi","files":24,"time":1347690207,"description":"Tracks\n\n 01. The Thrill Is Gone\n 02. Grateful Dawg\n 03. Two Soldiers\n 04. Friend of the Devil\n 05. Russian Lullaby\n 06. Dawg's Waltz\n 07. Walkin' Boss\n 08. Rockin' Chair\n 09. Arabia\n \nPersonnel\n\n Jerry Garcia - guitar, vocals\n David Grisman - mandolin\n Jim Kerwin - bass\n Joe Craven - fiddle, percussion\n \nReview\n\n This Grammy-nominated disc heralds the origins of the highly acclaimed acoustic duo of Jerry Garcia (guitar/vocals) and David &quot;Dawg&quot; Grisman (mandolin). They had been chums for years by the time they began their direct partnership in earnest on December 7, 1990, with a nine-song set at the Sweetwater in Mill Valley, CA. Over half of that material would be reworked the following spring -- for inclusion on this disc -- at Grisman's newly appointed, plush, and well-lit Dawg Studios. Along with David Grisman Quintet members Jim Kerwin (bass) and Joe Craven (percussion/fiddle), Garcia and Grisman revive a few familiar tunes covering every dimension of popular music, ranging from the blues (&quot;The Thrill Is Gone&quot;) to folk-rock (&quot;Friend of the Devil&quot;), as well as pop music standards such as Irving Berlin's &quot;Russian Lullaby&quot; -- which Garcia had previously covered on his 1974 Garcia (Compliments) album -- and Hoagy Carmichael's &quot;Rockin' Chair.&quot; They also examined the origins of authentic traditional folk (&quot;Walkin' Boss&quot;/&quot;Two Soldiers&quot;). Additionally, the pair collaborated on the original instrumental &quot;Grateful Dawg,&quot; which coalesces the distinct styles of Grisman's &quot;Dawg Music&quot; with Garcia's Grateful Dead intonations. The results are categorically brilliant and undoubtedly helped usher in the contemporary bluegrass and progressive bluegrass movements. Grisman's sonically perfected studio coupled with his decades of hands-on engineering and producing expertise helped immensely in capturing and accurately reproducing their unaffected acoustic intimacy. Nowhere is this more evident than the 16-plus minute &quot;Arabia&quot; -- which would become a showstopper once they hit the road in the early '90s. The sound quite literally envelopes the listener, who autonomically becomes drawn into the track as it twists and slithers through several different movements -- including the central theme, credited in the liner notes as being based on the traditional Cuban melody &quot;Hasta Siempre.&quot; All dimensions of &quot;unplugged&quot; enthusiasts who have not already made Jerry Garcia/David Grisman a top priority are strongly encouraged to do so. Lindsay Planer","torrent":{"xt":"urn:btih:7a669a4080096376b5d7c3814226f2cebd910ce1","amp;dn":"Jerry+Garcia+-+1991+-+Garcia+%2F+Grisman+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a669a4080096376b5d7c3814226f2cebd910ce1","infoHashBuffer":{"type":"Buffer","data":[122,102,154,64,128,9,99,118,181,215,195,129,66,38,242,206,189,145,12,225]},"announce":[],"urlList":[]}}