{"title":"Player Attack S03E12 720p HDTV h264-Berg","uid":11919910,"size":1216045988,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7a7c158b38ee1e870af9ada4cde1b5894679242d&amp;dn=Player+Attack+S03E12+720p+HDTV+h264-Berg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1431564636,"description":"This week, Player Attack heads to Oz Comic-Con to talk comics, with five of the world's most awesome artists, writers, editors and publishers.\n\nYou may have seen Sydney-based Jon Sommariva's work if you're a fan of Teenage Mutant Ninja Turtles or Star Wars Tales, or if you peruse works published by Image Comics, Dark Horse Comics and DC.\n\nBobby Curnow is the editor of IDW's My Little Pony comic line, as well as working closely with the Ninja Turtles. Based in the US, he was assistant editor on the Jurassic Park series, and has worked on more than 300 titles.\n\nNew York Times best-seller Francis Manapul is the man behind the stunning revamp of The Flash. He's since turned his talents to the Batman Detective Comics series.\n\nDouglas Holgate is an artist based in Melbourne, currently working on his self-published series Maralinga as well as the all-ages graphic novel Clem Hetherington and the Ironwood Race.\n\nAustralian artist Tristan Jones is currently drawing the Mad Max comics for Vertigo, and if that wasn't cool enough, he's also worked closely with the Ninja Turtles, Ghostbusters and the comic adaptation of Silent Hill.\n\nPlus, of course, we have all the latest gaming news - this is Player Attack!","torrent":{"xt":"urn:btih:7a7c158b38ee1e870af9ada4cde1b5894679242d","amp;dn":"Player+Attack+S03E12+720p+HDTV+h264-Berg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a7c158b38ee1e870af9ada4cde1b5894679242d","infoHashBuffer":{"type":"Buffer","data":[122,124,21,139,56,238,30,135,10,249,173,164,205,225,181,137,70,121,36,45]},"announce":[],"urlList":[]}}