{"title":"Operation Paperclip - Annie Jacobsen (Nazi scientists to the US)","uid":10477090,"size":559910886,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7bda3171bcf41702aab159d3167ab1f5b0a1f691&amp;dn=Operation+Paperclip+-+Annie+Jacobsen+%28Nazi+scientists+to+the+US%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"paulcx","files":19,"time":1404352668,"description":"Another torrent for this book on TPB has some chapters cut short. I enjoyed the book so found it at my local library online and used Tunebite to de-DRM it. \n\nThe author does a very thorough job with the latest information, including her own Freedom of Information Act requests. It can be a little long, but is a fascinating re-appraisal of the well known act of bringing German scientists to the US after the war. \n\nWhile the scientists had no choice in where they were born and little choice but to live with the Nazi system, some were more compromised than others, particularly those involved in Nazi medical experiments or those involved with the slave labour used to build rockets. While many were of great service to the US, their past can be troubling. \n\n\n~ 19 1/2 hrs\nunabridged\n\n\n\n====================================\n\nThe explosive story of America's secret post-WWII science programs, from the author of the New York Times bestseller Area 51\n\nIn the chaos following World War II, the U.S. government faced many difficult decisions, including what to do with the Third Reich's scientific minds. These were the brains behind the Nazis' once-indomitable war machine. So began Operation Paperclip, a decades-long, covert project to bring Hitler's scientists and their families to the United States.\nMany of these men were accused of war crimes, and others had stood trial at Nuremberg; one was convicted of mass murder and slavery. They were also directly responsible for major advances in rocketry, medical treatments, and the U.S. space program. Was Operation Paperclip a moral outrage, or did it help America win the Cold War?\n\nDrawing on exclusive interviews with dozens of Paperclip family members, colleagues, and interrogators, and with access to German archival documents (including previously unseen papers made available by direct descendants of the Third Reich's ranking members), files obtained through the Freedom of Information Act, and dossiers discovered in government archives and at Harvard University, Annie Jacobsen follows more than a dozen German scientists through their postwar lives and into a startling, complex, nefarious, and jealously guarded government secret of the twentieth century.\n\nIn this definitive, controversial look at one of America's most strategic, and disturbing, government programs, Jacobsen shows just how dark government can get in the name of national security.\n\n","torrent":{"xt":"urn:btih:7bda3171bcf41702aab159d3167ab1f5b0a1f691","amp;dn":"Operation+Paperclip+-+Annie+Jacobsen+%28Nazi+scientists+to+the+US%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bda3171bcf41702aab159d3167ab1f5b0a1f691","infoHashBuffer":{"type":"Buffer","data":[123,218,49,113,188,244,23,2,170,177,89,211,22,122,177,245,176,161,246,145]},"announce":[],"urlList":[]}}