{"title":"Prisons on Fire - George Jackson, Attica &amp; Black Liberation","uid":6600742,"size":14175585,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7c1af41c812d722a2af318af4703d5d0167b96be&amp;dn=Prisons+on+Fire+-+George+Jackson%2C+Attica+%26+Black+Liberation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":23,"time":1313194705,"description":"Prisons on Fire. George Jackson, Attica &amp; Black Liberation\nBy Angela Davis, Jonathan Jackson and David Hilliard\n \n\nFormat: MP3\nBitrate: 32 Kbps\n\n\nWho were the Attica Brothers? Why did 1,500 Black, Puerto Rican, and white prisoners seize control of the New York prison? And who was George Jackson? And the Soledad Brothers? And why was he murdered by the San Quentin prison administration? What is the legacy of the prison movement? And what do these forgotten histories tell us about prisons, repression, and the struggle for freedom today?\n\nThrough a mixtures of archival audio and contemporary interviews, music and narration, we hear the voices of George Jackson; Jonathan Jackson Jr.; Georgia Jackson (mother of George and Jonathan Jackson); Angela Davis; David Hilliard (former Black Panther Party leader); James Baldwin; Harry Belafonte; David Johnson, Hugo Pinell, Luis Talamantez and Sundiata Tate; Frank ''Big Black'' Smith (Attica Brother and prison activist); William Kunstler; Elizabeth Fink and Michael Deutsch (attorneys for the Attica Brothers); L.D. Barkley (Attica Brother, murdered in the retaking of the prison in September of 1971, and who announced the ''Attica Manifesto'' to the world); and Ruchell Magee (prison activist and leader, still in prison for his political activities).\n\nThis documentary introduces and grapples with this history as well as lessons for today, and tomorrow. \n\n\nRunning Time: 59:02","torrent":{"xt":"urn:btih:7c1af41c812d722a2af318af4703d5d0167b96be","amp;dn":"Prisons+on+Fire+-+George+Jackson%2C+Attica+%26+Black+Liberation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c1af41c812d722a2af318af4703d5d0167b96be","infoHashBuffer":{"type":"Buffer","data":[124,26,244,28,129,45,114,42,42,243,24,175,71,3,213,208,22,123,150,190]},"announce":[],"urlList":[]}}