{"title":"El Regalo - Danielle Steell [Ebook][Spanish]","uid":6800422,"size":834583,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7cd6c0b6c1dbd0037a6267165f071f00e2ef9694&amp;dn=El+Regalo+-+Danielle+Steell+%5BEbook%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1320672111,"description":"El Regalo Danielle Steell\n\nCon esfuerzo y dedicaciÃƒÂ³n John y Liz Whittaker habÃƒÂ­an construido un hogar cÃƒÂ¡lido y confortable en el que se sentÃƒÂ­an a salvo de cualquier adversidad. Llevaban veintidÃƒÂ³s aÃƒÂ±os casados y sus dos hijos, Tommy y la pequeÃƒÂ±a Annie, eran el fruto deseado de su amor, una alegrÃƒÂ­a mÃƒÂ¡s para su sÃƒÂ³lido matrimonio. CreÃƒÂ­an en los sueÃƒÂ±os, la familia, la honradez y la amistad y habÃƒÂ­an conseguido todo cuanto podÃƒÂ­an esperar de la vida. Sin embargo, ese mundo de ternura y felicidad se derrumbÃƒÂ³ repentinamente el gÃƒÂ©lido dÃƒÂ­a en que Annie muriÃƒÂ³. TenÃƒÂ­a sÃƒÂ³lo cinco aÃƒÂ±os y con ella desaparecieron las ilusiones de toda la familia. John y Liz, incapaces de superar el trauma de una muerte tan injusta, se hundieron en un abismo de incomunicaciÃƒÂ³n y reproches. Por su parte, Tommy, todavÃƒÂ­a adolescente, creyÃƒÂ³ haber perdido no sÃƒÂ³lo a su adorada hermana, sino tambiÃƒÂ©n todo el afecto y la comprensiÃƒÂ³n que hasta entonces le habÃƒÂ­an profesado sus padres. Sin Annie, el hogar de los Whittaker devino un infierno de amargura por el que deambulaban silenciosos, disfrazando el dolor de insensibilidad. Nada podÃƒÂ­a arrancarles del aislamiento en el que les habÃƒÂ­a sumido la muerte de la pequeÃƒÂ±a... Hasta que el destino trajo a sus vidas el ejemplo de Maribeth, una chica de diecisÃƒÂ©is aÃƒÂ±os que huÃƒÂ­a de un entorno familiar opresivo para enfrentarse en solitario a la incertidumbre de su futuro. La valentÃƒÂ­a de Maribeth y su asombrosa capacidad de amar serÃƒÂ­an el revulsivo que la familia Whittaker necesitaba para despertar de su pesadilla y recuperar la ilusiÃƒÂ³n que creÃƒÂ­an haber perdido para siempre","torrent":{"xt":"urn:btih:7cd6c0b6c1dbd0037a6267165f071f00e2ef9694","amp;dn":"El+Regalo+-+Danielle+Steell+%5BEbook%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cd6c0b6c1dbd0037a6267165f071f00e2ef9694","infoHashBuffer":{"type":"Buffer","data":[124,214,192,182,193,219,208,3,122,98,103,22,95,7,31,0,226,239,150,148]},"announce":[],"urlList":[]}}