{"title":"Canadas.Handyman.Challenge.S03E01.Calgary.HDTV.x264-CLDD","uid":9516574,"size":407072065,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7e8d5f3d109e9bd5176560bd6680ae3581028937&amp;dn=Canadas.Handyman.Challenge.S03E01.Calgary.HDTV.x264-CLDD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"duranie","files":1,"time":1390532740,"description":"Canadas.Handyman.Challenge.S03E01.Calgary.HDTV.x264-CLDD.mp4\n\nAirdate: January 21, 2014\n\n\nIn this first episode of the new season Canada's Handyman Challenge, Host Jenn Roberston and Judges Scott McGillivray, Paul Lafrance and Bryan Baeumler travel to Calgary where they meet savvy contestants &quot;pitching&quot; their pre-made plywood project. The Judges select a roster of top ten handymen. This top ten's first challenge is to build a functioning mallet for a high striker game. The Judges give the contestants two hours to complete the challenge and once all the dust settles, three contestants will be eliminated. The remaining seven contestants have to create an adult-size rocking horse with materials typically found in a barn. They will have two and a half hours to complete the challenge. Another three contestants will be eliminated and the remaining four are declared the &quot;Western Canada&quot; finalists.\n\n-----------------------------------------------------------------------\n\n\n\nABOUT THE SHOW:\n\nCanada's Handyman Challenge returns for a third season with more creative and resourceful challenges than ever before. This season HGTV Canada's biggest stars Bryan Baeumler (Leave It To Bryan, House of Bryan), Scott McGillivray (Income Property) and Paul Lafrance (Decked Out, Disater Decks) are on a nationwide search stopping in Calgary, Winnipeg, Toronto and Halifax to find Canada's top amateur handyman talent. Along with host Jennifer Robertson, the all-star judging panel will challenge contestants like never before as they whittle down the competition. With bragging rights on the line, the contestant that best handles the pressure and staves off elimination will walk away with the $25,000 prize. \n\n\n","torrent":{"xt":"urn:btih:7e8d5f3d109e9bd5176560bd6680ae3581028937","amp;dn":"Canadas.Handyman.Challenge.S03E01.Calgary.HDTV.x264-CLDD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e8d5f3d109e9bd5176560bd6680ae3581028937","infoHashBuffer":{"type":"Buffer","data":[126,141,95,61,16,158,155,213,23,101,96,189,102,128,174,53,129,2,137,55]},"announce":[],"urlList":[]}}