{"title":"The Crow","uid":4893985,"size":459764665,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7ee4136e4226f4b57d6dd4c32ac969176cbd54bf&amp;dn=The+Crow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1242213767,"description":"Pack of comics based on The Crow character created by James O'Barr.\n\nThe Crow is the story of a young man named Eric who along with his fiancÃƒÂ¨, Shelley is murdered on an abandoned road, by a gang of junkies, led by T-Bird. Due to the pain suffered by their souls, Eric is sent back to put the wrong things right.\n\nJames O'Barr conceptualized The Crow in the early '80s as a means of getting over his girlfriend's death at the hands of a drunk driver. A self-taught artist, O'Barr first began the series while in the Marines stationed in Germany, where he was on loan to the Army illustrating hand-to-hand combat manuals. Inspired by such diverse sources as the works of French poets George Bataille and Anton Artaud, the music of punk artists Ian Curtis and Iggy Pop, and the stories of Lewis Carroll and Edgar Allan Poe, James O'Barr conceived the character of The Crow as a supernatural force driven by equal parts of love and revenge.O'Barr credits his distinctive visual style to studying classical Renaissance sculpture, film noir, and his two years of medical training.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:7ee4136e4226f4b57d6dd4c32ac969176cbd54bf","amp;dn":"The+Crow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ee4136e4226f4b57d6dd4c32ac969176cbd54bf","infoHashBuffer":{"type":"Buffer","data":[126,228,19,110,66,38,244,181,125,109,212,195,42,201,105,23,108,189,84,191]},"announce":[],"urlList":[]}}