{"title":"Cartas de un Sexagenario Voluptuoso - Miguel Delibes [Epub-Pdf][","uid":6989091,"size":472314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f7ee36e38a59029cabad2433457d151966e7e27&amp;dn=Cartas+de+un+Sexagenario+Voluptuoso+-+Miguel+Delibes+%5BEpub-Pdf%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1327650942,"description":"Cartas de amor de un sexagenario voluptuoso - Miguel Delibes [Epub][word]\n\n\n\nCartas de amor de un sexagenario voluptuoso nos habla del amor, la esperanza o el codiano quehacer de un peculiar sexagenario convirtiÃƒÂ©ndonos en cÃƒÂ³mplices privilegiados del sorprendente desenlace de su historia.\n\nUn viejo solterÃƒÂ³n castellano y periodista jubilado establece una correspondencia progresivamente amorosa con una viuda andaluza a travÃƒÂ©s de una revista sentimental. A lo largo de cuarenta y dos cartas nos proporcionarÃƒÂ¡ un completo retrato de sÃƒÂ­ mismo: su infancia en el pueblo, su carrera de periodista bajo el franquismo, sus ideas sobre el progreso, el amor o la televisiÃƒÂ³n, sus preferencias gastronÃƒÂ³micas o sus arraigadas costumbres de mirÃƒÂ³n impenitente. Las manÃƒÂ­as, los achaques, las osadÃƒÂ­as verbales del personaje y su fundamental timidez, chocan con la historia maravillosa del amor que sueÃƒÂ±o, imagina y pretende convertir en real.\n\nEjemplo de brillantez constructiva y de expresiÃƒÂ³n directa, Cartas de amor de un sexagenario voluptuoso nos habla, con sutil ironÃƒÂ­a, del amor, la esperanza o el cotidiano quehacer para convertirnos en destinatarios de las confesiones de ese peculiar sexagenario y en cÃƒÂ³mplices privilegiados del sorprendete desenlace de su historia.","torrent":{"xt":"urn:btih:7f7ee36e38a59029cabad2433457d151966e7e27","amp;dn":"Cartas+de+un+Sexagenario+Voluptuoso+-+Miguel+Delibes+%5BEpub-Pdf%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f7ee36e38a59029cabad2433457d151966e7e27","infoHashBuffer":{"type":"Buffer","data":[127,126,227,110,56,165,144,41,202,186,210,67,52,87,209,81,150,110,126,39]},"announce":[],"urlList":[]}}