{"title":"Willie Sugarcapps - Willie Sugarcapps [2013][EAC,log,cue. FLAC]","uid":9028127,"size":265447270,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:80642640eff8a9cc853c38f272be1350876c9f89&amp;dn=Willie+Sugarcapps+-+Willie+Sugarcapps+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1381404588,"description":"Artist: Willie Sugarcapps\nRelease: Willie Sugarcapps\nReleased:  2013\nLabel:  Royal Potato Family Records\nCatalog#:  1315\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Americana\n\n01. Willie Sugarcapps\n02. Mr. Lee\n03. Oh, Colorado\n04. Magdalena\n05. Mud Bottom\n06. Energy\n07. Gypsy Train\n08. Poison\n09. Trouble\n10. Up To The Sky\n\nWillie Sugarcapps is a singer/songwriter supergroup comprised of Will Kimbrough, Grayson Capps, Sugarcane Jane (Savana Lee and Anthony Crawford), and Corky Hughes. Its members -- most of whom live on or near the Gulf Coast of Alabama (only Kimbrough lives in Nashville, but is an Alabama native) -- came together while performing a songwriter's round at the Frog Pond gathering on Blue Moon Farm in Silverhill, Alabama. All five have deep attachments to organic music traditions of the Deep South in general, and the Gulf Coast in particular. They enlisted Grammy-winning producer / engineer (and Capps' longtime partner) Trina Shoemaker, who also mixed the ten-song set. The album was cut in a single eight-hour session on the front porch of Sugarcane Jane's house. Acoustic and electric guitars, mandolins, banjos, lap steel, hand percussion, kick drum, and whatever else was available were used in the moment -- though minimal overdubs were added later. Country, bluegrass, blues, roots rock, gospel, and folk come together in this Southern Americana stew that reflects the rich musical culture of the Gulf Coast. Capps' opener, &quot;Willie Sugarcapps,&quot; is a minor key, banjo and guitar, bass and drum-fueled blues, dressed out by staggered country-gospel harmonies. The protagonist of his &quot;Magdalena&quot;' admits his wrongs for the sole purpose of learning to do right by his beloved. Kimbrough's &quot;Oh Colorado&quot; places Lee's alto way up front; her delivery drips with longing for a return to a place whose meaning is held deep in the memory of her heart. She is accompanied by a bass drum, strummed 12-string, and lap steel. Crawford's jaunty, cut-time &quot;Energy,&quot; with its banjo and fat acoustic Kala U bass, is accompanied by ringing mandolins and urgent acoustic guitars; its lyric is almost transcendentally elevated by four-part vocal harmonies. Capps' &quot;Poison&quot; is a reworked reprise from his catalog; a funky, Gulf Coast shuffle that wryly yet poignantly discusses the toll of the BP Oil disaster in the region. The homey, raw grit of the instrumentation stands in sharp contrast to the seamless integration of multi-part harmony. Kimbrough's &quot;Trouble&quot; weds high lonesome, bluegrass-gospel harmonies, mandolins, and his grainy baritone in the intro, before transforming the tune into a choogling blues without losing any of its otherworldly impact. Lots of records get made in a single day, but few possess the quality songwriting and inspired performances this one does. Fewer still so authentically evoke the sense of the region, topography, history, and people of a particular place. Willie Sugarcapps does all this. It is raw and immediate, yet warm, full, and inviting, all while seeming effortlessly rendered. This is the very definition of Americana.\n","torrent":{"xt":"urn:btih:80642640eff8a9cc853c38f272be1350876c9f89","amp;dn":"Willie+Sugarcapps+-+Willie+Sugarcapps+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80642640eff8a9cc853c38f272be1350876c9f89","infoHashBuffer":{"type":"Buffer","data":[128,100,38,64,239,248,169,204,133,60,56,242,114,190,19,80,135,108,159,137]},"announce":[],"urlList":[]}}