{"title":"Abuse [ISO] + Install and Running Instructions","uid":10313510,"size":14781440,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:809dcae9a775f765e79f92fe344eb8b2be3a6ca9&amp;dn=Abuse+%5BISO%5D+%2B+Install+and+Running+Instructions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TerminatorFan","files":3,"time":1402219614,"description":"PC / ENGLISH / FULL (FINAL VERSION) + Installation Instructions\n\n\nPLOT\n\n\n It is the unimaginably distant year 2009. You are Nick Vrenna, falsely locked inside a high security prison. The genetic experiments conducted in the prison, combined with a full-scale riot that took place recently, caused all guards and inmates to be transformed into insane, aggressive mutants. Your job is to escape while stopping the genetic plague from transforming the whole world. \n\n Abuse is a side-scrolling platformer with a lot of shooting. It's a nonlinear game, as the levels often have a few exits that lead to different areas. Your character is a cyborg equipped with various weapons; initially, you only have a weak laser rifle with unlimited ammo, but you can find more powerful guns later on, such as grenade launchers, flamethrowers or lightsabers. You move through a building complex, fighting any enemies you might encounter on the way. The enemies are mostly the mutants, but also the defense systems (such as stationary missile launchers). \n\n While you move with the keyboard, you can aim with your mouse, so you can shoot at any angle no matter what direction you are running. On your way, you'll find elevators, teleporters, cracked walls that can be destroyed and more. \n\n Apart from ammo and health, you can also find upgrades which have a number of beneficial effect - increasing your running speed, for example.","torrent":{"xt":"urn:btih:809dcae9a775f765e79f92fe344eb8b2be3a6ca9","amp;dn":"Abuse+%5BISO%5D+%2B+Install+and+Running+Instructions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"809dcae9a775f765e79f92fe344eb8b2be3a6ca9","infoHashBuffer":{"type":"Buffer","data":[128,157,202,233,167,117,247,101,231,159,146,254,52,78,184,178,190,58,108,169]},"announce":[],"urlList":[]}}