{"title":"Allan Blackstock - Loyalism in Ireland, 1789-1829 [2007][A]","uid":9942560,"size":2234779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80b07e4f7ffabe6a88491df1f1ba02134214a90b&amp;dn=Allan+Blackstock+-+Loyalism+in+Ireland%2C+1789-1829+%5B2007%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397271541,"description":"Description\nProduct Details\nBook Title: Loyalism in Ireland, 1789-1829 (Irish Historical Monographs)\t\nBook Author: Allan Blackstock (Author)\nSeries: Irish Historical Monographs (Book 5)\nHardcover: 336 pages\nPublisher: Boydell Press (June 21, 2007)\nLanguage: English\nISBN-10: 1843833026\nISBN-13: 978-1843833024\n\nBook Description\nPublication Date: June 21, 2007 | ISBN-10: 1843833026 | ISBN-13: 978-1843833024\nIrish loyalism is often neglected in the historical literature or misrepresented as an ideologically rigid and narrowly sectarian foil to emerging nationalism. Yet, in the French Revolutionary wars, loyalism was a recognisable counter-revolutionary ideology with recent parallels in Britain, Europe and America. This book examines the Irish variant in a comparative context and analyses its military, political, cultural and religious dimensions to reveal distinctive strands. A 'liberal' version was receptive to Catholics as loyalists and open to constitutional reform, while an exclusively Protestant version monopolised public expressions of loyalty to politically undermine the campaign for Catholic emancipation. Cultural manifestations of loyalism, including ballads, sermons and Orange parading rituals, are analysed to address questions of popular spontaneity or elite manipulation and changes in Protestant identity. The study reveals that exclusive loyalism needed a physical threat, so the 1828-9 Brunswick Clubs combined militant 1798-style rhetoric with innovative mass petitioning. They failed to prevent emancipation but left a template for Irish Conservatism. ALLAN BLACKSTOCK is a reader at the Academy for Irish Cultural Heritages, School of History and International Affairs at the University of Ulster.\n\nReview\nA much needed foray into the history of Irish loyalism. ANNUAL BULLETIN OF HISTORICAL LITERATURE - EIGHTEENTH CENTURY Greatly advanced in concept and method when compared to other works in the field. Blackstock has effectively redefined the subject (...) all will be indebted to the Herculean trawl he has made to identify the relevant primary source material in the main archives of Britain and Ireland and to his careful deployment of the information contained therein. CATHOLIC HISTORICAL REVIEW\n","torrent":{"xt":"urn:btih:80b07e4f7ffabe6a88491df1f1ba02134214a90b","amp;dn":"Allan+Blackstock+-+Loyalism+in+Ireland%2C+1789-1829+%5B2007%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80b07e4f7ffabe6a88491df1f1ba02134214a90b","infoHashBuffer":{"type":"Buffer","data":[128,176,126,79,127,250,190,106,136,73,29,241,241,186,2,19,66,20,169,11]},"announce":[],"urlList":[]}}