{"title":"Periodic Nanostructures - Mircea V. Diudea, Csaba L. Nagy","uid":15473695,"size":30697890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8125044ea3ed6f2c4426edcea3502ad498758f2e&amp;dn=Periodic+Nanostructures+-+Mircea+V.+Diudea%2C+Csaba+L.+Nagy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470164641,"description":"Periodic Nanostructures - Mircea V. Diudea, Csaba L. Nagy (Springer, 2007).pdf\r\n\r\nIn Periodic Nanostructures, the authors demonstrate that structural periodicity in various nanostructures has been proven experimentally. The text covers the coalescence reactions, studied by electronic microscopy, and shows that the nanoworld is continuous, giving rise to zero- (fullerenes), one- (tubules), two-(graphite) and three-(diamond, spongy carbon) dimensional carbon allotropes.\r\n\r\nThe authors explore foam-like carbon structures, which relate to ‘schwarzites’, and which represent infinite periodic minimal surfaces of negative curvature. They show that these structures contain polygons (with dimensions larger than hexagons w.r.t. to graphite) that induce this negative curvature. The units of these structures appear as nanotube junctions (produced via an electron beam) that have wide potential molecular electronics applications. Self-assembled supramolecular structures (of various tessellation) and diamond architectures are also proposed. The authors propose that the periodicity of close repeat units of such structures is most evident not only in these formations but also present in all of the carbon allotropes. It is also shown that depending on the lattice tessellation, heteroatom type, and/or doping, metal nanostructures (nanotubes in particular) can display both metallic and semiconductor characteristics. Therefore, their properties can be manipulated by chemical functionalization. The authors therefore suggest that nanostructures have heralded a new generation of nanoscale biological, chemical, and physical devices.\r\n\r\nThe text also provides literature and data on the field of nanostructure periodicity and the authors’ own results on nanostructure building and energy calculations as well as topological characterization by means of counting polynomials of periodic nanostructures. The aromaticity of various coverings of graphitic structures is also discussed.\r\n\r\nThis book is aimed at scientists working in the field of nanoscience and nanotechnology, Ph.D. and MSc. degree students, and others interested in the amazing nanoarchitectures that could inspire the cities of the future","torrent":{"xt":"urn:btih:8125044ea3ed6f2c4426edcea3502ad498758f2e","amp;dn":"Periodic+Nanostructures+-+Mircea+V.+Diudea%2C+Csaba+L.+Nagy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8125044ea3ed6f2c4426edcea3502ad498758f2e","infoHashBuffer":{"type":"Buffer","data":[129,37,4,78,163,237,111,44,68,38,237,206,163,80,42,212,152,117,143,46]},"announce":[],"urlList":[]}}