{"title":"Teencats","uid":4718113,"size":370123987,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:81aecebfd3c163e9a68ed15f825b39327b852122&amp;dn=Teencats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GreyEagleHawk","files":134,"time":1234379939,"description":"Rockabilly - Teencats\n\n   These Albums\n\n1. Cat's Rhythm\n2. Footstompin'\n3. Past And Present\n4. Rock Around The Box\n5. Teddy Bop\n6. Teddy Boy Rock 'n' Roll\n7. Greatest Hits\n\n\nNorway is a sparsely populated country. Very, very few bands can claim to have done more than 100 gigs a year in the land of the fjords and mountains. Teencats are one of a kind; they take their music everywhere. The many gigs have turned them into a musical combo which really can function as a band. You can hear that these guys have been playing together a lot, even though they're all young dudes. Actually they played all the time in the beginning as well. They didn't have many gigs, but they practised all week. This was in 1984, when the Reiten brothers were barely into their teens. They had a mutual friend in Ove Marken on guitar, and no bass player at all. \n\nTheir first album was released in 1987 as a cassette-only release. This album showcased the song-writing abilities of lead vocalist, Stig Rune Reiten. Their teenage enthusiasm made up for any technical limitations, and it sure was a good rockin' tape. It was called &quot;Back To The 50's with Rockabilly&quot;, a title the Teencats thought was completely square, but the power of record companies... \n\nTheir second album, and their first LP, was released in 1988. &quot;Cats' Rhythm&quot; was issued by a Swedish label named Booze records. The group had by now recruited Steinar 0xseth as a regular bass player, and also added the very young Anders Westhagen to the line-up. Now the band had a mean guitarist, who more often than not went apeshit on stage. Anders could also hold his own when it came to singing, and turned out to be a good songwriter. Don't let his boyish good looks fool you. He ain't no Fabian. Before long the Dutch Rockhouse label issued the first album as an LP release, now titled &quot;Teddy Bop&quot;. This proved to be a good seller on the international rock 'n' roll scene. \n\nTeencats were welcomed as a band to keep the rock 'n' roll revival traditions of the 70's going. Fans all over Europe compared them to the early days of bands like Crazy Cavan 'n' the Rhythm Rockers and Matchbox. In 1989 their third album, &quot;Teddy Boy Rock'n'Roll&quot; was released. This was the first one on Sonet and sales were very promising. One of the songs, &quot;Elisabeth&quot;, was in the Norwegian charts for ten weeks, and they were on several national TV shows. \n\nThe band had now become a full-time occupation, and this meant another change in line-up. Ove Marken and bass player Steinar 0xseth left the band to pursue daytime careers. Mads Mikkelsen picked up the bass, and the line-up was complete last year, when Robert Huldt brought along his rhythm guitar. And now it was time again for another album. &quot;Rock Around The Box&quot; is no frills rock'n'roll all the way, taking in a bit of cajun and the 60's guitar instrumental sounds for good measure.\n\n\n\n","torrent":{"xt":"urn:btih:81aecebfd3c163e9a68ed15f825b39327b852122","amp;dn":"Teencats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81aecebfd3c163e9a68ed15f825b39327b852122","infoHashBuffer":{"type":"Buffer","data":[129,174,206,191,211,193,99,233,166,142,209,95,130,91,57,50,123,133,33,34]},"announce":[],"urlList":[]}}