{"title":"BANANA SPLITS TV FIRST EPISODE-SiLvErDuSt@sEcTiOn8","uid":4880933,"size":169695135,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:81c6c0b58de8837ed8c680a90fe60c9cb387765f&amp;dn=BANANA+SPLITS+TV+FIRST+EPISODE-SiLvErDuSt%40sEcTiOn8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dodgerblue","files":5,"time":1241378271,"description":"BANANA SPLITS TV FIRST EPISODE-SiLvErDuSt@sEcTiOn8\nTelevision series\nThis is the first pilot episode presented for your enjoyment\nIn 1967, Bill Hanna and Joe Barbera approached the Krofft Brothers to design costumes for a television show which would feature animated and live-action segments, with the whole show hosted by a bubblegum rock group of anthropomorphic characters. The format of the show was loosely based on Rowan &amp; Martin's Laugh-In. The Banana Splits Adventure Hour premiered on NBC on September 7, 1968.[1]\n\nThe Kroffts give credit to the success of the series for opening the door for their own entry into television. NBC picked up the Krofft series H.R. Pufnstuf, which was launched during an hour-long special hosted by The Banana Splits on August 30, 1969.[1]\n\nThe show's live-action segment Danger Island, a cliffhanger serial, as well as the short-lived Micro Ventures, an animated series consisting of only four episodes, ran alongside with the animated segments Arabian Knights and The Three Musketeers.[1] Actor Jan Michael Vincent (billed as Michael Vincent) appeared in the live-action component Danger Island; all the live-action material filmed for the series's first season (including the Banana Splits and Danger Island segments) was directed by Richard Donner.[2]\n\nEach show represented a meeting of the &quot;Banana Splits Club,&quot; and the wraparounds featured the adventures of the club members, who doubled as a musical quartet, meant to be reminiscent of The Beatles and The Monkees. The main characters were Fleegle, a beagle; Bingo, a gorilla; Drooper, a lion, and Snorky (called &quot;Snork&quot; in the theme song lyrics), an elephant. Fleegle would assume the role as leader of the Banana Splits and preside at club meetings. The characters were played by actors in fleecy costumes similar to later Sid and Marty Krofft characters such as H.R. Pufnstuf.\nYoutube crazyness here[code]\nEnjoy\nSiLvErDuSt.","torrent":{"xt":"urn:btih:81c6c0b58de8837ed8c680a90fe60c9cb387765f","amp;dn":"BANANA+SPLITS+TV+FIRST+EPISODE-SiLvErDuSt%40sEcTiOn8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81c6c0b58de8837ed8c680a90fe60c9cb387765f","infoHashBuffer":{"type":"Buffer","data":[129,198,192,181,141,232,131,126,216,198,128,169,15,230,12,156,179,135,118,95]},"announce":[],"urlList":[]}}