{"title":"The Fallen Kings Cycle by Gail Z. Martin","uid":7996193,"size":2978192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83facabf5f5bff2718d966f07af51a7405468fb8&amp;dn=The+Fallen+Kings+Cycle+by+Gail+Z.+Martin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Max-Upload","files":2,"time":1357624811,"description":"Contains The Fallen Kings Cycle by Gail Z. Martin in PDF format. \n \n\nFor ebook devices use an ebook converter like: \nHamster Ebook Converter- http://www.hamstersoft.com/free-ebook-converter \nCalibre- http://calibre-ebook.com/download \n\n1. The Fallen Kings Cycle- The Sworn\nSummoner-King Martris Drayke must attempt to meet this great threat, gathering an army from a country ravaged by civil war. Tris seeks new allies from among the living - and the dead - as an untested generation of rulers face their first battle. Meanwhile, the legendary Dread are stirring in their burrows after millennia of silence and no one knows what hand wakes them and whom they will serve when they rise. Now, Drayke turns to the Sworn, a nomadic clan of warriors bound to protect the Dread. But even the mighty Sworn do not know what will happen when the Dread awake. All are certain, though, that war is coming to the Winter Kingdoms. THE SWORN is the beginning of a new adventure set in the world of The Chronicles of the Necromancer.\n\n2. The Fallen Kings Cycle- The Dread \nWar has come to the Winter Kingdoms. The Dread will rise. Kings will fall. Summoner-King Tris Drayke takes what remains of his army north for a war he is ill-prepared to fight, as reports from spies confirm Tris's worst fear. A new threat rises across the sea: a dark summoner who intends to make the most of the Winter Kingdoms's weakness. In Isencroft, Kiara's father is assassinated and she will now have no choice except to return and claim the crown. But she must leave behind her husband and their infant son to face the dark power that threatens her rule. THE DREAD is the epic conclusion to the Fallen Kings Cycle. \n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:83facabf5f5bff2718d966f07af51a7405468fb8","amp;dn":"The+Fallen+Kings+Cycle+by+Gail+Z.+Martin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83facabf5f5bff2718d966f07af51a7405468fb8","infoHashBuffer":{"type":"Buffer","data":[131,250,202,191,95,91,255,39,24,217,102,240,122,245,26,116,5,70,143,184]},"announce":[],"urlList":[]}}