{"title":"The Pleasures of Summer (Pleasures #2) by Evie Hunter epub","uid":9696548,"size":624355,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8468447c0919956f36bad622c3c9e0dc165fbff8&amp;dn=The+Pleasures+of+Summer+%28Pleasures+%232%29+by+Evie+Hunter+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":1,"time":1393943065,"description":"The Pleasures of Summer (Pleasures #2) by Evie Hunter\nThe Pleasures of Summer is a steamy erotic story of romantic obsession and explosive sexual chemistry for fans of Fifty Shades of Grey, The Pleasures of Winter and Sylvia Day's stories.\n\nSummer O'Sullivan is rich, beautiful and in mortal danger. Her father has made powerful enemies who are targeting his precious daughter. Until the threat passes, Summer needs a bodyguard - someone to protect her and, she expects, to treat her with the reverence she's used to.\n\nInto Summer's gilded cage comes former ranger, Flynn Grant. As far as Flynn is concerned, this is the assignment from hell, minding the spoilt daughter of a multi-millionaire. Summer and Flynn are poised to hate each other on sight. Even his devastating looks do not make up for how Flynn's rules cramp Summer's style. Unsurprisingly, the sparks fly between them. But when Summer breaks the rules one time too often, Flynn teaches her a lesson that leaves them shattered - and bound together in a way that astonishes them both.\n\nIn their remote hideout, the two start a battle over who is the tamer, and who is the tamed. It's a duel that stretches their minds and bodies beyond every limit. And in time their hearts begin to surrender too.\n\nBut when the dark forces that have been stalking Summer finally track them down, the battle is no longer a game, but a matter of life and death ...","torrent":{"xt":"urn:btih:8468447c0919956f36bad622c3c9e0dc165fbff8","amp;dn":"The+Pleasures+of+Summer+%28Pleasures+%232%29+by+Evie+Hunter+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8468447c0919956f36bad622c3c9e0dc165fbff8","infoHashBuffer":{"type":"Buffer","data":[132,104,68,124,9,25,149,111,54,186,214,34,195,201,224,220,22,95,191,248]},"announce":[],"urlList":[]}}