{"title":"Suspicion (1941)","uid":7013406,"size":4440326144,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:85412e529f2e15401e063ea9134717b24c20d1af&amp;dn=Suspicion+%281941%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Auge","files":-1,"time":1328557609,"description":"I am providing important films in ISO for the film buff or novice film historian. It is nearly impossible to find torrent files that include all the extras or even important commentaries.\nThese files are from my collection of DVDs that I have made from rented movies over the last seven years or so.\nNearly all of them have been put onto a DVD5, so unfortunately I do not have an uncompressed source handy.  That said I can assure you that these look GREAT on larger screens.\nI chose to make them this size for economy as DVD9s were $3 each when I started this and DVD5s were .25 cents each.\nNow I am working on putting some of the best ones on a hard drive to be played with my HD TV Media Player and am still thinking economy is the best rule as these are half the size of ripping a DVD9.\nThis is the best quality for the value.\n\nI would love some productive feedback  . . .   :)\n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n1941\n99 minutes\nBlack and White\n1.37:1\nSpoken Language: English\nSubtitles: English, French and Spanish\nBefore the Fact: Suspicious Hitchcock Featureette\nTheatrical Trailer\n\nAwards\n1942 Academy Award:\nBest Actress: Joan Fontaine \nBest Music Score nominee \nBest Picture nominee \n\nSYNOPSIS:  Shy and beautiful Lina (Joan Fontaine, in an Oscar-winning performance) falls head over heels for handsome gambler Johnnie (Cary Grant) -- but after the couple elopes, she begins to fear for her life when she discovers Johnnie's true nature and dark past in this Alfred Hitchcock thriller. Lina's doubts about her husband are compounded when he expresses a growing fascination with poison and a colleague of his meets an untimely death.\n","torrent":{"xt":"urn:btih:85412e529f2e15401e063ea9134717b24c20d1af","amp;dn":"Suspicion+%281941%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85412e529f2e15401e063ea9134717b24c20d1af","infoHashBuffer":{"type":"Buffer","data":[133,65,46,82,159,46,21,64,30,6,62,169,19,71,23,178,76,32,209,175]},"announce":[],"urlList":[]}}