{"title":"French Women Don't Get Fat: The Secret of Eating for Pleasure","uid":11108130,"size":2099936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86a0e452e076c275df9b48212ffcc657fd23e00c&amp;dn=French+Women+Don%27t+Get+Fat%3A+The+Secret+of+Eating+for+Pleasure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jallentino","files":6,"time":1411754362,"description":" &lt;a href=&quot;http://i.imgur.com/Uz0wnBu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i.imgur.com/Uz0wnBu.jpg&lt;/a&gt;\n\nMireille Guiliano &quot;French Women Don't Get Fat&quot;\nVintage | English | ISBN: 0375710515 | 304 pages | azw, epub, lrf, mobi | 2 mb\n\nThis book is one of the many I have read over the past year that take a much more zen approach to food. In particular, it has been wonderful for helping me reframe how I think about food choice and body image. I really appreciate how the author focuses on ENJOYING food instead of fearing it. I also appreciate her encouragement to skip the scale and focus on simply feeling comfortable in your clothes. I can't say that I've lost a lot of weight following the principles in this book, but I am certainly enjoying food a lot more, which was the higher goal for me.\n\nSo what has changed? I'm sitting down at a table for most meals now, instead of grabbing random handfuls of things throughout the day. I prepare foods with the best quality ingredients I can buy. I make an effort to &quot;plate&quot; my food (give it a nice presentation) before I sit down to eat. I give myself a smaller portion than I think I want, because I'm not likely to go back for a second helping, but I am likely to overeat if the first helping is too big. I try to give my full attention to the meal, instead of watching TV or reading something on my phone while I eat. I ask myself, each time I eat, &quot;What do I like about this food?&quot;, and I answer with vivid descriptors that make me glad I'm eating (&quot;It's creamy and tangy and just sweet enough to be satisfying!&quot;). I also put down my fork after every few bites to ask myself whether I'm still hungry, and I stop eating when I'm satisfied, which is not the same as &quot;full&quot; or &quot;stuffed.&quot; It's an important distinction, and one that we've lost in this country. I make an effort now to rely on my brain to tell me when I've had enough, instead of waiting for that uncomfortable feeling in my stomach. In short, the &quot;French way&quot; of eating has really helped me to enjoy food again!\n\nThe book falls short in a couple of respects, however. First, she can come off as condescending towards Americans. I can overlook it, because I think the principles are worth ignoring the slights. But some people have found it off-putting to the point where they can't read the book. Second, she doesn't seem to understand the challenges faced by most middle-class American families. I live in a big city, in a walkable neighborhood, where I can dash out to the (very nice) corner market to pick up ingredients for the evening meal. I also have enough economic security to pay $10 for a bag of fresh cherries without feeling the pinch. My in-laws, however, are underemployed and live in a McMansion suburb where the nearest grocery store is a mega-chain 10 miles away. They are morbidly obese and desperately need some help turning their lifestyle around; however, this book offers them very little help. They are not going to walk to the grocery store; and even if they did, they wouldn't be able to afford most of the foods that this book recommends. It just doesn't make economic sense to buy a $5 bag of apples when frozen pizzas are 3 for $10. I wish she would have suggested ways to adapt her principles to the realities faced by the poor and lower middle class in America, but alas she did not.","torrent":{"xt":"urn:btih:86a0e452e076c275df9b48212ffcc657fd23e00c","amp;dn":"French+Women+Don%27t+Get+Fat%3A+The+Secret+of+Eating+for+Pleasure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86a0e452e076c275df9b48212ffcc657fd23e00c","infoHashBuffer":{"type":"Buffer","data":[134,160,228,82,224,118,194,117,223,155,72,33,47,252,198,87,253,35,224,12]},"announce":[],"urlList":[]}}