{"title":"Gendering the International Asylum and Refugee Debate 2nd ed","uid":12833821,"size":797050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88044792b9f023cd80ee6d269d69095cb6cf1ac3&amp;dn=Gendering+the+International+Asylum+and+Refugee+Debate+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1448417374,"description":"Gendering the International Asylum and Refugee Debate 2nd ed (Palgrave Macmillan, 2015).pdf\r\n\r\nWomen make up at least half of the world's refugees, but only a minority of asylum seekers who reach Western states are female, and both international conventions and national laws and policies on asylum have, frequently, overlooked or ignored the gendered nature of the issues. Despite policies to counter gender-based violence, women in refugee camps are still frequently victims of rape and sexual violence, putting into question the concept of 'international protection'.\r\n\r\nThis fully-revised second edition of Gendering the International Asylum and Refugee Debate aims to remedy the current lack of gender-specific analyses of asylum and refugee issues. It provides a comprehensive account of the situation of women in global forced migration and explains the ways in which women's experiences are shaped by gendered relations and structures. With fully updated content, Freedman presents a wide-ranging examination of all sides of the asylum and refugee debate, looking at causes of refugee flows; international laws and conventions and their application; responses to refugees and asylum seekers; policies and legislation of Western governments in relation to refugees and asylum seekers; and the experiences of refugees and asylum seekers themselves. One particular strength of the study is the use of empirical research undertaken by the author, including interviews with refugees and asylum seekers, members of NGOs and voluntary organisations, and policy makers. The book thus fills a gap in current knowledge of refugee and asylum issues and will be essential reading for academics, students and practitioners alike","torrent":{"xt":"urn:btih:88044792b9f023cd80ee6d269d69095cb6cf1ac3","amp;dn":"Gendering+the+International+Asylum+and+Refugee+Debate+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88044792b9f023cd80ee6d269d69095cb6cf1ac3","infoHashBuffer":{"type":"Buffer","data":[136,4,71,146,185,240,35,205,128,238,109,38,157,105,9,92,182,207,26,195]},"announce":[],"urlList":[]}}