{"title":"Carbons and Carbon-Supported Catalysts in Hydroprocessing","uid":12074274,"size":15132204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8982b58b591eb0ab6f3ac70d6f95326f2b6d6bdc&amp;dn=Carbons+and+Carbon-Supported+Catalysts+in+Hydroprocessing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435594964,"description":"Carbons and Carbon-Supported Catalysts in Hydroprocessing - Edward Furimsky (RSC, 2008).pdf\n\nISBN: 978-0-85404-143-5\n\nCarbon materials have, in recent years, been attracting attention as potential supports in heterogeneous catalysis. In 2006, the number of articles dealing with various types of catalysts supported on carbon approached 1000, however only a fraction of those were devoted to hydroprocessing catalysts, despite the fact that interest in carbons as supports for hydroprocessing catalysts began more than two decades ago. This unique book is a comprehensive summary of recent research in the field and covers all areas of carbons and carbon materials. The potential application of carbon supports, particularly those of carbon black (CB) and activated carbon (AC) in hydroprocessing catalysis are covered extensively in the book. Novel carbon materials such as carbon fibers and carbon nano tubes (CNT) are also covered, including the more recent developments in the use of fullerenes in hydroprocessing applications - an area with little published research. Although the primary focus of this book is on carbons and carbon supported catalysts, it also identifies the difference in the effect of carbon supports compared with the oxidic supports, particularly that of y-AL2O3. Although many books claim to have the same objective, this publication is unique as the difference in catalyst activity and stability was estimated using both model compounds and real feeds under variable conditions. The conditions applied during the preparation of carbon supported catalysts are also comprehensively covered and include various methods of pretreatment of carbon supports to enhance catalyst performance. The model compounds results consistently show higher hydrodesulfurization and hydrodeoxygenation activities of carbon supported catalysts than that of the y-Al2O3 supported catalysts. Also, the deactivation of the former catalysts by coke deposition was much less evident. Importantly, in this book, most of the model compounds studies on hydrodesulfurization and hydrodeoxygenation were conducted in the absence of nitrogen compounds, as the poisoning effects of such compounds on hydroprocessing reactions are well known. Non-conventional metals (e.g., Pt, Pd, Ru, Rh, Re and Ir) supported on carbon supports are also studied in this book as catalysts for hydroprocessing of model feeds and real feeds. The book shows that these catalysts are much more active than conventional metals containing catalysts however the high cost of these metals prevents commercial utilization of these catalysts. Kinetics of hydroprocessing reactions, as well as kinetics of deactivation over carbon supported catalysts are also investigated under a wide range of experimental conditions and the y-Al2O3 supported catalysts have been included for comparison. This book, unique in its field, indicates the future potential of carbon supported catalysts during hydroprocessing, particularly in deep hydrodesulfurization and hydrodemetallization","torrent":{"xt":"urn:btih:8982b58b591eb0ab6f3ac70d6f95326f2b6d6bdc","amp;dn":"Carbons+and+Carbon-Supported+Catalysts+in+Hydroprocessing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8982b58b591eb0ab6f3ac70d6f95326f2b6d6bdc","infoHashBuffer":{"type":"Buffer","data":[137,130,181,139,89,30,176,171,111,58,199,13,111,149,50,111,43,109,107,220]},"announce":[],"urlList":[]}}