{"title":"BinderCon Out of the Binders of Women conference NYU New York","uid":11589414,"size":14979029196,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:89aa29796ecc99f85cef38804ce264a0b0d3022d&amp;dn=BinderCon+Out+of+the+Binders+of+Women+conference+NYU+New+York&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":15,"time":1417210319,"description":"Full video of the talks from this year's inaugural conference:\n\n\nOut of the Binders: Symposium On Women Writers Today\n\nA symposium to empower women and gender non-conforming writers with tools, connections, and strategies to advance their careers.\n\nOctober 11 and 12, 2014, New York City\n\nEvery year since 2009, the VIDA pie charts show us that women writers continue to fall far short of equal representation in major magazines and literary journals. We want to change that: this conference will empower, inspire, and connect a diverse community of women and gender nonconforming writers and media and publishing professionals.\n\nOn October 11 and 12, 2014, we'll convene in New York City for a symposium on/for/by women in the literary arts and film/TV, with a pragmatic approach to shaking up those pie charts: panel discussions on women in the newsroom, starting to write after forty, and challenges faced by women writers of color; professional development workshops on pitching and accounting for freelancers; literary agent &quot;speed dating;&quot; and networking opportunities for everyone from journalism and creative writing students to new freelancers to seasoned professionals.\n\nWe've gathered a diverse roster of dedicated women to organize the event, which will include appearances by Anna Holmes (founder, Jezebel), Leslie Jamison (The Empathy Exams), Kamy Wicoff (founder, SheWrites), Amanda Hess (Slate), Dodai Stewart (Jezebel), Elissa Bassist (The Rumpus), Rachel Eliza Griffiths (Photographer/Poet), Tayari Jones (Silver Sparrow), Imogen Binnie (Nevada), and many more women dedicated to our cause. In addition to our confirmed speakers, this event also has the support of many wonderful writers and organizations, including: TinyLetter, Lena Dunham, Edan Lepucki, WAM! (Women, Action, and the Media), Heraty Law, VIDA, Brooklyn Poets, Sackett Street Writers Workshop, PowderKeg, Vol. 1 Brooklyn, Key West Literary Seminars, Tin House, The Poetry Foundation, and more","torrent":{"xt":"urn:btih:89aa29796ecc99f85cef38804ce264a0b0d3022d","amp;dn":"BinderCon+Out+of+the+Binders+of+Women+conference+NYU+New+York","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89aa29796ecc99f85cef38804ce264a0b0d3022d","infoHashBuffer":{"type":"Buffer","data":[137,170,41,121,110,204,153,248,92,239,56,128,76,226,100,160,176,211,2,45]},"announce":[],"urlList":[]}}