{"title":"cky greatest hits.mp4","uid":11408413,"size":676045408,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:89c629028750bb016d44939ec2b5bbea85cf2ab4&amp;dn=cky+greatest+hits.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"char5564","files":-1,"time":1415501476,"description":"&quot;This one-hour special is the story of the crew of misfits led by skater Bam Margera whose home movies were some of the world's first viral videos, exploded into pop culture and became part of the blockbuster Jackass franchise. Preceded by Jackass Number Two at 8PM, this one-hour MTV special includes never-before-seen footage of Bam, Ryan Dunn and the rest of the CKY crew.&quot;\n\n&quot;In the mid-90s, a group of misfits from Pennsylvania called CKY (aka &quot;Camp Kill Yourself&quot;) crashed Hollywood and helped change the course of showbiz and pop culture. The special is told by Bam Margera and key members of the original CKY crew - including Bam's parents April and Phil Margera; his brother Jesse Margera; Chris Raab (aka Raab Himself), Rake Yohn and more. They revisit CKY's humble yet rebellious PA roots and looks back at their most audacious and hilarious antics. They started filming home movies and skate videos filled with devilishly creative yet simple stunts, skits and pranks and rode them all the way to red carpet stardom. From the Margeras' first homemade skits and the hugely popular CKY videos that arguably became the world's first viral videos, their success led them to become co-stars of the blockbuster Jackass franchise and eventually, their very own MTV series, Viva La Bam. Also appearing in the special are Jackass star Johnny Knoxville, Jackass director Jeff Tremaine, and pro skateboarders Kerry (&quot;Hockey Temper&quot;) Getz and Tim O'Connor, who appeared on some of the original CKY tapes.&quot;\n\nLength: 41m12s\nSize: 644MB\nResolution: 1280x720\nVideo: MPEG-4/H.264, 2000Kbps~\nAudio: AAC, 192Kbps~\n\nCheck your local TV listings for this show here: http://www.tvguide.com/tvshows/cky-the-greatest-hits/tv-listings/710700","torrent":{"xt":"urn:btih:89c629028750bb016d44939ec2b5bbea85cf2ab4","amp;dn":"cky+greatest+hits.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89c629028750bb016d44939ec2b5bbea85cf2ab4","infoHashBuffer":{"type":"Buffer","data":[137,198,41,2,135,80,187,1,109,68,147,158,194,181,187,234,133,207,42,180]},"announce":[],"urlList":[]}}