{"title":"Island of Shame: The Secret History of the U.S. Military Base ","uid":8716832,"size":1991922,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a5fb264d8c98bbfcf117189ea4bf371f1efe25c&amp;dn=Island+of+Shame%3A+The+Secret+History+of+the+U.S.+Military+Base+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1374344087,"description":"Island of Shame: The Secret History of the U.S. Military Base on Diego Garcia By David Vine\n2011 | 288 Pages | ISBN: 0691149836 , 0691138699 | EPUB \n\n\nThe American military base on the island of Diego Garcia is one of the most strategically important and secretive U.S. military installations outside the United States. Located near the remote center of the Indian Ocean and accessible only by military transport, the little-known base has been instrumental in American military operations from the Cold War to the war on terror and may house a top-secret CIA prison where terror suspects are interrogated and tortured. But Diego Garcia harbors another dirty secret, one that has been kept from most of the world--until now.\nIsland of Shame is the first major book to reveal the shocking truth of how the United States conspired with Britain to forcibly expel Diego Garcia's indigenous people--the Chagossians--and deport them to slums in Mauritius and the Seychelles, where most live in dire poverty to this day. Drawing on interviews with Washington insiders, military strategists, and exiled islanders, as well as hundreds of declassified documents, David Vine exposes the secret history of Diego Garcia. He chronicles the Chagossians' dramatic, unfolding story as they struggle to survive in exile and fight to return to their homeland. Tracing U.S. foreign policy from the Cold War to the war on terror, Vine shows how the United States has forged a new and pervasive kind of empire that is quietly dominating the planet with hundreds of overseas military bases.","torrent":{"xt":"urn:btih:8a5fb264d8c98bbfcf117189ea4bf371f1efe25c","amp;dn":"Island+of+Shame%3A+The+Secret+History+of+the+U.S.+Military+Base+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a5fb264d8c98bbfcf117189ea4bf371f1efe25c","infoHashBuffer":{"type":"Buffer","data":[138,95,178,100,216,201,139,191,207,17,113,137,234,75,243,113,241,239,226,92]},"announce":[],"urlList":[]}}