{"title":"GTA 4 Grand Theft Auto IV [Mod] **anuJ ","uid":9366566,"size":13481201494,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8afbdf23548dc89fbe8134734a662322e32d13d3&amp;dn=GTA+4+Grand+Theft+Auto+IV+%5BMod%5D+%2A%2AanuJ+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"anuJXD","files":11,"time":1387431433,"description":"Released: October 29, 2010\nGenre : Action / 3D / 1st Person / 3rd Person / Stealth / Mods\n\nDeveloper : Rockstar North, Rockstar Toronto\nPublisher : Rockstar Games\nPublisher in Russia: 1C-SoftKlab\nRelease from : Dax1\n\nLanguage: English, Multi4\nLanguage: English\nSubtitle Language : English, Multi4\nLocation: 1C\nVersion : 1.0.0.4\nVersion GTA4: 1060 (EFIGS) / 1051 / 1004\nVersion EFLC: 1110 (EFIGS) / 1101 \nPublication Type : RePack\n\nSystem requirements :\noperating system\nWindows 7 x64 Service Pack 1 / Windows 8 x64\nconfiguration for comfortable game\nCPU Core 2 Quad 3 GHz, RAM 4 Gb\nVRAM 1024 Mb, DirectX, Shader Model\nHDD 14.6 Gb\nTablet: enclosing\n\nDescription:\nIn the Â«Grand Theft Auto IV. The full edition &quot; includes action Grand Theft Auto IV, as well as the addition Grand Theft Auto: Episodes From Liberty City, consisting of episodes of The Lost and Damned and The Ballad of Gay Tony, the story lines that complement each other and reveal completely the opposite faces of the criminal world.\n\nIn this release , the original game graphics complemented by a number of modifications that improve the visual gameplay. Just added a number of cars.\n\nFeatures\n\nNiko Bellic, Johnny Klebitts and Luis Lopez live in the worst city in America - Liberty City. It is a paradise for those in power with a stuffed wallet and a nightmare for those who are deprived of these benefits. Niko is desperately seeking to find their place in the &quot;city of infinite possibilities.&quot; Johnny biker gang &quot;The Lost&quot; is trying to survive in brutal feuds between street gangs. Louis, the right hand and bodyguard nightclub owner Tony Prince, nicknamed Blue, Tony, is torn between family and friends, trying not to lose the confidence of one nor the other, it is extremely difficult in a world where everyone has a price. In general, these guys are trying to survive in a city of violence and corruption. Sooner or later their paths cross, and the consequences will be catastrophic.\n\nJust as in life! Series has matured. More serious and thorough approach is visible throughout. For example, to steal a car, you must first break the glass and break the locks; fire even one police officer can lead to death. Used in the game, new graphics technologies provide even greater realism.\nWelcome to New York! Liberty City - a copy of the largest U.S. cities. Only some names and places have been changed in order to comply with political correctness.\nCity Without Borders. Liberty City is truly enormous. To get from one to the other of its suburbs, need an hour of real time. Players can not only admire the dozens of skyscrapers, but also to go inside many buildings, use public transport - such freedom of movement in the GTA was not yet!\nPlexus destinies. Stories Niko Bellic from the original game, as well as Johnny and Luis Lopez Klebitts, appear in new episodes, unique and at the same time connected with each other. Only until the end of his way each character, you can get a complete picture of criminal intrigues, enveloped in Liberty City.\nMaximum capacities. In the Â«Grand Theft Auto IV: Complete Edition&quot; is a full arsenal of weapons, as well as the entire fleet of the fourth part of the famous series, which includes motorcycles, luxury cars, helicopter gunships and even armored vehicles.\n\nIncluded modifications\n\niCEnhancer2 1FINAL: installed, configured, nor cold, not too hot nor dark, not bright.\nHard road tex mod by Dax1: texture mod roads.\nsimple native trainer v.6.4: called the F3 key in the game, a variety of feeders + browser.\nRealistic Car Pack v4: installed, configured, cars do not roll over, also added fixes traffic and vanishing texture.\ngta 4 enb editor: Dax1 adapted to work with iCEnhancer2 1FINAL, called Num7 mouse in the game (not recommended for those who are not fumbles ENB)\nFirst person mod: adds first-person view in the car.\n\nFeatures of Release\n\nRelease is based on Repack `s from z10yded\nDo not cut\nTelevision is compressed by 50% / 20fps\n\nVersion GTA4: 1060 (EFIGS) / 1051 / 1004\nVersion EFLC: 1110 (EFIGS) / 1101\n\nInstallation time GTA4: 1:00\nInstallation time EFLC: 1.5 hour (if GTA4 - 1 hour) Mod tested on different hardware i5 2500k + gtx570 as well as on the platform AMD ati hd 5830 + amd phenom II x4 3.6 ghz. Runs even on a clean system wines 7 x64 SP1, after updating Direct's start, tested in a virtual machine, it is natural for it goes bad in mind the small amount of memory.","torrent":{"xt":"urn:btih:8afbdf23548dc89fbe8134734a662322e32d13d3","amp;dn":"GTA+4+Grand+Theft+Auto+IV+%5BMod%5D+%2A%2AanuJ+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8afbdf23548dc89fbe8134734a662322e32d13d3","infoHashBuffer":{"type":"Buffer","data":[138,251,223,35,84,141,200,159,190,129,52,115,74,102,35,34,227,45,19,211]},"announce":[],"urlList":[]}}