{"title":"Anne-Marie Kilday - A History of Infanticide in Britain, c. 1600","uid":10354982,"size":4689999,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8bc5d1840f41f00c1cdaf64345e4e26b55a8dff5&amp;dn=Anne-Marie+Kilday+-+A+History+of+Infanticide+in+Britain%2C+c.+1600&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1402714050,"description":"Description\nProduct Details\nBook Title: A History of Infanticide in Britain, c. 1600 to the Present\t\nBook Author: Anne-Marie Kilday (Author)\nHardcover: 352 pages\nPublisher: Palgrave Macmillan (June 14, 2013)\nLanguage: English\nISBN-10: 0230547079\nISBN-13: 978-0230547070\n\n===================================================================================\nBook Description\nPublication Date: June 14, 2013\nThis work provides a detailed history of infanticide in mainland Britain from 1600 to the modern era for the very first time. It examines continuity and change in the nature and characteristics of new-born child murder in Scotland, England and Wales over a chronology of more than four centuries. Alongside offering a comparative analysis of the types of individuals suspected of the\noffence, and a detailed appreciation of the different ways in which the crime was carried out, the work also exposes the broad nexus of causal factors which\nunderpinned its enactment. In addition, the work investigates the evolving attitude in social, medical and legal contexts to the killing of young infants in Britain over a substantive time period. Thus the work as a whole is both compelling and innovative as it provides the reader with much more than a mere history of infanticide. The book also contributes much to our understanding of criminal history, gender history, legal history, medical history and social history in its analyses of the different contexts allied to the offence. It does this also through its exploration of the complex characteristics of accusers, commentators and perpetrators across cultures, borders and time.\n\n===================================================================================\nAbout the Author\nAnne-Marie Kilday is Professor of Criminal History at Oxford Brookes University, UK. She has published on the widely on the history of violence and the history of female criminality in Britain, Europe and North America from 1600 to the present.\n===================================================================================","torrent":{"xt":"urn:btih:8bc5d1840f41f00c1cdaf64345e4e26b55a8dff5","amp;dn":"Anne-Marie+Kilday+-+A+History+of+Infanticide+in+Britain%2C+c.+1600","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bc5d1840f41f00c1cdaf64345e4e26b55a8dff5","infoHashBuffer":{"type":"Buffer","data":[139,197,209,132,15,65,240,12,28,218,246,67,69,228,226,107,85,168,223,245]},"announce":[],"urlList":[]}}