{"title":"Wildlife Heroes (gnv64)","uid":9045542,"size":31637663,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8bf83bf397dd6c87a60a23032d5627cd139a004f&amp;dn=Wildlife+Heroes+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1381741529,"description":"Wildlife Heroes: 40 Leading Conservationists and the Animals They Are Committed to Saving \nby Julie Scardina and Jeff Flocken\nRunning Press | March 2012 | ISBN-10: 0762443197 | PDF | 264 pages | 30.1 mb &lt;a href=&quot;\nhttp://www.amazon.com/Wildlife-Heroes-Leading-Conservationists-Committed/dp/0762443197&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Wildlife-Heroes-Leading-Conservationists-Committed/dp/0762443197&lt;/a&gt;\n\nWith one-third of known species being threatened with extinction, wildlife conservationists are some of the most important heroes on the planet, and Wildlife Heroes profiles the work of 40 of the leading conservationists and the animals and causes they are committed to saving, such as Belinda Low (zebras), Iain Douglas-Hamilton (elephants), Karen Eckert (sea turtles), S.T. Wong (sun bear), Steve Galster (wildlife trade), and Wangari Maathai (habitat loss). Since we all should have an interest in conservation, there is a chapter providing information on ways people can get involved and make a difference. Chapter introductions are by author Kuki Gallmann, actor Ted Danson, actress Stefanie Powers, Congressman Jay Inslee, and TV personality Jack Hanna.\n\nAbout the Authors\nJulie Scardina is the Sea World, Busch Gardens, and Discovery Cove Animal Ambassador. She serves on the board of the SeaWorld &amp; Busch Gardens Conservation Fund and is actively involved with several other conservation organizations including the World Wildlife Fund. Julie has appeared on Larry King Live and Dr. Oz . She is a monthly guest on the Today Show and a regular guest on The Tonight Show with Jay Leno as she has for the past 14 years.\nJeff Flocken is the DC Office Director for the International Fund for Animal Welfare (IFAW). He also works on campaigns conserving whales, polar bears, elephants, lions, and a variety of other species through this position. Jeff worked for five years as an International Affairs Specialist in the U.S. Fish &amp; Wildlife Service's Division of International Conservation. He lives in Arlington, VA.","torrent":{"xt":"urn:btih:8bf83bf397dd6c87a60a23032d5627cd139a004f","amp;dn":"Wildlife+Heroes+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bf83bf397dd6c87a60a23032d5627cd139a004f","infoHashBuffer":{"type":"Buffer","data":[139,248,59,243,151,221,108,135,166,10,35,3,45,86,39,205,19,154,0,79]},"announce":[],"urlList":[]}}