{"title":"Rush - LIVE 11/20/1978 'First Time In Tucson SBD'","uid":4669216,"size":86026597,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8d0faab07ce72d26bde422e528fcfcf838c7b72b&amp;dn=Rush+-+LIVE+11%2F20%2F1978+%5C%27First+Time+In+Tucson+SBD%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smbdownload","files":-1,"time":1232672656,"description":"11/20/78 Tucson Community Center, Tucson, AZ \n(Soundboard Recording 128k MP3)\n1H:29M:33S \n\n\nDisc One:\n\n01. Intro/ Anthem \n02. A Passage To Bangkok \n03. By-tor And The Snow Dog \n04. Xanadu \n05. Something For Nothing \n06. The Trees \n07. Cygnus X-1 \n\nDisc Two:\n\n01. Hemispheres \n02. Closer To The Heart\n03. Circumstances \n04. A Farewell To Kings \n05. La Villa Strangiato \n06. 2112 (incomplete) \n\n---------------------------------------------------------------------------------\n\nRush is a Canadian rock band originally formed in August 1968, in the Willowdale neighbourhood of Toronto, Ontario, currently composed of bassist, keyboardist, and lead vocalist Geddy Lee, guitarist Alex Lifeson, and drummer and lyricist Neil Peart. The band and its membership went through a number of re-configurations between 1968 and 1974, achieving their definitive form when Neil Peart replaced original drummer John Rutsey in July 1974, two weeks before the group's first U.S. tour.\n\nSince the release of the band's self-titled debut album in March 1974, Rush has become known for the instrumental skills of its members, complex compositions, and eclectic lyrical motifs drawing heavily on science fiction, fantasy, and libertarian philosophy, as well as addressing humanitarian, social, emotional, and environmental concerns.\n\nHemispheres is the sixth studio album by the Canadian rock band Rush, released in 1978. The album was recorded at Rockfield Studios in Wales.\n\nThis album continues Rush's trend of using the fantasy and science fiction lyrics written by Neil Peart. Similar to their 1976 release, 2112, Hemispheres contains a single, epic song broken into chapters as the first half of the album (Cygnus X-1, Book II: Hemispheres) while the second half contains two more conventionally-executed tracks (&quot;Circumstances&quot;, &quot;The Trees&quot;), then is rounded out by the nine-and-a-half-minute instrumental, &quot;La Villa Strangiato&quot;.\n\nSide one: Hemispheres\nThough science fiction elements are not as prevalent on this album as some previous Rush releases, it contains many fantasy elements, notably those that relate to Greek mythology. &quot;Cygnus X-1 Book II: Hemispheres&quot; is partly a continuation of the last song on Rush's previous album, A Farewell to Kings (&quot;Cygnus X-1, Book I: The Voyage&quot;), in that the theme of Cygnus is revisited both lyrically and musically. However, the lyrical concepts used to continue the story on this album have shifted from that of science fiction to Greek mythology, which is represented in this case by the Apollo/Dionysus dichotomy. This mythology is a vehicle to explore yet another concept, one of pop psychology: more specifically, the differences between &quot;left brain&quot; and &quot;right brain&quot; thinking, hence the title of Hemispheres. This theme was the basis for Friedrich Nietzsche's The Birth of Tragedy From the Spirit of Music, which may have been the source of inspiration for Peart's lyrics.\n\nThe story of the side-long suite &quot;Cygnus X-1 - Book II&quot; begins with an expository lyric stating the cause of the current situation in the story being the competition of the gods Apollo and Dionysus for the &quot;fate of man.&quot; Apollo is first shown wooing the people with &quot;truth and understanding,&quot; &quot;wit and wisdom fair&quot; as &quot;precious gifts beyond compare.&quot; The people delight in these gifts and commence to an &quot;age of enlightenment,&quot; yet they feel something is missing, it has become an intellectual exercise divorced from human meaning. Dionysus enters the song at this stage with promises of &quot;love&quot; and suggests the people throw off the &quot;chains of reason.&quot; The cities are abandoned and a Woodstock-like bacchanel commences, but the people, having abandoned reason, find themselves at the mercy of the elements. The people began to fight over the solution to their ills in an all-or-nothing approach (reason OR emotion). The world becomes divided into &quot;sorry hemispheres&quot; (hence the connection to the &quot;pop&quot; psychology of the right and left brain mythos.)\n\nThe focus now shifts to the protagonist of &quot;Cygnus X-1&quot; from A Farewell to Kings. Acting on an old legend, he has piloted his ship directly into the black hole within the constellation Cygnus; he now emerges in Olympus, the home of the Greek gods, as a disembodied spirit. From here, he has a &quot;god's-eye&quot; view of the battle and can see that the people have divided themselves by a false dichotomy. His silent cry of terror is heard by all, even the gods themselves, who recognize the wisdom of his view and christen him Cygnus, the God of Balance. The suite closes with a short, quiet movement in which he relates his vision of how people should live: &quot;With the heart and mind united/In a single perfect sphere.&quot;\n\nThe album's cover depicts the conflict between the two gods, represented as men atop opposite halves (hemispheres) of a large human brain. Apollo is on the left side, wearing a black business suit and bowler hat and holding a cane, while the naked Dionysus beckons to him from the right side.\n\n\n[edit] Side two\nThe track &quot;Circumstances&quot; appears to be an autobiographical account on Peart's part, with references to the time he spent living in England before moving back to Canada and joining Rush.\n\n&quot;The Trees&quot; is one of Rush's more popular songs. A fable told through fantasy lyrics, a forest suffers from the competition of tall oak trees and shorter maple trees for sunlight. In the end, no one wins as the &quot;trees are all kept equal by hatchet, axe, and saw.&quot; The song's meaning is often debated by fans.\n\nOne common interpretation is that the song is allegorical - descriptive of the relationship between Canada and the United States. In this reading, the Oaks represent the U.S.A., the Maples represent Canada, and the &quot;forest&quot; they share represents North America. (Consider that the oak is the most common species of tree in the U.S. (as the maple is in Canada) and that the maple leaf is part of the Canadian flag.)\n\nPeart has been quoted as saying that the lyrics for this song were inspired by a cartoon and that the song has no deep meaning, but also has said that it is about collectivism.[citation needed]\n\n&quot;La Villa Strangiato&quot; is an instrumental, exhibiting the musicianship of the band as a whole, as well as each member individually. One particularly humorous guitar riff in the song may pick at the listener's memory, though its origin may prove elusive for many people. It is in fact based upon a song composed by Raymond Scott in 1936, entitled &quot;Powerhouse&quot;. This song has been used extensively in various cartoons since the 1940s, no doubt where guitarist Alex Lifeson picked it up from.\n\nHemispheres contains examples of Rush's adherence to progressive rock standards including the use of epic, multi-movement song structures, complex rhythms and time signatures, and flexible guitar solos, like those found in &quot;La Villa Strangiato&quot;.\n\nHemispheres was Rush's fourth consecutive Gold album upon release in 1978 and would subsequently go Platinum in the US.\n\nHemispheres was, for a short period of time, released on red vinyl.\n\n\n\n\n","torrent":{"xt":"urn:btih:8d0faab07ce72d26bde422e528fcfcf838c7b72b","amp;dn":"Rush+-+LIVE+11%2F20%2F1978+%5C%27First+Time+In+Tucson+SBD%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d0faab07ce72d26bde422e528fcfcf838c7b72b","infoHashBuffer":{"type":"Buffer","data":[141,15,170,176,124,231,45,38,189,228,34,229,40,252,252,248,56,199,183,43]},"announce":[],"urlList":[]}}