{"title":"Snowy Night With a Stranger, school of heirresses anthology epub","uid":8889893,"size":344827,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d31fe7129bc070ad48dd73c0912454c465173c3&amp;dn=Snowy+Night+With+a+Stranger%2C+school+of+heirresses+anthology+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dovah12","files":3,"time":1378513356,"description":"Warm up on a winter's night with three passionate love stories from three shining New York Times bestselling authors!\n\nJane Feather leads an unwitting Yuletide traveler down a twisting path....\n\nEdward Vasey, Viscount Allenton, is journeying precariously through a snowstorm when his coach is overtaken by high-waymen! Robbed of his money, Ned takes refuge at Selby Hall, where a spirited beauty with a shocking secret may steal something more -- his heart.\n\n\nSabrina Jeffries unlocks the heart of an embittered lord....\n\nWhen a coach accident strands heiress Elinor Bancroft at the home of the notorious Black Baron, she discovers the Christmas Day heartache that darkened his soul years ago -- and her generous heart brings a festive air to his home and reawakens his spirit to love.\n\n\nJulia London sends a debutante into the wintry Scottish wilds....\n\nSearching for her rakehell brother, an earl lying low in the wake of a scandalous affair, Fiona Haines is led by a rugged Highlander who obscures his scarred face. As they journey on, Fiona draws closer to her brave, enigmatic protector -- but will fury or passion ignite when he reveals his identity?","torrent":{"xt":"urn:btih:8d31fe7129bc070ad48dd73c0912454c465173c3","amp;dn":"Snowy+Night+With+a+Stranger%2C+school+of+heirresses+anthology+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d31fe7129bc070ad48dd73c0912454c465173c3","infoHashBuffer":{"type":"Buffer","data":[141,49,254,113,41,188,7,10,212,141,215,60,9,18,69,76,70,81,115,195]},"announce":[],"urlList":[]}}