{"title":"2013 - The Year In Christian Music (Bundle 54)","uid":9282339,"size":2193012638,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8de84c65ea84bb180a340506e292d441ea0ce97f&amp;dn=2013+-+The+Year+In+Christian+Music+%28Bundle+54%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorrentTracts","files":269,"time":1385955171,"description":"-----------------------------------------------------------------------\n2013 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nI am back after my short hiatus.  I just spent the past couple of weeks out of the county, and with an ill friend.  And I must say it was a little disheartening for me to return home to read two people complaining that they don't consider some of the music included within my bundles to be Christian because of explicit content.\n\nTo that, I will say this.  (1) I spend far too much time and effort collecting and re-sharing this music to purposefully include secular music into my bundles.  (2) Everything, and I do mean absolutely everything I share is first represented to me as Christian music before I ever download it, and share it with you.  (3) When I notice that there is swearing in an album, I immediately delete that album so it never reaches my bundles.  And in turn, it never reaches you.\n\nSo to have someone complaining that there are potty-mouthed so-called Christians out there, and somehow the burden to filter out such music in every song lyric falls upon my already overloaded shoulders is nothing short of asinine. Brethren, I simply refuse to take responsibility for anyone claiming to be a Christian, hiding under a Christian music label, or representing themselves to be God glorifying when many are not.  That's between them and God.  I am not my brother's keeper!  I go out of my way and do my absolute best to cleanse these bundles of questionable content, or known secular music before it ever reaches your desktop.  But sometimes questionable albums might leak through.  After all, I am not perfect.  I don't claim to be perfect.  Nor do I want to be perceived by anyone as being perfect.  The last perfect man got Himself brutally nailed to a cross for me!\n\nIf I sound bitter, I assure you I am.  The collection of this music is by no means easy or a science for me.  I do it through countless websites, immeasurable effort, and hard work at the expense of free time I could be spending with my family.  On average, I am probably spending three hours a day on this ministry.  Sometimes longer.  If by chance I happen to only spend two hours, I consider that a light day.  So please pardon me if my bundles aren't up to your standards.  Please pardon me for corrupting your righteous ears if an Artist chooses to curse in one of his songs.  Please pardon me if I have represented myself as anything other than genuine and steadfast in my efforts to glorify God above all.\n\nBut remember, it takes me three hours a day to do this for you.  And it only takes you a minute and a half to criticize my efforts.  There always seems to be someone out there who knows how to do a job better than someone else.  Yet they never step up to the plate when it comes time to put their money where their mouth is.  So if you can do a better job then me, have at it.  The position can be vacant.  Lord knows I'd love to greatly simplify my life by coming to a torrent tracker such as this 50+ times a year, merely click on a dot torrent file, and feel assured that I have all (or at least much of) the latest Christian music released that year.\n\nNo, my life isn't that simple.  But I am doing everything I can to make your life that simple. And I'm doing it for His glory.  So cut me a little slack already!!!\n\nBreakdown...\n\nHIP-HOP/RAP: Ace Boogie, D-Flow, Disciple, Mike Sarge, SPZRKT.  ALTERNATIVE: Alter Bridge, I Anthem, Sleeping At Last.  CHRISTMAS: Anthem Lights, Charmaine Grace Brown, Citizens, DJ Royalty, Harvest Worship, Holly Starr, Jim Brickman, Various x2.  METAL/HARDCORE: Bloodgood, Day Of Vengeance, Life On Repeat, Stand Your Ground.  POP: Boyzone, Jon McLaughlin.  FOLK: Burlap To Cashmere.  BLUES: Cora Fluker.  CONTEMPORARY: David Crowder Band, Michael Boggs.  DANCE: DJ Cmd.  PRAISE &amp; WORSHIP: Hillsong.  ROCK: MercyMe.  JAZZ: Various, Wynton Marsalis\n\nWe have now shared 1,570 titles amongst ourselves this year.\n\nBundle 54 includes the following 33 releases...\n\n * Ace Boogie - 2013 - Under Construction, Vol 2\n * Alter Bridge - 2013 - Cry A River - Single\n * Anthem Lights - 2013 - Simple Little Christmas\n * Bloodgood - 2013 - Dangerously Close\n * Boyzone - 2013 - BZ20 - Deluxe Edition\n * Burlap To Cashmere - 2013 - From The Vault EP\n * Charmaine Grace Brown - 2013 - The Christmas Sessions\n * Citizens - 2013 - Repeat The Sounding Joy EP\n * Cora Fluker - 2013 - Look How The World Has Made A Change\n * D-Flow - 2013 - Quarter To Vinci\n * David Crowder Band - 2013 - I Am - Single\n * Day Of Vengeance - 2013 - Best Friends And Murderers - Single\n * Dee-1 - 2013 - Psalms Of David II\n * Disciple - 2013 - Mission Possible\n * DJ Cmd - 2013 - Dance 69 - Burning Fire\n * DJ Royalty - 2013 - Feeling Of Love\n * Harvest Worship - 2013 - Awaited King EP\n * Hillsong - 2013 - Depths - Single\n * Holly Starr - 2013 - Yeshua Jesus - Single\n * I Anthem - 2013 - Enemy - Single\n * Jim Brickman - 2013 - The Magic Of Christmas\n * Jon McLaughlin - 2013 - Holding My Breath - String Version\n * Life On Repeat - 2013 - Karma Calls - Single\n * MercyMe - 2013 - Shake - Single\n * Michael Boggs - 2013 - More Like A Lion EP\n * Mike Sarge - 2013 - Wisdom And Flow, Vol 2\n * Sleeping At Last - 2013 - Atlas Space II EP\n * SPZRKT - 2013 - Lucid Dream\n * Stand Your Ground - 2013 - Standards\n * Various - 2013 - Christmas - Joy To The World\n * Various - 2013 - Christmas Time All Year EP\n * Various - 2013 - Rejoice - Christian Jazz\n * Wynton Marsalis - 2013 - The Spiritual Side Of Wynton Marsalis\n\nFor Him,\nTorrentTracts - December 2013","torrent":{"xt":"urn:btih:8de84c65ea84bb180a340506e292d441ea0ce97f","amp;dn":"2013+-+The+Year+In+Christian+Music+%28Bundle+54%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8de84c65ea84bb180a340506e292d441ea0ce97f","infoHashBuffer":{"type":"Buffer","data":[141,232,76,101,234,132,187,24,10,52,5,6,226,146,212,65,234,12,233,127]},"announce":[],"urlList":[]}}