{"title":"Little Miss Innocent (2005,xvid) - double vag, Penny Flame,Asia","uid":4680998,"size":1446010880,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8e982831204894d9d8e2c0415f2e21a48b963698&amp;dn=Little+Miss+Innocent+%282005%2Cxvid%29+-+double+vag%2C+Penny+Flame%2CAsia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_skid","files":1,"time":1233074472,"description":"Little Miss Innocent (2005, DVDRip)\n\n\n\n\n\nscreens (Penny Flame scene) + DVD-covers:\n &lt;a href=&quot;\nhttp://4tpb.blogbugs.org/6250121/Little-Miss-Innocent---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4tpb.blogbugs.org/6250121/Little-Miss-Innocent---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\n\nMusic and adult entertainment collide in this debut release from premier erotic label, Hot Boxxx. The cast reads like a who's who of beauty. It also contains some of the hottest sex scenes ever. Tyrone Shuz debuts his new Hot Boxxx line with all of the above. One on one with Brazilian temptress Paola Rey, beautifully natural breasted Penny Flame and Vanessa Michaels. Throw in young babe Dillan and Asia's double vaginal with Chris Charming and Joachim Kessif. There is something for everyone. It's your turn in the Boxxx!  \n\nActresses\n\n    * Asia                  [DPP IR]\n    * Dillian Lee           [Facial Bald]\n    * Paola Rey             [Facial]\n    * Penny Flame           [Facial]\n    * Vanessa Michaels      [Bald]\n\n\n   \nScene Breakdowns\n\n    * Scene 1. Mick Blue, Penny Flame\n    * Scene 2. Mr. Pete, Paola Rey\n    * Scene 3. Ben English, Vanessa Michaels\n    * Scene 4. Asia, Chris Charming, Joachim Kessef\n    * Scene 5. Dillian Lee, Mr. Pete\n\n\n\nCategory \tAll Sex, Legal Teen, Gonzo\nDirector \tTyrone Shuz\nStudio  \tDigital Sin\nRelease Date \tJan 24, 2005\n\n\n\n\nREVIEW:\n\nLittle Miss Innocent? is a debut title for Tyrone Shuz's new adult line, Hot Boxxx, and it is a worthy endeavor. Little Miss Innocent? focuses on fairly young babes getting mixed up in some pretty heated sex. I thought that this was a great title. Despite the action isn't too nasty and the oral bits could have used a little more energy, the action seemed just right. The girls are also quite easy on the eyes. Here's the scene by scene.\n\nScene 1: Penny Flame, Mick Blue \t\nActs Included: Oral, Vaginal, Facial\nPositions: Missionary, Doggie, Cowgirl, Reverse Cowgirl, Spoon\nCondoms: No\nPenny is an extremely gorgeous little girl. She has a beautiful face, a hot body, and a lovely rack. She opens her scene showing off her great body. Next Mick joins her and gets his hands all over her. He then eats her out and it's fun to watch. However, I would have enjoyed a few more close ups of her sweet box. Afterwards, Mick fucks her before letting her suck his cock. She gives a hands intensive blow job with a lot of energy. The sex that follows continues to be very heated. Penny just looked so inviting. I can't wait to see more of this cutie in the future.\n\n\nAdvertisement:\n\nScene 2: Paola Rey, Mr. Pete \t\nActs Included: Oral, Vaginal, Anal, Facial\nPositions: Missionary, Doggie, Cowgirl, Reverse Cowgirl, Spoon\nCondoms: No\nPaola is the very cute babe on the DVD cover. She has a great face, a smoking hot body, and nice tits. She opens her scene with some great teasing action. It's unfortunate it didn't last longer. The action begins when Pete joins her. He has her suck his cock and she does not fail to impress with the task. The sex continues with plenty of great action. Pete works Paola hard and she seems to really like it. The raw energy they had was great. Plus Paola just looked so damn sexy getting fucked.\n\nScene 3: Vanessa, Ben English \t\nActs Included: Oral, Vaginal, Facial\nPositions: Missionary, Doggie, Cowgirl, Spoon\nCondoms: No\nVanessa is the next girl and a very cute blonde. She has an attractive face, a smooth body, and perky tits. We find her looking very inviting rubbing her clit through her cotton panties. The real fun begins with an energetic blow job. She takes on Ben's cock very well. While she doesn't seem to get a lot in her mouth, it's still very fun to watch. The sex is also exciting. Vanessa has a body that is great to watch in action. Her tits bounce with the slightest thrust and her moans are erotic enough to set you wild.\n\nScene 4: Asia, Chris Charming, Joachim \t\nActs Included: Oral, Vaginal, Double Vaginal, Facial\nPositions: Missionary, Doggie, Cowgirl, Reverse Cowgirl\nCondoms: No\nAsia is an Asian chick that I haven't been too excited with in the past. But lately, she's impressed me and in this scene, she looks really hot. Her scene opens with a montage of solo fun. After a bit, we find her with Chris and Joachim. The scene jumps into a bunch of oral action. Asia sucks cock and gets eaten out. Next Asia takes it from both sides. She sucks and fucks quite well. Towards the end, she takes two cocks in her pussy at once. The action was okay.\n\nScene 5: Dillan, Mr. Pete \t\nActs Included: Oral, Vaginal, Facial\nPositions: Missionary, Doggie, Cowgirl, Reverse Cowgirl\nCondoms: No\nDillan is a fairly cute chick. Her appeal comes from her very young and innocent look. Her scene begins with her fingering herself. She's looking at a porno mag. Next Pete joins her and she gives him a fairly weak blow job. Afterwards, they have sex. The action is pretty decent. There are a few moments when the action gets really hot, but most of the time it isn't anything special.\n\nConcluding Words: I was pretty happy with this release. I enjoyed all of the scenes except one. The very last one with Dillan was a bit plain for my tastes. However, the other scenes were quite good. The first three were exceptionally good. This release is definitely worth checking out. Plenty of hot action with cute looking babes. \n\n\n\n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:8e982831204894d9d8e2c0415f2e21a48b963698","amp;dn":"Little+Miss+Innocent+%282005%2Cxvid%29+-+double+vag%2C+Penny+Flame%2CAsia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e982831204894d9d8e2c0415f2e21a48b963698","infoHashBuffer":{"type":"Buffer","data":[142,152,40,49,32,72,148,217,216,226,192,65,95,46,33,164,139,150,54,152]},"announce":[],"urlList":[]}}