{"title":"Net.Transport-v2.63.415.inc.patch-brd","uid":4320798,"size":3382855,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8f7eb86a9f70632d4c7253d47d99855587d86a94&amp;dn=Net.Transport-v2.63.415.inc.patch-brd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aoloffline","files":1,"time":1217441632,"description":"&quot;Net Transport&quot; (also called NetTransport or NetXfer) is a faster, exciting and the most powerful downloading tool that you ever saw, now support the most pop Internet protocols, including:\n\n    \n\n     HTTP / HTTPS\n    \n\n      FTP / through SSL (Secure Sockets Layer) / SFTP (SSH File Transfer Protocol)\n    \n\n      MMS (Microsoft Media Services)\n    \n\n      RTSP (Real-Time Streaming Protocol)\n    \n\n      PNM (rename PNM to RTSP)\n    \n\n      BitTorrent\n    \n\n      eMule\n    \n\n      RTMP (Real Time Messaging Protocol) \n\n\t\n\nHow many times you like to locally save the streaming media, and you can&amp;#039;t find any appropriate tool to accomplish this simple task. Thanks to Net Transport (NetXfer), now it&amp;#039;s a piece of cake to do it with the help of this magic tool. Net Transport can download MMS and RTSP streaming by multiple threads with perfect video &amp; audio quality. There are some other great features, like &quot;Site Manager&quot; which allows you to keep the active connection with the remote servers. In addition, the support for both SSL and SSH is hardly found in other upload/download tools.\n\nMain Features\n\n   1. The flexible &quot;Scheduler Manager&quot; is also most powerful item in NetXfer. Even you can record the dynamic URL according to time and save it as your desire filename.\n   2. You can use the inbuilt &quot;URL Sniffer&quot; to catch the real URLs for streaming, Flash, etc.\n   3. You can use the simple but powerful &quot;File Manager&quot; to categorize and manage downloaded files more efficiently.\n   4. Simple multi-user management. You can maintain several databases by logging on Windows with different username.\n   5. You can use the inbuilt &quot;Site Explorer&quot; to list the directory structure of the remote server, and easily select the desired files. FTP is the most powerful item in NetXfer.\n   6. FTP reuse mechanism allows you to use one connection to get different files from the same site.\n   7. If you like, you can use accessory FTP client tool called &quot;FTP Transport&quot; (FtpXfer).\n   8. The &quot;Multiple Proxies mode&quot; allows you to assign every working thread a different proxy to break certain site restrictions, like only one connection per IP.\n   9. Proxies with NTLM authentication can penetrate local firewall, like Microsoft ISA 2000.\n  10. You can adjust the bandwidth usage of Net Transport to ensure surf at the same time.\n  11. Monitor browser click. And you can add links through Internet Explorer extended context menu, or drag links to the &quot;drop zone&quot; window, etc.\n  12. Net Transport can automatically shutdown the system or hang up the modem once all downloads are completed.\n  13. Multilingual support for the user interface. We will be glad if you help us localize NetXfer.\n  14. NTLM authentication is supported for both MMS and RTSP. In addition, RN5 authentication works for RTSP.\n  15. You can use multi-threads for both MMS and RTSP to significantly reduce the time of downloads.\n  16. Automatically parse streaming script such as .asx, .smi to acquire real URLs.\n  17. Support SSL encryption for both HTTP and FTP, which is called https and ftps. Also support one-time password to protect your authentication information. Normally password is in the form of clear text, which is easily stolen by IP packet monitor tools. Presently NetXfer is the only one can download https streaming via SOCKS5.\n  18. Support SSH encryption, which is hardly found in other upload/download tools for Windows.\n  19. In version 2, you can record the clip with range.\n  20. On BitTorrent protocol, you can use proxy to download, upload by UPnP. NetXfer supports HTTP/HTTPS/UDP Tracker.\n  21. Both BT and eMule support protocol obfuscation.\n  22. The disk cache buffer can prolong your hard disk life.\n\nSupported OS: Win95 / Win98 / Win98SE / WinME / WinNT4 / Win2000 / WinXP / Win2003 / Vista\n\nRecommend strongly install Internet Explorer 5.01 and above for Windows 95/98/NT.","torrent":{"xt":"urn:btih:8f7eb86a9f70632d4c7253d47d99855587d86a94","amp;dn":"Net.Transport-v2.63.415.inc.patch-brd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f7eb86a9f70632d4c7253d47d99855587d86a94","infoHashBuffer":{"type":"Buffer","data":[143,126,184,106,159,112,99,45,76,114,83,212,125,153,133,85,135,216,106,148]},"announce":[],"urlList":[]}}