{"title":"Virginia Woolf in Manhattan by Maggie Gee -(EPUB MOBI AZW3 PDF)","uid":10810660,"size":4544045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90314aa325cb6ba7a8e682ccde82c81f14100f14&amp;dn=Virginia+Woolf+in+Manhattan+by+Maggie+Gee+-%28EPUB+MOBI+AZW3+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gratefuldawg77","files":6,"time":1408425564,"description":"What if Virginia Woolf came back to life in the twenty-first century?\n\nBestselling author Angela Lamb is going through a mid-life crisis. She dumps her irrepressible daughter Gerda at boarding school and flies to New York to pursue her passion for Woolf, whose manuscripts are held in a private collection.\n\nWhen a bedraggled Virginia Woolf herself materialises among the bookshelves and is promptly evicted, Angela, stunned, rushes after her on to the streets of Manhattan. Soon she is chaperoning her troublesome heroine as Virginia tries to understand the internet and scams bookshops with 'rare signed editions'. Then Virginia insists on flying with Angela to Istanbul, where she is surprised by love and steals the show at an international conference on - Virginia Woolf.\n\nMeanwhile, Gerda, ignored by her mother for days, has escaped from school and set off in hot pursuit.\n\nVirginia Woolf in Manhattan is a witty and profound novel about female rivalry, friendships, mothers and daughters, and the miraculous possibilities of a second chance at life.","torrent":{"xt":"urn:btih:90314aa325cb6ba7a8e682ccde82c81f14100f14","amp;dn":"Virginia+Woolf+in+Manhattan+by+Maggie+Gee+-%28EPUB+MOBI+AZW3+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90314aa325cb6ba7a8e682ccde82c81f14100f14","infoHashBuffer":{"type":"Buffer","data":[144,49,74,163,37,203,107,167,168,230,130,204,222,130,200,31,20,16,15,20]},"announce":[],"urlList":[]}}