{"title":"Nightwish - Century Child [24 bit FLAC] vinyl","uid":8296479,"size":1205329447,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:90884d1969c4775faaff556f2b47ec813a913c4d&amp;dn=Nightwish+-+Century+Child+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"24.96","files":-1,"time":1364154526,"description":"  Nightwish - Century Child (2002) [24 bit FLAC] vinyl\n\n  Released: 2002\n  Source: spi149lp / Finland\n  Genre: Pop/Rock\n  Style: Symphonic Rock\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1.  Bless The Child 6:12 \n  A2.  End Of All Hope 3:54 \n  A3.  Dead To The World 4:19 \n  A4.  Ever Dream 4:43 \n  B1.  Slaying The Dreamer 4:31 \n  B2.  Forever Yours 3:51 \n  B3.  Ocean Soul 4:14 \n  B4.  Feel For You 3:54 \n  B5.  The Phantom Of The Opera 4:09 \n       Beauty Of The Beast (10:22)\n  C1.1 Long Lost Love \n  C1.2 One More Night To Live \n  C1.3 Christabel \n\n  Possibly the biggest success story in the history of Finnish heavy metal, Nightwish celebrated their second chart-topping album in their homeland with 2002's Century Child, which eventually collected numerous awards and went double platinum (60,000 units in Finland) within a year of release. The group's fourth LP overall, Century Child wisely repeated its predecessors' winning characteristics: symphony-enhanced power metal laced with accessible pop sensibilities (mostly straightforward song structures and romantic lyrics), distinguished by the operatic voice of classically trained singer Tarja Turunen. Undoubtedly the key to Nightwish's remarkable success (and since, hugely influential on countless followers like After Forever and Epica), Turunen is actually more restrained in her delivery than one might expect, rarely belting her way overboard in an effort to match the metallic aggression of opening shots &quot;Bless the Child&quot; and &quot;End of All Hope.&quot; Never losing momentum, she duets with bassist Marco Hietala on &quot;Dead to the World,&quot; returns to center stage on the platinum-selling single &quot;Ever Dream&quot; (which combines the group's commercial attributes to perfection), and leads the band towards commercial apotheosis on the gentle ballad &quot;Forever Yours,&quot; which could fit perfectly well in any pop diva's catalog. &quot;Slaying the Dreamer&quot; and &quot;Ocean Soul&quot; resume the power metal with strings and choirs motif, and &quot;Feel for You&quot; curiously appears to draw its eerie riffs and strings from the theme of the Halloween movies! And before they embark on the album's final, ten-minute, three-part magnum opus, &quot;Beauty of the Beast,&quot; Nightwish take a very competent stab at &quot;The Phantom of the Opera&quot; -- no, not the Iron Maiden classic, the Andrew Lloyd Webber musical's title track. Which makes for an interesting tidbit when considering this album's appeal: fans of more aggressive heavy metal might find it simply too saccharine for the palate, but those with an affinity for straightforward rock and pop will not only eat it up, but ask for seconds.","torrent":{"xt":"urn:btih:90884d1969c4775faaff556f2b47ec813a913c4d","amp;dn":"Nightwish+-+Century+Child+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90884d1969c4775faaff556f2b47ec813a913c4d","infoHashBuffer":{"type":"Buffer","data":[144,136,77,25,105,196,119,95,170,255,85,111,43,71,236,129,58,145,60,77]},"announce":[],"urlList":[]}}