{"title":"The Anthony Cumia Show 2015-03-03 MP4 MP3 combo","uid":11734046,"size":304590408,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:92d6e2af4089c4be114cc85f4f102b8e48d97f47&amp;dn=The+Anthony+Cumia+Show+2015-03-03+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1425490296,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Former Congressman Joe Walsh\n\nEpisode 120: Live from the poker table, Joe Walsh sits with Anthony to talk about Netanyahu's speech, the shit Israel puts up with, the old days of legal immigration, people making excuses for law breaking and bad politics, and share thoughts on Obama. Joe chats about his days in congress, explains what he believes the Republican's fears are, the guys talk about John Boehner, shifting concentration on the legal people we already have in America, the possibility of a third party ever happening, the influence money has on getting votes, regulating infrastructure, and today's politicians being &quot;celebrities&quot;. They discuss what Hillary Clinton using her personal e-mail really means, the deception of Washington, scare tactics and the IRS, the intensity of social media, America lacking self-resilience, and people lacking motivation. A few callers chime in to give input on how being &quot;PC&quot; can affect your personal record, the oppressive government, the cycle of democracy, the intent of politicians, the danger of withholding from the government, what it would take to start a revolution, using amnesty to get votes, and Lady Di calls in for basically nothing at all. Ant and Joe then jump into what people seem to think freedom means, lack of belief, radical Islam, Charlie Hebdo, the fear of being labeled, traditional ideology, and left leaning news sources. They go through some news topics involving Cher tweeting homeland security, that prick Andy Kindler now bashing Ricky Gervais, a report out of Ferguson claiming &quot;bias policing&quot;, Little League rule benders, and TACS wraps with a few more calls and by talking about who could win the Presidential vote and how looks matter.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:92d6e2af4089c4be114cc85f4f102b8e48d97f47","amp;dn":"The+Anthony+Cumia+Show+2015-03-03+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d6e2af4089c4be114cc85f4f102b8e48d97f47","infoHashBuffer":{"type":"Buffer","data":[146,214,226,175,64,137,196,190,17,76,200,95,79,16,43,142,72,217,127,71]},"announce":[],"urlList":[]}}