{"title":"Nacho Vidal - Made In Brazil","uid":5152544,"size":1467967488,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:94a9c3a5d1e71fcf28a1b518fd215004f4317b10&amp;dn=Nacho+Vidal+-+Made+In+Brazil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"mclevels","files":2,"time":1257641098,"description":"Nacho Vidal - Made In Brazil\n\nDescription: Nacho doing what comes naturally with gorgeous latinas, with oral and anal high priorities, Released May 2008 approx 2 hr 54\n\nProducer's words: &quot;Nacho Vidal's first hetero boy/girl video in months is an all-Brazilian sexfest, an animalistic return to form for porndom's legendary mad Spaniard. Here you'll find a delectable array of South American sluts, the fierce singlemindedness of Nacho indulging his nastiest obsessions... and anal in every scene. There's ponytailed Daniela Vernes sporting a dog collar while being plowed by Nacho; he puts fishnet stockings on the legs of tattooed Alessandra Marques, who licks his balls and gives him an excellent blowjob before he works a buttplug and then his cock deep into her plush backside; and sexy, reddish-haired Suzana Scoth gets smacked in her pretty face (and elsewhere) with Nacho's cock. Not to mention 2008 AVN Awards &quot;Female Foreign Performer of the Year&quot; winner Monica Mattos! The disc includes behind-the-scenes footage plus Nacho Vidal trailers.&quot;\n\nStarring: Monica Mattos, Babalu Monike, Alessandra Marques, Suzana Scott, Daniela Vernes, Leticia Clicker, Nacho Vidal\n\nThis Torrent is From BootyTape dot Com, An adult torrent tracker dedicated to offering big asses with quality ethnic and multicultural material.\n\nFor Covers, Screenshots and More Adult Torrents:  &lt;a href=&quot;\nhttp://www.performancedate.co","torrent":{"xt":"urn:btih:94a9c3a5d1e71fcf28a1b518fd215004f4317b10","amp;dn":"Nacho+Vidal+-+Made+In+Brazil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94a9c3a5d1e71fcf28a1b518fd215004f4317b10","infoHashBuffer":{"type":"Buffer","data":[148,169,195,165,209,231,31,207,40,161,181,24,253,33,80,4,244,49,123,16]},"announce":[],"urlList":[]}}