{"title":"The SAS in World War II-An Illustrated History (2011).pdf Gooner","uid":12063264,"size":31409570,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9545dadc52cef55af0302421815bae60daa6d451&amp;dn=The+SAS+in+World+War+II-An+Illustrated+History+%282011%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1435334530,"description":"Publisher: Osprey Publishing; First Edition first Printing edition (November 22, 2011)\nLanguage: English\nISBN-10: 184908646X\nISBN-13: 978-1849086462\n\nIn his new book, WWII historian Gavin Mortimer, examines the pivotal events of one of the most famous military units of all time. Starting with the unit's formation in July 1941, Mortimer recreates the heady days when a young Scots' Guard officer called David Stirling persuaded MEHQ to give its backing to a small band of 60 men christened 'L Detachment.' From there, drawing on over 100 hours of interviews with veterans (much of which has never before been published) he describes the early raids in the desert against Axis airfields that inflicted a deadly cost on the enemy. Embellished with 150 stunning photographs, the majority of which have never before been printed, the book also features side panels on the Lewes bomb, selection and training of personnel, the importance of the French and Belgian squadrons and how the French resistance helped the regiment in 1944.\n\nAbout the Author\n\nGavin Mortimer is the author of Stirling (Weidenfeld &amp; Nicolson, 2004), a ground-breaking history of the early operations of the SAS, The Longest Night: Voices from the London Blitz (Weidenfeld &amp; Nicolson, 2005) and The Blitz: An Illustrated History (Osprey, 2010). An award-winning writer whose books have been published on both sides of the Atlantic, Gavin has previously written for The Telegraph, The Sunday Telegraph, The Observer and Esquire magazine. He continues to contribute to a wide range of newspapers and magazines from BBC History to the American Military History Quarterly. In addition he has lectured on the SAS in World War Two at the National Army Museum","torrent":{"xt":"urn:btih:9545dadc52cef55af0302421815bae60daa6d451","amp;dn":"The+SAS+in+World+War+II-An+Illustrated+History+%282011%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9545dadc52cef55af0302421815bae60daa6d451","infoHashBuffer":{"type":"Buffer","data":[149,69,218,220,82,206,245,90,240,48,36,33,129,91,174,96,218,166,212,81]},"announce":[],"urlList":[]}}