{"title":"Wordpress plugin - Jetpack by  - Jan 2014","uid":9535775,"size":16597905,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:95fc97ea8363c3508d12c4573b9a53f7b421c3a6&amp;dn=Wordpress+plugin+-+Jetpack+by++-+Jan+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FreeShare89","files":-1,"time":1390928603,"description":"Jetpack is a WordPress plugin that supercharges your self-hosted WordPress site with the awesome cloud power of\n\nFor more information, check out Jetpack.me.\n\nFeatures include:\n\n- Simple, concise stats with no additional load on your server. Previously provided byStats.\n- Email subscriptions for your blog's posts and your post's comments.\n- Social networking enabled comment system.\n- Likes, allowing your readers to show their appreciation of your posts.\n- Monitor and manage your site's activity with Notifications in your Toolbar and on\n- Simple, Akismet-backed contact forms.\n- TheURL shortener.\n- Hovercard popups for your commenters via Gravatar.\n- Easily embedded media from popular sites like YouTube, Digg, and Vimeo.\n- The ability to post to your blog from any email client.\n- Integration with and automatic posting to your favorite social networks including Twitter, Facebook, Tumblr, Path, and LinkedIn.\n- For the Math geeks, a simple way to include beautiful mathematical expressions on your site.\n- A widget for displaying recent tweets. Previously provided by Wickett Twitter Widget\n- Your readers can easily share your posts via email or their favorite social networks. Previously provided by the Sharedaddy WordPress plugin.\n- Your writing will improve thanks to After the Deadline, an artificial intelligence based spell, style, and grammar checker. Previously provided by the After the Deadline WordPress plugin.\n- With Carousel active, any standard WordPress galleries you have embedded in posts or pages will launch a gorgeous full-screen photo browsing experience with comments and EXIF metadata.\n- A CSS editor that lets you customize your site design without modifying your theme.\n- A mobile theme that automatically streamlines your site for visitors on mobile devices.\n- Mobile push notifications for new comments via WordPress mobile apps.\n- The ability to allow applications to securely authenticate and access your site with your permission.\n- Creative formats for your image galleries: mosaic, circles, squares, and a slideshow view.\n- Add post sliders and other highlights to your theme with Featured Content.\n- Search once, get results from everything! A single search box that lets you search posts, pages, comments, media, and plugins.\n- Configure widgets to appear only on certain pages with the Widget Visibility module.\n- Upload and insert videos into your posts thanks to VideoPress.\n- Link Jetpack and your Google+ Profile to add mutliple Google features to your site.\n- Sign in to your self-hosted WordPress site using yourlog-in credentials.\n- Jetpack Monitor will keep tabs on your site, and alert you the moment that downtime is detected.\n- and many more to come!\n\n\nINSTALLATION:\n1. Install Jetpack by uploading the files to your server\n2. After activating Jetpack byyou will be asked to connect toto enable the Jetpack features.\n3. Click the connect button and log in to aaccount to authorize the Jetpack connection.\n4. If you don't yet have aaccount, you can quickly create one after clicking the connect button.\n5. That's it. You're ready to go!\n\n    ","torrent":{"xt":"urn:btih:95fc97ea8363c3508d12c4573b9a53f7b421c3a6","amp;dn":"Wordpress+plugin+-+Jetpack+by++-+Jan+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95fc97ea8363c3508d12c4573b9a53f7b421c3a6","infoHashBuffer":{"type":"Buffer","data":[149,252,151,234,131,99,195,80,141,18,196,87,59,154,83,247,180,33,195,166]},"announce":[],"urlList":[]}}