{"title":"Tatort 631 Eisner - Toedliches Vertrauen.avi","uid":4975139,"size":732704768,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:97ed627c2c56db68b1a223c46586d8ce0c2119ed&amp;dn=Tatort+631+Eisner+-+Toedliches+Vertrauen.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kaufrausch","files":1,"time":1245961538,"description":"Inhalt:\nDer international erfolgreiche Physiker Raimund Jakobi wird am helllichten Tag erschossen. Der geniale Forscher und Abteilungsleiter der Firma Ultra Light Car stand knapp vor dem Zieleinlauf eines millionenschweren Projektes: der Entwicklung eines weltweit neuartigen Werkstoffs fÃƒÂ¼r die Autoindustrie. Kriminalkommissar Eisner trifft bei ULC auf eine geladene und gereizte Stimmung: der sozial inkompetente Jakobi war bei seinen Mitarbeitern alles andere als beliebt. Vom Gelingen seines Projektes hÃƒÂ¤ngt auÃƒÅ¸erdem die Zukunft der Firma ab. Entlassungen drohen, der Betriebsrat macht mobil, der Vorstand fordert dringend profitable Ergebnisse. GeschÃƒÂ¤ftsfÃƒÂ¼hrer Hannes Kubek, von mehreren Seiten unter Druck gesetzt, konfrontiert Eisner mit der Vermutung, dass wirtschaftliche Konkurrenten hinter Jakobis Ermordung stecken kÃƒÂ¶nnten. Aber schon bald stÃƒÂ¶ÃƒÅ¸t Eisner auf die privaten Minenfelder des Egozentrikers Jakobi: seine Exfrau, zurÃƒÂ¼ckgelassen mit zwei Kindern und Schulden. Seine aktuelle LebensgefÃƒÂ¤hrtin und zugleich hochkarÃƒÂ¤tige Mitarbeiterin, gedemÃƒÂ¼tigt und offenbar nur mehr zweite Wahl. Und die kaputte Freundschaft zu GeschÃƒÂ¤ftsfÃƒÂ¼hrer Hannes Kubek. Eisner konzentriert sich auf Kubeks persÃƒÂ¶nliches VerhÃƒÂ¤ltnis zu Jakobi. Dazu erhofft er sich Informationen von der attraktiven und raffinierten Unternehmensberaterin Carina Reif, von der sich Kubek coachen lÃƒÂ¤sst. Bald wird Eisner klar, dass Jakobi das Vertrauen seiner Freundes Kubek auf ÃƒÂ¼belste Art und Weise verspielt hat. Alles deutet darauf hin, dass fÃƒÂ¼r den Mord private HintergrÃƒÂ¼nde ausschlaggebend sind, bis verbotene Zugriffe auf geheime Projektdaten entdeckt werden. Damit rÃƒÂ¼ckt der Fall wieder auf die hochbrisante Ebene internationaler WirtschaftskriminalitÃƒÂ¤t.\n\nBesetzung:\n\nMoritz Eisner - Harald Krassnitzer\nClaudia Eisner - Sarah Tkotsch\nRaimund Jacobi - Hary Prinz\nAgnes Jacobi - Pia Baresch\nKarin Hartl - Patricia Hirschbichler\nDr. Christine Schwarz - Julia Stemberger\nCarina Relf - Maria KÃƒÂ¶stlinger\nHannes Kubek - Jan-Gregor Kremp\nIngrid Kubek - Petra MorzÃƒÂ©\nBianca Kubek - Pippa Galli\n\n\nStab:\n\nRegie - Holger Barthel\nBuch - Thomas Baum\nKamera - Peter von Haller","torrent":{"xt":"urn:btih:97ed627c2c56db68b1a223c46586d8ce0c2119ed","amp;dn":"Tatort+631+Eisner+-+Toedliches+Vertrauen.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97ed627c2c56db68b1a223c46586d8ce0c2119ed","infoHashBuffer":{"type":"Buffer","data":[151,237,98,124,44,86,219,104,177,162,35,196,101,134,216,206,12,33,25,237]},"announce":[],"urlList":[]}}