{"title":"The Victor Marx Story With God, All Things Are Possible","uid":8686114,"size":795193062,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:997bc6479bc3b8c2c6e6995852203b170bdb2194&amp;dn=The+Victor+Marx+Story+With+God%2C+All+Things+Are+Possible&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MarcusVE","files":5,"time":1373806821,"description":"INCLUDES Victor Marx's autobiographical book: &quot;The Victor Marx Story With God, All Things Are Possible&quot;\n\n-------\n\nBorn to an absentee father who was a pimp and a drug dealer; who didn't claim him as his own child, Victor Marx was left for dead in a cooler by a child molester at the age of 5 in the deep South. By the time he was a teenager, Victor endured abuse from several step-fathers, attended 14 different schools and lived in 17 different houses. He was doing drugs in an effort to escape the emotional pain of his childhood. As an adult, Victor was diagnosed with mental illness and post-traumatic stress disorder. It seemed as if there was no way out. He could have chosen to remain a victim. Instead, he learned what it means to become victorious. Victor Marx travels the world as founder and President of All Things Possible, a national faith- based organization. Using his expertise as a 7th Degree Black Belt in Keichu-Do - a mixture of Karate and Jiu-Jitsu - and a 5th Degree in Weapons, Victor engages audiences of all types, delivering a powerful message of hope and restoration.","torrent":{"xt":"urn:btih:997bc6479bc3b8c2c6e6995852203b170bdb2194","amp;dn":"The+Victor+Marx+Story+With+God%2C+All+Things+Are+Possible","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"997bc6479bc3b8c2c6e6995852203b170bdb2194","infoHashBuffer":{"type":"Buffer","data":[153,123,198,71,155,195,184,194,198,230,153,88,82,32,59,23,11,219,33,148]},"announce":[],"urlList":[]}}