{"title":"K.T.Lewandowski - cykl Diablu Ogarek 1-3 [EPUB+MOBI] [PL]","uid":13690144,"size":2225231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99f000eba494e001b64adc33ce9a8bf64d3f51ae&amp;dn=K.T.Lewandowski+-+cykl+Diablu+Ogarek+1-3+%5BEPUB%2BMOBI%5D+%5BPL%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"everdarksoul","files":10,"time":1456600599,"description":"Konrad T. Lewandowski - cykl: Diabłu Ogarek 1-3\r\njęzyk: PL / format: EPUB+MOBI / jakość: dobra\r\n\r\nPaczka ebook'ów 3 powieści cyklu &quot;Diabłu Ogarek&quot; autorstwa K.T. Lewandowskiego. Jest to połączenie fantastyki z powieścią historyczną, a cykl ten autor dedykuje własnym przodkom.\r\n\r\nDiabłu Ogarek -1- Czarna Wierzba\r\nLipiec 1639 roku, Mazowsze, miasta Liw i Węgrów. Ostatnie chwile niezmąconej niczym chwały i dobrobytu Rzeczypospolitej...\r\nWeteran wojny smoleńskiej - Stanisław Jakub Lawendowski herbu Paprzyca, woźny trybunału ziemi liwskiej - specjalizuje się w doręczaniu pozwów wyjątkowo agresywnym adresatom. Bywa, że jak weźmie skwitowanie odbioru, to wyrok nie jest już konieczny... Czasem jednak zawodzą naturalne sposoby, i aby sprawiedliwości stało się zadość, niezbędna jest pomoc czarnej magii...\r\nTe kontrowersyjne praktyki są solą w oku pewnego biskupa, oraz podróżującego incognito hiszpańskiego inkwizytora. Miejscowi magnaci zaś dostrzegają okazję przeprowadzenia własnej przewrotnej intrygi.. Autor oddaje hołd swoim przodkom - drobnej szlachcie gniazdowej z mazowieckich zaścianków - i zabiera czytelnika w nostalgiczną podróż w czasie, do epoki, w której najwyższymi wartościami były: ład w świecie i zaświatach, oraz poprawne stosunki z sąsiadem - choćby nawet był to sam Diabeł...\r\n\r\nDiabłu Ogarek -2- Kolumna Zygmunta\r\nWarszawskie Krakowskie Przedmieście za dnia zdawało się oranżerią pełną pstrokatych motyli, kwiatów i powabnych łątek o wysmukłych kibiciach. Natomiast po zmroku przechodziło iście wilkołaczą przemianę i zaczynały się tutaj dziać łotrzykowskie fenomeny... Tu najchętniej załatwiano wszelkie tajne porachunki - nawet, nie bacząc na świętość miejsca, w kościołach miejscowych, które też okradano regularnie...\r\nMłody pisarz do szaleństwa zakochany w pięknej dwórce, śledząc najnowsze plotki z królewskiego dworu, wpada na trop intrygi, w którą zamieszane są najważniejsze postaci ówczesnej Rzeczypospolitej. Rozwikłania zagadki noszącej znamiona czarnoksięskich praktyk podejmuje się - z osobistych powodów - Stanisław Jakub Lawendowski herbu Paprzyca, namiestnik warszawskiej straży marszałkowskiej. Pomagają mu zarówno młodzi zakochani, jak i tajemnicza żydowska wiedźma. Rezultaty śledztwa szybko przekraczają najśmielsze oczekiwania, a zaangażowanym w nie bohaterom zaczyna grozić śmiertelne niebezpieczeństwo...\r\nAutor odkurzył stare warszawskie legendy, z przewrotnym poczuciem humoru opisując kulisy wystawienia kolumny króla Zygmunta. Barwny portret siedemnastowiecznej stolicy, od magnackich posiadłości po zamtuzy i szemrane zakątki Krakowskiego Przedmieścia, wyraziste postaci, nieprzewidywalne zwroty akcji i historia romantycznego związku z zaskakującym finałem składają się na diabelnie interesującą powieść.\r\n\r\nDiabłu Ogarek -3- Ostatni Hołd\r\nKoniec lata 1641 roku. Młody pruski książę elektor Fryderyk Wilhelm Hohenzollern uparcie odwleka hołd należny królowi Polski Władysławowi IV. Tymczasem woźny trybunału ziemi liwskiej – Stanisław Lewandowski herbu Paprzyca - otrzymuje dwa wyjątkowo kłopotliwe zlecenia naraz. Na dodatek jego aplikant, Grzesiek, koniecznie chce się wykazać i ani myśli dłużej siedzieć w zaścianku, studiując pożółkłe statuty sejmowe. Wszystkie te zaszłości nieoczekiwanie splatają się ze sobą, sprowadzając na woźnego lawinę kłopotów, łącznie z klątwą i losem żywego potępieńca.\r\nAkcja tej powieści Konrada Lewandowskiego rozstrzyga się ...w zaświatach - w których dochodzi do skrytej, czarnoksięskiej agresji na Rzeczpospolitą. Okazuje się jednak, że król Władysław może liczyć na wiernych poddanych nie tylko z krwi i kości...\r\nAutor nawiązuje tu do ludowych legend kurpiowskich, oraz łączy je z autentycznymi praktykami pruskich czarowników z okresu wojen polsko-krzyżackich, tworząc oryginalny i niesamowity amalgamat","torrent":{"xt":"urn:btih:99f000eba494e001b64adc33ce9a8bf64d3f51ae","amp;dn":"K.T.Lewandowski+-+cykl+Diablu+Ogarek+1-3+%5BEPUB%2BMOBI%5D+%5BPL%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f000eba494e001b64adc33ce9a8bf64d3f51ae","infoHashBuffer":{"type":"Buffer","data":[153,240,0,235,164,148,224,1,182,74,220,51,206,154,139,246,77,63,81,174]},"announce":[],"urlList":[]}}