{"title":"Cerebus - The early issues","uid":8644385,"size":301722880,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9a9e3b114eac2ea4bddc8da9f6d0d87e374a6d4d&amp;dn=Cerebus+-+The+early+issues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fudoh101","files":25,"time":1372953136,"description":"The twenty five first issues of Cerebus, before any main story-line was established.\n\nWelcome to Estarcion, the wildly absurd and funny world of Cerebus the Aardvark. This initial volume collects the first two years of stories from Dave Sim's 300-issue magnum opus (still in progress after 20 years). Don't be discouraged by the initially crude artwork or the silliness of the stories. It gets better--even noticeably within this volume. This first installment is the most valuable in preparing for the larger stories ahead.\nWhen we first meet Cerebus--a small, gray, and chronically ill-tempered aardvark--he is making his living as a barbarian. In 1977, when the Cerebus comic book series began, Sim initially conceived of it as a parody of such popular series as Conan, Red Sonja, and Elric but quickly mined that material and transformed the scope of the series into much more. Even by the end of this volume, the Cerebus story begins to transform beyond &quot;funny animal&quot; humor into something much more complex and interesting.\n\nHigh points in Cerebus include the introduction of Lord Julius, the dictator of Palnu, who looks, acts, and talks just like a certain cigar-smoking, mustachioed comedian; Jaka, Cerebus's one true love; Elrod the Albino, an innept swordsman; and the Cockroach, the-mother-of-all-superhero-parodies and &quot;inspiration&quot; for the much-later TV and comic character--the Tick. All of these characters appear later on in the series as part of a constantly present ensemble of supporting figures.","torrent":{"xt":"urn:btih:9a9e3b114eac2ea4bddc8da9f6d0d87e374a6d4d","amp;dn":"Cerebus+-+The+early+issues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a9e3b114eac2ea4bddc8da9f6d0d87e374a6d4d","infoHashBuffer":{"type":"Buffer","data":[154,158,59,17,78,172,46,164,189,220,141,169,246,208,216,126,55,74,109,77]},"announce":[],"urlList":[]}}