{"title":"Nicolo Paganini - Works for Violin and Guitar","uid":7834653,"size":117411250,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9ac7e83c52fa1a049abe53630dd8e5f051197430&amp;dn=Nicolo+Paganini+-+Works+for+Violin+and+Guitar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Christian93","files":24,"time":1353163971,"description":"Paganini for Two / Gil Shaham, Goran Sollscher\n\nIt is an interesting fact that Paganini wrote over 100 solo pieces for the guitar even though he is now known primarily for his violin works. Paganini is believed to have used the guitar as the instrument of choice during composition. Although his guitar pieces do not approach the virtuosic exuberance of the more famous violin counterparts such as the &quot;24 Caprices&quot;, they define an intimate and private Paganini; one who indulges in a more relaxed and quiet setting- away from the fireworks of the stage performances. However make no mistake- many of these pieces from this recording are meant to be played with a lot of fire and splendid bowtapping such as the &quot;Moto Perpetuo&quot; (the last selection) and Shaham's rhythmic attack never slackens even in the most demanding passages.\n\n&quot;Paganini for Two&quot; on first glance sounds like any other recording made especially for background dinner music (even the tiny sticker on the packaging highlights this point!)but there is a lot of lyrical refinement for even the serious Paganini collector and classical music lover. A number of Sonatas are included although at times the guitar plays a lesser role. I would have preferred to see the entire &quot;Grand Sonata&quot; appear in this recording but only the &quot;Romance&quot; from it- a very short four and a half minute piece is included. The rest of the programme if not generous is still varied and interesting- stretching slightly over 60 minutes.\n\nAll this talk of Shaham certainly does not detract from the wonderful accompaniment provided by veteran guitarist Goran Sollscher who was known previously for his luminous recordings of the Bach Lute suites (also on DG)and refreshing interpretations of even the music of the Beatles! You can hear every one of Sollscher's notes and this partnership is certainly a very successful one. To cap it all off, the sound is crystal clear with a lot of depth and proper soundstaging. The violin and guitar sound very holographic and on a good hi-fi equipment, this disc can be worthy of demonstration material.","torrent":{"xt":"urn:btih:9ac7e83c52fa1a049abe53630dd8e5f051197430","amp;dn":"Nicolo+Paganini+-+Works+for+Violin+and+Guitar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ac7e83c52fa1a049abe53630dd8e5f051197430","infoHashBuffer":{"type":"Buffer","data":[154,199,232,60,82,250,26,4,154,190,83,99,13,216,229,240,81,25,116,48]},"announce":[],"urlList":[]}}