{"title":"New Marvel I Like 4-25-2012","uid":7216160,"size":195197873,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9c524003095da2612ae53576fcf889d366339bb6&amp;dn=New+Marvel+I+Like+4-25-2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":12,"time":1335384417,"description":"These are the Marvel comics I got from the week beginning 4/25/2012.  These are not a complete list of what Marvel put out this week.  There are other torrents for that. There are 10 titles in this week's offering. All comics are either in CBR or CBZ format and are labelled individually.  Please do not share my descriptions or torrent ads with anyone without messaging me first.  If this torrent has no seeds please msg me privately.  I will be glad to reup anything that has no seeds.\n\n\n\nAstonishing X-Men #49 (CBR 4/25/2012)\n\nThe Marauders are back! Something from Northstar's past has resurfaced and is looking for revenge. Kyle goes missing--how is he connected to the person behind everything? \n\nAvx vs. #1 (of 6) (CBR 4/25/2012)\n\nThe premier tie-in to Avengers vs. X-men! All-out action featuring cover-to-cover battles, each issue expanding on fights from the main AvX book in ways you can't imagine! This issue: Iron Man vs. Magneto and Thing vs. Namor! \n\nBattle Scars #6 (of 6) (CBR 4/25/2012)\n\nMarcus Johnson's life changes forever as he discovers the truth about himself--and Orion stands revealed! What does Nick Fury have to do with the conspiracy at the heart of the Marvel Universe? As the penultimate chapter of the story that will rock the Marvel U unfolds, no one comes out unscathed! \n\nCaptain America #10 (CBR 4/25/2012)\n\nConclusion of &quot;Powerless&quot;! Can Cap's condition be cured? Falcon fights alongside the enemy! Hydra revealed and a new name for an arch-enemy! \n\nCaptain America and Hawkeye #629 (CBR 4/25/2012)\n\nCaptain America and Hawkeye vs. Dinosaurs!?! Something's rotten in the San Andres mountains...and it's eating the locals. Join Fearless writer Cullen Bunn as he teams Captain America up with the best, the worst and the downright villainous of the Marvel Universe for all-new, all-action and all-awesome arcs chock-full of high-octane insanity! Best bring a helmet! \n\nDaredevil #11 (CBR 4/25/2012)\n\n&quot;The Omega Effect&quot; concludes! Daredevil and Spider-Man join Frank Castle in a blitzkrieg takedown of New York crime--but don't take it for granted that these heroes are all working together.\n \nFF #17 (CBR 4/25/2012)\n\n&quot;Roomies&quot;: Now that he's back among the living, the Human Torch moves in with Spider-Man! Can two superheroes share an apartment without driving each other crazy? What secret lies behind the door to Annihilus' closet? Who throws a house party like the Light Brigade? \n\nNew Avengers #25 (CBR 4/25/2012)\n\nIron Fist discovers the shocking connection between himself and the cosmic Phoenix Force . . . \n\nSecret Avengers #26 (CBR 4/25/2012)\n\nThor leads a secret team of Avengers on a suicide mission to stop the Phoenix by any means necessary! \n\nTwelve #12 (of 12) (CBR 4/25/2012)\n\nThe grand finale is here!! All your questions are answered and nothing can prepare you for what's next! \n\nUncanny X-Men #11 (CBR 4/25/2012)\n\nCyclops leads the X-Men into their toughtest battle yet! Juggernaut-Powered Colossus vs. the Red Hulk! \n","torrent":{"xt":"urn:btih:9c524003095da2612ae53576fcf889d366339bb6","amp;dn":"New+Marvel+I+Like+4-25-2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c524003095da2612ae53576fcf889d366339bb6","infoHashBuffer":{"type":"Buffer","data":[156,82,64,3,9,93,162,97,42,229,53,118,252,248,137,211,102,51,155,182]},"announce":[],"urlList":[]}}