{"title":"FSX Aerosoft PBY Catalina X Revolutionary","uid":5583390,"size":503160340,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9cd2602181a96cca070f9a3089042eccf347162c&amp;dn=FSX+Aerosoft+PBY+Catalina+X+Revolutionary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Muckypup9","files":1,"time":1274620320,"description":"Well, it is a very rare bird guys , and seems pretty good share on my mind :)  This bird is not too easy handling but one of the most detailed flying boat what I have ever seen. So, to nose snivelins and to drop your's teeth, let's try it, fly it and enjoy it. :)\n\n\n\n\nThe PBY Catalina is without a doubt one of the most famous flying boats ever build. After its first flight in 1935 it quickly transformed into the PBY-5A amphibian model that is best known. Despite its strange shape that is rather organic it became a true work horse of many air forces and navies and kept patrolling the oceans for decades.\n\nIt had many roles, search and rescue, any shipping or anti submarine patrols or long range reconnaissance. To this day the Catalina is well known to millions and a guest of honor at many air shows.\n\nFeatures:\n\nModels, sound and flight behavior\n\n    * 11 different models based on the PBY-5, PBY 5A and PBY-6A\n    * Different flight behavior for all different models that are checked with all available data and by current Catalina pilots. Now this is said a lot for FS add-on aircraft, but one Catalina operator is actually using this product for simple training in the winter when most Catalina's are hangar queens.\n    * Impressive and powerful sound set, you actually will be able to tune the engines using your ears.\n    * Aerosoft Sound Module that adds sound to switches, controls and events. From hydraulic pumps to the sound of the engines problems, this creates a far more immersive environment.\n    * Two different cockpits, one typical for the 1940s and 1950s and one as many Catalina's are flown today (with modern radio and GPS equipment).\n    * Cowl flaps, floats and landing gear has better simulation of influence on drag by use of additional coding\n    * More realistic water operation by use of additional coding.\n    * Manual (400+ pages) in two parts, includes full actual operational manual of one of the few PBY-5A's flying at this moment.\n\nGauges and instruments\n\n    * All instruments done in full 3d.\n    * Highly realistic Bendix King radio stack (feel free to download the real manuals and use those!)\n    * Highly realistic and complex Bendix King KLN-90B GPS receiver\n    * Realistic simulation of the Sperry A-3A (Jack &amp; Heinz) Autopilot for the vintage model.\n    * The newly developed Interactive Checklist helps you to prevent problems by showing the correct settings with red or green checkmarks. It even includes sound effects and allows you to configure the aircraft for take-off or for a complete dead and cold setup.\n\nAdded realism (non standard FSX simulations)\n\n    * Non standard and far more realistic calculations of engine temperatures, taking cowflap position, ambient air temperature, fuel/air mixtures setting, airspeed and engine heat generation into account.\n    * Accurate electrical load and hydraulic pressures calculations.\n    * Realistic cold engine startup, requiring use of engine primers and fuel boosters.\n    * Realistic auto mixture that controls auto rich and auto lean.\n    * Realistic carburettor icing that takes moisture and carburettor air temperature into account.\n    * Structural icing that will accumulate ice on the structure, adding weight until the aircraft becomes unflyable.\n    * Non standard engine failure module that includes sparkplug fouling, damage caused by excessive cylinder head or oil temperature, shock cooling and more.\n    * Power reduction due to excessive carburettor air temperature.\n\n\n\n\n\nThis bird is the Version.100, complete with the update pack to V.110\n\nFor those, whom never seen before Aerosoft crack. :)\n\nIf you have trouble about install: \n\n1. go to C:Documents and SettingsUsernameLocal SettingsTemp\n2. start the installer\n3. select a language\n4. go back to the 'Temp' folder. two new directories will have been created. \n5. look for the the ascrypt.dll in one of them.\n6. copy the 'ascrypt.dll' from the torrent's folder to that folder you just opened, overwriting the original file.\n7. now proceed with the installer and leave all the registration fields open.\n8. You needed to do this procedure again when you install the update file.\n\n","torrent":{"xt":"urn:btih:9cd2602181a96cca070f9a3089042eccf347162c","amp;dn":"FSX+Aerosoft+PBY+Catalina+X+Revolutionary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cd2602181a96cca070f9a3089042eccf347162c","infoHashBuffer":{"type":"Buffer","data":[156,210,96,33,129,169,108,202,7,15,154,48,137,4,46,204,243,71,22,44]},"announce":[],"urlList":[]}}