{"title":"Mose Allison - Gimcracks and Gewgaws (1998) [Jazz][mp3 320][scho","uid":6750751,"size":120532130,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9cf91340dc5396bc07843df2878e12d79fc87a94&amp;dn=Mose+Allison+-+Gimcracks+and+Gewgaws+%281998%29+%5BJazz%5D%5Bmp3+320%5D%5Bscho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":26,"time":1318865920,"description":"Mose Allison - Gimcracks and Gewgaws \n\nOriginal Release Date: January 27, 1998 \nAudio CD: October 6, 2009 \nLabel: Blue Note \nQuality: CBR 320 kbps\n\nThe older Mose Allison gets, the sharper his mind becomes, the more idiosyncratic his music sounds, and the more pleasure the aficionado gets for spending the better part of an hour with his latest stuff. By this time, the 70-year old philosopher from Tippo, Miss. had sharpened his wit and insight on life to an even keener edge, musing wryly on materialism, technology, aging, death, even his own name (&quot;MJA, Jr.&quot;). The tunes seem to have disappeared almost entirely but it doesn't matter; the lyrics are so damned clever and as hilarious as ever, even when they are obviously sequels to previous masterworks like &quot;Your Mind Is On Vacation&quot; (&quot;What's With You&quot;) or &quot;Young Man's Blues&quot; (&quot;Old Man Blues&quot;). Mose's piano style by now has been pared down to its unique essentials, a ceaseless, swinging linear flow drawing from the three Bs -- Bach, Bartok and bop -- and his voice has barely aged since his Prestige days. Mark Shim muses ably on tenor sax now and then, and guitarist Russell Malone ranges all over the stylistic lot between R&amp;B and jazz. At this rate, waiting four years or so between albums in the '90s, Allison has kept his creative batteries fresh every time out. ~ Richard S. Ginell. AllMusic\n\nHis nasal, staccato vocals and way obtuse lyricshaving now influenced several generations of jazz, blues, and rock groups, Mose Allison is back with &quot;Gimcracks And Gewgaws&quot;(both words describe a showy trinket of little value) another marvelous, quirky set of songs. With a well chosen group consisting of Ratzo Harris on bass,Mark Shim on tenor sax,guitarist Russell Malone and stalwart drummer Paul Motian, Allison has one of his finest sets yet. The icebreaker &quot;MJA Jr. is a demented little ditty about his name. It's followed by the title cut with thumping bass, powerful sax lines and off the wall cluster chords on the piano. He gets more serious with the otherworldly ballad &quot;Numbers On Paper&quot; with it's bleak outlook on bureaucracy. Then we shift gears into the jumpin' &quot;Cruise Control&quot;. A lot of the material is bluesy like &quot;Saint Louis Blues&quot; (not the old standard) which has Russell Malone doing his best B.B. King imitation. &quot;What Will It Be&quot;, my favorite here, is a hillarious take on what winds up killing you in the end, has Malone in more of a Kenny Burrell mode. Allison's voice and piano technique have never sounded better. Mark Shim's sax playing brings to mind Gerry Mulligan and the rhythm section is always right on the mark. The word play is clever and you'll find yourself chuckling more than once.The recording has the immediacy and warmth of an after hours jazz joint, sleepy, almost hypnotic. Other highlights include &quot;Fires Of Spring&quot;, and &quot;What's With You&quot;. Though much of the imagery seems to concern death, the overall effect is fairly upbeat and tongue-in-cheek. His classic &quot;Young Man Blues&quot;(covered by, among others, the Who) has recieved, perhaps, it's definative treatment as the retitled &quot;Old Man Blues&quot;and wraps up the collection. This guy amazes me. He sounds exactly like he did forty years ago, only the sound is much better. ~ Meathook Williams &quot;stepfather of the blues&quot;\n\nPersonnel\nMose Allison (Piano and Vocals)\nPaul Motian (Drums)\nRatzo Harris (Double Bass)\nMark Shim (Tenor Saxophone)\nRussell Malone (Guitar)\n\nMose Allison - Gimcracks and Gewgaws Tracklist\n01  MJA Jr. 3:33\n02  Gimcracks And Gewgaws 5:14\n03  Numbers On Paper 2:35\n04  Cruise Control 3:00\n05  St. Louis Blues (W.C. Handy) 4:05\n06  Mockingbird 3:04\n07  The More You Get 2:54\n08  Texanna 2:30\n09  What Will It Be 3:11\n10  So Tired (Mose Allison/Shapiro Bernstein/Russ Morgan) 4:04\n11  Somebody Gonna Have To Move 1:57\n12  Fires Of Spring 3:31\n13  What's With You 3:33\n14  Old Man Blues 1:33 ","torrent":{"xt":"urn:btih:9cf91340dc5396bc07843df2878e12d79fc87a94","amp;dn":"Mose+Allison+-+Gimcracks+and+Gewgaws+%281998%29+%5BJazz%5D%5Bmp3+320%5D%5Bscho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cf91340dc5396bc07843df2878e12d79fc87a94","infoHashBuffer":{"type":"Buffer","data":[156,249,19,64,220,83,150,188,7,132,61,242,135,142,18,215,159,200,122,148]},"announce":[],"urlList":[]}}