{"title":"New Troubadours - Love Is - With Bonus Tracks","uid":3831076,"size":76891888,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9d59192b2ee5ab276f97bf70670ad259e3c0f269&amp;dn=New+Troubadours+-+Love+Is+-+With+Bonus+Tracks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SAI_Archives","files":24,"time":1191620072,"description":"&quot;Love Is&quot;, by  &quot;The New Troubadours&quot;\n\nThe first 19 songs in this MP3 collection are the original &quot;Love Is&quot; album which was written and recorded at The Findhorn community by &quot;The New Troubadours&quot; in the early 1970&amp;#039;s.  The recordings were never commercially published in the usual record contract sense, but were offered through The Findhorn Foundation&amp;#039;s bookstore on audio cassette for a number of years before finally disappearing from their catalog.\n\nThe 3 additional tracks from a later compilation of Findhorn artist recordings entitled &quot;The Magic Garden&quot; are also included.\n\nThis MP3 collection is presented as a preservation gesture and should be considered as &quot;shareware&quot;.\n\nIf you find this music as spiritually uplifting as I have over the past 32 years, you may wish to contact the Findhorn Foundation directly at the website below.  Findhorn is now a thriving community and instructional center in Scotland, offering a unique mix of self awareness, spiritual, and harmony workshops, as well as books, crafts and music.\n &lt;a href=&quot;\nHttp://www.findhorn.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nHttp://www.findhorn.org&lt;/a&gt;\n\n------------------------------------------------  \n\nEncoding Notes:\nWave files were created from the original analog recordings or Dolby stereo cassettes. \nNormalization was applied, as well a equalization to compensate for high frequency losses.\nVariable bit MP3 encoding was done for maximum quality with minimum file size.\n\nBugs:\nSome residual noise and distortion is present from the original analog recordings.\nVariable bit MP3 files can sometimes report incorrect track times on early model-version players.","torrent":{"xt":"urn:btih:9d59192b2ee5ab276f97bf70670ad259e3c0f269","amp;dn":"New+Troubadours+-+Love+Is+-+With+Bonus+Tracks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d59192b2ee5ab276f97bf70670ad259e3c0f269","infoHashBuffer":{"type":"Buffer","data":[157,89,25,43,46,229,171,39,111,151,191,112,103,10,210,89,227,192,242,105]},"announce":[],"urlList":[]}}