{"title":"A clockwork Orange (1971) 720p Xvid HD (moviesbyrizzo) subs","uid":6978595,"size":2326467763,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:9d95250eb7a40f1f9ca27df00c3971b0f34ca0f8&amp;dn=A+clockwork+Orange+%281971%29+720p+Xvid+HD+%28moviesbyrizzo%29+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1327326247,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0066921/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0066921/&lt;/a&gt;\n\nNote: Mature content - view with care\n\n1280 X 720 2000k video bitrate XviD HD 256k audio\n\nStanley Kubricks masterpiece &quot;A clockwork Orange&quot; is brought to you here in a\nreasonable and nice quality 2GB offering.\n\nThere are two main schools of thought in what is prevailing wisdom within the\ncircles of the Psychiatric profession. The &quot;cognitive humanistic approach&quot;\nbelieves in the use of rational methods to bring about an engagement in the\nmind so as to see a better perspective prevail in the minds of those involved. \nIt requires of course correct engagement on those aspects of reason and emotion\nso as to bring true wisdom to bear. Cognitive engagement with issues of\npunishments and rewards that flow normally in what choices are made in human\naffairs would be &quot;par for the course&quot; as it were, and required too certainly.\nThat goes without saying I suppose. In this model, punishments would have to be\nseen as only sane, however - in what a reasonable such person would fathom as\nsuch and completely so I suggest.\n\nOn the other hand, behaviorism is a belief in the use of only punishments\nmainly that reason is engaged - and the absence of punishment is considered\na reward  obviously - in addition to other incentive use of tokens perhaps, \nas a belief in control through such a regime is all that is the basis for the\nemployment of such tactics. The difference between this approach and\nthe (previously mentioned) modern school of &quot;cognitive humanistic therapies&quot;\nis mainly in regards to the view as to whether man is a rational being a being\nwith a conscience potentially engaged therefore, or simply more animalistic \nsort of a being which is therefore controlled by external restraints mainly -\nand based invariably on what are &quot;survival instincts&quot; alone. In the\ncase of the latter, some advocate that only the most severe forms of \npunishments can be used for human management as it were as they regard men as\nactually devoid of conscience in the absence of oppressive controls.\nMany practice behaviorism strategies without regard to rational engagement\nin a bid to make man simply responsive to control and without regard\nto having valid ends for this idea of control - including as to whether\na still sane man is to be the end result of surviving such treatment.\nAs a result, this approach has long been discredited by modern schools\nof alternative thought in the mental health profession and Western society\nin general.\n\nIn this movie, we get a look at &quot;aversion therapy&quot;, aimed to reduce\nthe pleasure from sadistic acts that a freak mind might otherwise \nengage in. We see depicted, what is brutal Rape and other sadistic acts\nsuch as senseless murder in what is a display of freak like enjoyment of\nsuch crimes. &quot;Perhaps this therapy could work&quot; we are told only I\nthink in abstract theoretical terms to generate discussion.\n\nIn actual fact, it is my own view that &quot;capital punishment&quot; (the death penalty)\nis the only alternative that is truly sane and practical as no being that abstains\nfrom sadistic criminality based only on fear of punishment is a being that is\nworth sustaining in our midst. To want to commit the crime is evil enough and that\nthreat is more than those innocent members of society should have to endure. \n\nYou cannot control through artificial means as a freak outcome\nis all you will persist in sustaining at a cost to our sanity which\nis too high to bear.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\nsrt Subtitles included for - please check the net for others too\nArabic\nBosnian\nBrazilian Portuguese\nBulgarian\nCzech\nDanish\nDutch\nEnglish\nEstonian\nFarsi\nFinnish\nFrench\nGerman\nGreek\nHebrew\nItalian\nLithuanian\nNorwegian\nPolish\nPortuguese\nRomanian\nSlovenian\nSpanish\nSwedish\nTurkish\n","torrent":{"xt":"urn:btih:9d95250eb7a40f1f9ca27df00c3971b0f34ca0f8","amp;dn":"A+clockwork+Orange+%281971%29+720p+Xvid+HD+%28moviesbyrizzo%29+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d95250eb7a40f1f9ca27df00c3971b0f34ca0f8","infoHashBuffer":{"type":"Buffer","data":[157,149,37,14,183,164,15,31,156,162,125,240,12,57,113,176,243,76,160,248]},"announce":[],"urlList":[]}}