{"title":"God's Outlaw: William Tyndale (Christian Movie)","uid":4909091,"size":732760053,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9de43c9ae729494e637b6a3110ade5ee52724373&amp;dn=God%5C%27s+Outlaw%3A+William+Tyndale+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IndianChristian","files":3,"time":1243059637,"description":"God's Outlaw: The story Of William Tyndale (Christian Movie)\n\nDocudrama about William Tyndale who was hunted like a criminal by the sixteenth-century Catholic church for attempting to translate the Bible into English for all to read.\n\nWilliam Tyndale is one of those heros who we hear too little about. His influence reaches into so many areas and across so many ages of time. His translation of the Holy Bible into English not only affected those who profess Christ, but the everyday language of the common man. His example of courage in the face of unspeakable cruelty and tyranny is an inspiration to all who love liberty, and especially those of us who love the Lord Jesus Christ and His Word of Life. This movie so far surpasses anything that Hollywood has to offer. This is real drama at its best, not just because it is true, but because what William Tyndale did still matters today. His work lives on in the hearts of those who cherish God's Word in the Authorized Version, a translation that has no equal. We owe much to William Tyndale, and we owe it to ourselves and our children's children to see this film again and again, and to share it with others. With the recent 2004 release of a documentary on William Tyndale by Avalon Press.net, this film, God's Outlaw, should enjoy a renewed interest. After watching the documentary, many will want to return to God's Outlaw and the book he loved, the Holy Bible.\n\nThis recently played on Canada's CTS and I was glad to have the opportunity to see this rare piece of historical drama. I wonder how many other networks would play a movie about the trials and tribulations of the translator of the English Bible. This is a captivating story for those with an interest in the Bible, history and period films. If they made collectable superhero cards for translators, William Tyndale would be on one of them.\n\nGenre: Docudrama/Biography\nSize: 698 MB\nRuntime: 93 min\nLanguage: English (No-Subtitles)\nYear: 1986\nMy Rating: 9.5/10\nQuality: 9.0/10 \n\nIf financially possible, please buy this CD/DVD to keep Christian films in business. If Christians won't buy Christian films then who will?\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God's word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\n&quot;Don't ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\t\t\n","torrent":{"xt":"urn:btih:9de43c9ae729494e637b6a3110ade5ee52724373","amp;dn":"God%5C%27s+Outlaw%3A+William+Tyndale+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9de43c9ae729494e637b6a3110ade5ee52724373","infoHashBuffer":{"type":"Buffer","data":[157,228,60,154,231,41,73,78,99,123,106,49,16,173,229,238,82,114,67,115]},"announce":[],"urlList":[]}}