{"title":"David Meir-Levi - History Upside Down (mobi, epub)","uid":6955294,"size":2988913,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e2f61d20ad1dd2141b8397e36aac3fdd4104ae3&amp;dn=David+Meir-Levi+-+History+Upside+Down+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1326556066,"description":"History Upside Down: The Roots of Palestinian Fascism and the Myth of Israeli Aggression\n\nIn the United Nations, on university campuses, and among a growing number of our most prestigious Western newspapers, the historical record has been rewritten so thoroughly that Israel is seen as the worst of the oppressive Western occupiers of the Third World. So successful has this propaganda campaign been that Palestinian spinmeisters and their apologists have effectively declared the Israelis, a people living in the shadow of the Holocaust, to be &quot;Nazis.&quot;\n\nHow could this happen? How did unacceptable anti-Semitism morph into justifiable anti-Zionism, and odious Jew-hatred turn into a politically correct Israel-hatred?\n\nIn History Upside Down, David Meir-Levi exposes the ideological DNA of Palestinian nationalism and its ludicrous &quot;alternative&quot; histories, revealing how Nazi fascism gave the Arab world's amorphous hatred of the Jews an intellectual structure and how Soviet communism masked its genocidal intentions with the mantle of national liberation. Meir-Levi then explodes the cornerstone myths that the Palestinian movement created--myths that rationalize and celebrate decades of unremitting terror and genocidal ambitions, turning the history of the Middle East upside down and inside out, making the victim the aggressor and the aggressor the victim. History Upside Down is the first wave in a counterattack against this Arab war on history. It rejects the idea that the basic situation in the Middle East has changed since the United Nations first established the Jewish state and the Palestinian state that would have stood alongside it. Sadly, argues Meir-Levi, the issue in the Middle East is today what it has been since the Muslim invasion in the seventh century: the Arabs' hatred of the Jews.\n\nAuthor: David Meir-Levi\nPublisher: Encounter Books; First Edition edition\nPublication Date: December 20, 2007\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:9e2f61d20ad1dd2141b8397e36aac3fdd4104ae3","amp;dn":"David+Meir-Levi+-+History+Upside+Down+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e2f61d20ad1dd2141b8397e36aac3fdd4104ae3","infoHashBuffer":{"type":"Buffer","data":[158,47,97,210,10,209,221,33,65,184,57,126,54,170,195,253,212,16,74,227]},"announce":[],"urlList":[]}}