{"title":"Lightless - C.A. Higgins (Audio Book)","uid":15459614,"size":333180073,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9e7f07d744b059b90eb2ee68a68033b67ad026b8&amp;dn=Lightless+-+C.A.+Higgins+%28Audio+Book%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BlueNZ","files":11,"time":1470029896,"description":"C. A. Higgins - Lightless\r\nNarrated by: Fiona Hardingham \r\nSize: 317Mb\r\nLength: 11:33:07\r\n\r\nWith deeply moving human drama, nail-biting suspense - and bold speculation informed by a degree in physics - C. A. Higgins spins a riveting science fiction debut guaranteed to catapult listeners beyond their expectations.\r\n\r\nServing aboard the Ananke, an experimental military spacecraft launched by the ruthless organization that rules Earth and its solar system, computer scientist Althea has established an intense emotional bond - not with any of her crewmates but with the ship's electronic systems, which speak more deeply to her analytical mind than human feelings do. But when a pair of fugitive terrorists gain access to the Ananke, Althea must draw upon her heart and soul for the strength to defend her beloved ship.\r\n\r\nWhile one of the saboteurs remains at large somewhere onboard, his captured partner - the enigmatic Ivan - may prove to be more dangerous. The perversely fascinating criminal whose silver tongue is his most effective weapon has long evaded the authorities' most relentless surveillance - and kept the truth about his methods and motives well hidden.\r\n\r\nAs the ship's systems begin to malfunction and the claustrophobic atmosphere is increasingly poisoned by distrust and suspicion, it falls to Althea to penetrate the prisoner's layers of intrigue and deception before all is lost. But when the true nature of Ivan's mission is exposed, it will change Althea forever - if it doesn't kill her first","torrent":{"xt":"urn:btih:9e7f07d744b059b90eb2ee68a68033b67ad026b8","amp;dn":"Lightless+-+C.A.+Higgins+%28Audio+Book%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e7f07d744b059b90eb2ee68a68033b67ad026b8","infoHashBuffer":{"type":"Buffer","data":[158,127,7,215,68,176,89,185,14,178,238,104,166,128,51,182,122,208,38,184]},"announce":[],"urlList":[]}}