{"title":"Various - Haiti Direct","uid":9727523,"size":895795232,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9eaa7b53763f9d292beef4ec544f712e3fc86544&amp;dn=Various+-+Haiti+Direct&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"akasyliphone","files":33,"time":1394318856,"description":"Compiled by Sofrito Hugo Mendez, Haiti Direct is an amazing collection from Haiti's illustrious but sadly unsung musical history. While the island is still synonymous to too many with violence, poverty and voudou stereotypes, the island has a vibrant and innovative musical scene evolving from Compas Direct (meaning direct beat and itself a slower variant of Dominican merengue that came to prominence in the mid-1950s), which bred offshoots like the horn-driven Cadence Rampa, Mini-Jazz, which trimmed down the traditional big-band sound with rock instrumentation and psychedelic touches. The rural twoubadou style, meanwhile, is rooted in the Son and Guaracha brought from migrant Cuban workers. It's a lot of music, and the lengthy and informative liner notes put it in the proper cultural and political context. Then again, this is from Sofrito, so any of these 27 tracks (and not a bad one among them) will fill a dance floor. Nemours Jean-Baptiste's &quot;Ti Carol&quot; is a perfect example of Compas Direct from the undisputed king of the genre with a delightfully swaying vibe, while Les Vikings' &quot;Choc Vikings&quot; and Les Loups Noirs &quot;Pile ou Face&quot; are intoxicating groovers that pave the way for 1980s Zouk. ","torrent":{"xt":"urn:btih:9eaa7b53763f9d292beef4ec544f712e3fc86544","amp;dn":"Various+-+Haiti+Direct","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eaa7b53763f9d292beef4ec544f712e3fc86544","infoHashBuffer":{"type":"Buffer","data":[158,170,123,83,118,63,157,41,43,238,244,236,84,79,113,46,63,200,101,68]},"announce":[],"urlList":[]}}