{"title":"Sleepwalker's Journey ^^NO DRM^^","uid":8628765,"size":150987661,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9f3147e0be454f78c0936ba8b7439c241dcc267e&amp;dn=Sleepwalker%27s+Journey+%5E%5ENO+DRM%5E%5E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Daruca","files":-1,"time":1372582230,"description":"Overview:\nWith a dash of Endless Running and more than a hefty dose of environmental based puzzles, Sleepwalker's Journey is a delightful game, indeed. Directing sleepwalking Moonboy as he attempts to find his way out of his dreams and into his bed is both charming and compelling.\n\nLike any good sleepwalker, Moonboy can't stop walking. Instead, the player must keep him safe by manipulating areas around him. Each level offers up a wide array of obstacles, each manipulated with the swipe or touch of a finger. Early stages might simply involve swiping a ramp up or down but later levels require the manipulation of cannons and tightropes in order to succeed. Fortunately, manipulating such things proves quick and simple to do. Platforms are particularly prominent and it's easy to swipe them up or down in order to propel Moonboy around. Obstacles do start to grow steadily in number, however.\n\nThere's the added impetus of collecting up stars and crescent moons, also, adding to the player's chances of gaining full marks for completing a level. Pillows prove particularly useful here, given their ability to bounce Moonboy in the opposite direction that he was walking in. After a time, completing a stage is easy enough but there's quite a challenge to 100% the level.\n\nJust Install and play!\n\nSeed and Enjoy!\t","torrent":{"xt":"urn:btih:9f3147e0be454f78c0936ba8b7439c241dcc267e","amp;dn":"Sleepwalker%27s+Journey+%5E%5ENO+DRM%5E%5E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f3147e0be454f78c0936ba8b7439c241dcc267e","infoHashBuffer":{"type":"Buffer","data":[159,49,71,224,190,69,79,120,192,147,107,168,183,67,156,36,29,204,38,126]},"announce":[],"urlList":[]}}