{"title":"VA-True_Blood_Music_From_The_HBO_Original_Series_Vol_1-OST-CD-FL","uid":8337958,"size":318815355,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9f656d8786b1683dcfd4bb9ed20a276f773bea07&amp;dn=VA-True_Blood_Music_From_The_HBO_Original_Series_Vol_1-OST-CD-FL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"InfinityM","files":18,"time":1365021664,"description":"FORSAKEN Proudly Presents\n\nArtist: VA\nAlbum: True Blood: Music from the HBO Original Series\nLabel: Elektra\nGenre: Soundtrack\nSource: CD\nStreet Date: 2009-05-19\nQuality: 886 kbps / 44.1kHz / 2 channels\nEncoder: FLAC 1.2.1\nSize: 318.16 MB\nTime: 47:27 min\nUrl: http://www.hbo.com/true-blood\n1. Jace Everett - Bad Things 2:43\n2. CC Adcock &amp; The Lafayette Marquis - Bleed 2 Feed 4:52\n3. Lucinda Williams - Lake Charles 5:27\n4. Lee Dorsey - Give It Up 3:00\n5. Th' Legendary Shack Shakers - Swampblood 3:11\n6. Cobra Verde - Play With Fire 2:36\n7. The Watson Twins - Just Like Heaven 4:15\n8. The Flying Burrito Brothers - Christine's Tune (A.K.A. Devil 3:00\nIn Disguise)\n9. Ryan Adams - Two 2:37\n10. Slim Harpo - Strange Love 2:08\n11. Allen Toussaint - From A Whisper To A Scream 3:29\n12. Dr. John - I Don't Wanna Know 3:24\n13. John Doe feat. Kathleen Edwards - The Golden State 2:59\n14. Little Big Town - Bones 3:46\n\nTrue Blood's sexy, swampy, and sometimes campy Louisiana\natmosphere plays nearly as big a part in the show as Sookie\nStackhouse and her vampire lover, Bill Compton. Fans of the HBO\nTV series know that music played a huge part in creating that\natmosphere -- so much so that all of the episodes of its first\nseason were named after songs that appeared in them. And while\ndirector/producer Alan Ball's previous HBO series, Six Feet\nUnder, also had an expertly crafted soundtrack that often blended\nindie and alternative rock with classic vocal pop, True Blood's\nmusic runs deeper and wider, often spanning artists like\nJapanther and the Cowboy Junkies in a single episode and still\nsounding cohesive. And though the show is steeped in vampire and\nother kinds of supernatural lore, this collection of songs\ncouldn't be further from stereotypically dark, gothy music: the\nclosest it comes (and it's a stretch) is either the Watson Twins'\nMazzy Star-like cover of the Cure's &quot;Just Like Heaven&quot; or the\nSouthern Gothic of Little Big Town's &quot;Bones,&quot; which, with its\nbackwoods menace and beautiful harmonies, is a kissin' cousin of\nFleetwood Mac's &quot;The Chain.&quot; True Blood moves seamlessly from\nclassic swamp blues and soul to contemporary country to\nalt-country and rock, and though decades separate some of these\nsongs, common threads run through them. There's a real twang to\nmost of these tracks, most brashly on Jace Everett's &quot;Bad\nThings,&quot; which wraps temptation and longing in roadhouse swagger\nthat makes it one of the most memorable TV theme songs of the\nlate 2000s, especially paired with the show's vividly gritty\ntitle sequence. It's also no surprise that many tracks are about\nLouisiana or by artists from there, including Lucinda Williams'\nsoftly Cajun-tinged &quot;Lake Charles,&quot; Allen Toussaint's &quot;From a\nWhisper to a Scream,&quot; and Dr. John's brooding &quot;I Don't Wanna\nKnow.&quot; True Blood mixes moods as easily as it does musical\nstyles: C.C. Adcock's &quot;Bleed 2 Feed&quot; and Th' Legendary Shack\nShakers' &quot;Swampblood&quot; embody late-night hedonism with snaky\nblues-rock and wild-eyed psychobilly; the Flying Burrito\nBrothers' &quot;Christine's Tune&quot; nods to the magical reality lurking\naround the show's edges with cosmic country-rock; and Lee\nDorsey's &quot;Give It Up&quot; is just plain funky and sexy. True Blood's\nsongs capture the feel of the show rather than focusing just on\ntracks that scored the series' key moments, and this approach\nfeels more cohesive and listenable (although it has to be said\nthat Slim Harpo's &quot;Strange Love,&quot; which soundtracks the first\nconversation Bill and Sookie have, is a standout). True Blood\ngeeks will nitpick about some omissions, like Lynyrd Skynyrd's\n&quot;That Smell&quot; or Joan Baez's &quot;Plaisir d'Amour,&quot; but the soundtrack\nis so of the show and so enjoyable that it feels like spending\nsome quality time with the jukebox at Merlotte's Bar and Grill\n","torrent":{"xt":"urn:btih:9f656d8786b1683dcfd4bb9ed20a276f773bea07","amp;dn":"VA-True_Blood_Music_From_The_HBO_Original_Series_Vol_1-OST-CD-FL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f656d8786b1683dcfd4bb9ed20a276f773bea07","infoHashBuffer":{"type":"Buffer","data":[159,101,109,135,134,177,104,61,207,212,187,158,210,10,39,111,119,59,234,7]},"announce":[],"urlList":[]}}