{"title":"Coast to Coast AM June 29, 2013 - Secret UFO Documents","uid":8648739,"size":57087425,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9fcbece005b4e3da360c80c90417f649f8befe3d&amp;dn=Coast+to+Coast+AM+June+29%2C+2013+-+Secret+UFO+Documents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1373050330,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-29-13\nHost:\nJohn B. Wells\nGuests:\nNick  Pope\nFormer UK Ministry of Defense (MoD) employee Nick Pope joined John B. Wells to discuss the UK's recent unloading of classified UFO documents and what this means for UFO disclosure. The British government's 2007 policy decision to transfer once secret UFO records to the UK's national archive was due mostly to public pressure and an extraordinarily high number of Freedom of Information Act requests, Pope explained, noting how the French had set a precedent by releasing their classified UFO reports. At this point, all of the MoD's UFO files have been released though some material has been blacked out, he added. While acknowledging that fraudulent UFO claims exist and are embraced by skeptics keen on dismissing the topic, Pope pointed out that &quot;most of the people involved in this, both as witnesses, as researchers, are people of huge integrity.&quot; The merits of Ufology should be judged on the good data, he said. \nAt the heart of (continued) government secrecy about UFOs is interest in weaponization, propulsion systems, energy sources and aerodynamics, Pope continued. According to the secret UFO study Project Condign, not only was the British government concerned about technology acquisitions but they were also aware of the Soviet's interest in the UFO issue, he revealed. Pope said he sees no direct evidence to support the claim that any particular country's technological advancements were based on back-engineered alien craft.  \nHe expressed skepticism for extraterrestrial involvement in the creation of crop circles, suggesting that most, if not all, are made by people. Interestingly, many crop circle makers report strange activity while they build their formations, such as seeing strange balls of light and feeling like they are under a compulsion. Pope also covered the Bentwaters/Rendlesham Forest incident and Milton Torres' 1957 UFO encounter (scroll page). \nWebsite(s):\n nickpope.net\nBook(s):\n Open Skies, Closed Minds\n The Uninvited: An Expose of the Alien Abduction Phenomenon\n","torrent":{"xt":"urn:btih:9fcbece005b4e3da360c80c90417f649f8befe3d","amp;dn":"Coast+to+Coast+AM+June+29%2C+2013+-+Secret+UFO+Documents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fcbece005b4e3da360c80c90417f649f8befe3d","infoHashBuffer":{"type":"Buffer","data":[159,203,236,224,5,180,227,218,54,12,128,201,4,23,246,73,248,190,254,61]},"announce":[],"urlList":[]}}