{"title":"Sam Harris__The View From The End Of The World","uid":4479773,"size":56533046,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a03d5c4f2d40a17523254fd93d5f592114b7b429&amp;dn=Sam+Harris__The+View+From+The+End+Of+The+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1225511132,"description":"December 9th, 02005 - Sam Harris\n&quot;The View From The End Of The World&quot;\nThis is an audio only presentation.\n\nThis talk took place in the Conference Center Golden Gate Room, San Francisco.\n\nQuote:\n\nWith gentle demeanor and tight argument, Sam Harris carried an overflow audience into the core of one of the crucial issues of our time: What makes some religions lethal? How do they employ aggressive irrationality to justify threatening and controlling non-believers as well as believers? What should be our response?\n\nHarris began with Christianity. In the US, Christians use irrational arguments about a soul in the 150 cells of a 3-day old human embryo to block stem cell research that might alleviate the suffering of millions. In Africa, Catholic doctrine uses tortured logic to actively discourage the use of condoms in countries ravaged by AIDS.\n\n&quot;This is genocidal stupidity,&quot; Harris said. Faith trumps rational argument. Common-sense ethical intuition is blinded by religious metaphysics.\n\nIn the US, 22% of the population are CERTAIN that Jesus is coming back in the next 50 years, and another 22% think that it&amp;#039;s likely.\n\nThe good news of Christ&amp;#039;s return, though, can only occur following desperately bad news. Mushroom clouds would be welcomed. &quot;End time thinking,&quot; Harris said, &quot;is fundamentally hostile to creating a sustainable future.&quot;\n\nHarris was particularly critical of religious moderates who give cover to the fundamentalists by not challenging them. The moderates say that all is justified because religion gives people meaning in their life. &quot;But what would they say to a guy who believes there&amp;#039;s a diamond the size of a refrigerator buried in his backyard? The guy digs out there every Sunday with his family, cherishing the meaning\nthe quest gives them.&quot;\n\n&quot;I&amp;#039;ve read the books,&quot; Harris said. &quot;God is not a moderate.&quot; The Bible gives strict instructions to kill various kinds of sinners, and their relatives, and on occasion their entire towns. Yet slavery is challenged nowhere in the New or Old Testaments; slave holders in the old south used the Bible to defend their practice. The religious texts have power because they are old, but they are also hopelessly out of date because they are old.\n\nIt&amp;#039;s taboo among religious moderates to compare religions, said Harris, but we must. &quot;Where are the Tibetan Buddhist suicide bombers? For that matter, where are the Palestinian Christian suicide bombers--- they&amp;#039;re as Arab and aggrieved as anyone.&quot; The fundamental beliefs of Islam really are a problem. &quot;Martyrdom in jihad is not a fringe doctrine; it is believed by millions of Muslims.&quot; It&amp;#039;s not a question of ignorance--- two-thirds of al Qaeda operatives are\ncollege educated.\n\n&quot;We have no reason to expect to survive our religious differences indefinitely. Faith is intrinsically divisive. We have a choice between conversation and war.&quot; It was conversation that ended slavery, not faith. &quot;Faith is a declaration of immunity to conversation. To make religious war unthinkable, we have to undermine the dogma of faith. The continuance of civilization requires not moderation, but reason.&quot;\n\nHarris ended by lauding meditation and mysticism as a form of experiential science, and observed, &quot;The wisdom of contemplative life is not evenly distributed. The East has more than the West.&quot; \n\n\n\nPlease leave a comment if you want, this is just to show what is out there...\n\nAnd before you go and spam, dl it watch it and make up your own mind...\n\ncheers the_phyrexian\n\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n        &lt;a href=&quot;\nhttp://petitions.number10.gov.uk/shariastop/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://petitions.number10.gov.uk/shariastop/&lt;/a&gt;\t\n\n\nthere is a reseed section, read it / use it...\n   &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\t","torrent":{"xt":"urn:btih:a03d5c4f2d40a17523254fd93d5f592114b7b429","amp;dn":"Sam+Harris__The+View+From+The+End+Of+The+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a03d5c4f2d40a17523254fd93d5f592114b7b429","infoHashBuffer":{"type":"Buffer","data":[160,61,92,79,45,64,161,117,35,37,79,217,61,95,89,33,20,183,180,41]},"announce":[],"urlList":[]}}