{"title":"Monkey Island 2 soundtrack [high quality FLAC]","uid":4173086,"size":526213768,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a23552a6f07adad8da95c45df394397cd7e9acb2&amp;dn=Monkey+Island+2+soundtrack+%5Bhigh+quality+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LogicDeLuxe","files":75,"time":1209977375,"description":"Recorded from a genuine Roland MT-32 and genuine Roland Sound Canvas SC-155.\nMastered by LogicDeLuxe at www.abmischung.de\n\nThis one is a bit different to my other soundtracks as this is a slightly remixed version with Sound Canvas drum set used. The reason I did this for is because the MT-32 has the drums a bit weak imho, lacking the dynamics it could use. This seems to be a frequent problem in MT-32 music, probably because musicians drive the instruments to the limit, thus gaining a good quantization noise ratio, and then being forced to use the most dynamic instruments, the drums, conservatively, as the MT-32 would clip otherwise which would produce very audible overflow crackles. The MT-32 is well known for both, quantization noise and overflows. As the Sound Canvas drum samples are very similar to the MT-32 you won&amp;#039;t notice much of a difference, except for a more dynamic performance.\nAll the melodic instruments are truthfully kept, except for Jojo playing the Piano, which is also Sound Canvas.\nI recorded all tracks from the DOS executable since ScummVM seems to have the reverb set wrong in some places. The DOS version suffers from slowing down the music flow slightly during room changes, which I corrected digitally during the mastering.\nIn addition to this, I added &quot;Governor Phatt&amp;#039;s Room Remix&quot; and &quot;Underground Tunnels Orchestral Remix&quot; (192 kbps version) from HighLand Productions, as those perfectly capture the original scenes, imho. Both mp3 files are gain reduced by 1.5 dB with MP3Gain (which is a lossless process) in order to match the loudness of the other tracks.","torrent":{"xt":"urn:btih:a23552a6f07adad8da95c45df394397cd7e9acb2","amp;dn":"Monkey+Island+2+soundtrack+%5Bhigh+quality+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a23552a6f07adad8da95c45df394397cd7e9acb2","infoHashBuffer":{"type":"Buffer","data":[162,53,82,166,240,122,218,216,218,149,196,93,243,148,57,124,215,233,172,178]},"announce":[],"urlList":[]}}