{"title":"Lord of the Rings: Complete Trilogy - DVDRip","uid":8461350,"size":4786043349,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a285a9aeb303957971688b280c4f611c78e8d366&amp;dn=Lord+of+the+Rings%3A+Complete+Trilogy+-+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lokii_187","files":-1,"time":1368239075,"description":"Lord of the Rings: Complete Trilogy - DVDRip\n \n 1.) The Fellowship of the Ring (2001)\n 2.) The Two Towers (2002)\n 3.) The Return of the King (2003)\n\nHere is a complete Lord of the Rings trilogy set in one file, including all 3 of the epic J.R.R Tolkien stories adapted to the big screen by Peter Jackson. Follow the journey of Frodo Baggins the hobbit and Gandalf the wizard, along with many others as they battle across Middle-Earth. Has always been one of my absolute favorite book sets, hopefully you enjoy the movies enough to read them if you have not already.\n----------------------------------------------------------------------------------\n\n1.) The Lord of the Rings: The Fellowship of the Ring (2001)\n\nAn ancient Ring thought lost for centuries has been found, and through a strange twist in fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it! However he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir and his three Hobbit friends Merry, Pippin and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign!\n---------------------------------------------------------------------------------\n\n2.) The Lord of the Rings: The Two Towers (2002)\n\nWhile Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard. Sauron's forces increase. His allies grow. The Ringwraiths return in an even more frightening form. Saruman's army of Uruk Hai is ready to launch an assault against Aragorn and the people of Rohan. Yet, the Fellowship is broken and Boromir is dead. For the little hope that is left, Frodo and Sam march on into Mordor, unprotected. A number of new allies join with Aragorn, Gimli, Legolas, Pippin and Merry. And they must defend Rohan and attack Isengard. Yet, while all this is going on, Sauron's troops mass toward the City of Gondor, for the War of the Ring is about to begin.\n---------------------------------------------------------------------------------\n\n3.) The Lord of the Rings: The Return of the King (2003)\n\nThe Fellowship divides to conquer as Frodo and Sam, with the help and hindrance of Gollum, continue their way to Mount Doom. Gandalf and Pippin ride to Minas Tirith to help defend Gondor while Merry remains with Eowyn and the other Rohan fighters. Aragorn, Legolas, and Gimli seek aid from those that live in the Cursed Mountains. All these battles have one goal in mind: distract the Eye of Sauron and buy Frodo a little more time to destroy the ring.\n---------------------------------------------------------------------------------\n\nHopefully you enjoy it, as I have the countless terabytes I have acquired through PirateBay over the years. Remember everybody, this site and others like it are a full circle, and only work with cooperation between all parties involved. So please for every 1GB of material downloaded try to at minimum give back (upload) 0.5GB back, because without someone seeding that latest episode of your favorite show last week, you wouldn't have it either. \n\n               *******LET US ALL GET SEEDY TO HELP THE NEEDY*******\n\nA Lokii_187 [MaSSaCRiSiS] Production","torrent":{"xt":"urn:btih:a285a9aeb303957971688b280c4f611c78e8d366","amp;dn":"Lord+of+the+Rings%3A+Complete+Trilogy+-+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a285a9aeb303957971688b280c4f611c78e8d366","infoHashBuffer":{"type":"Buffer","data":[162,133,169,174,179,3,149,121,113,104,139,40,12,79,97,28,120,232,211,102]},"announce":[],"urlList":[]}}