{"title":"Carmen McRae - 1983 - For Lady Day FLAC","uid":8848415,"size":636282318,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a298f6377d7d833201c00e66188119d13746f7b8&amp;dn=Carmen+McRae+-+1983+-+For+Lady+Day+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1377459896,"description":"Carmen McRae - 1983 - For Lady Day\nActually, these are two albums, whatever...\n\nCarmen McRae always considered Billie Holiday to be the most important influence not only on her singing but on her life. Six years before she recorded her monumental tributes to Thelonious Monk and Sarah Vaughan, McRae performed a Billie Holiday set at New York's Blue Note Club that was broadcast over the radio; on the first of two volumes, McRae, who talks movingly about Lady Day at the beginning of the set and accompanies herself on piano on &quot;I'm Pulling Through,&quot; is heard in prime form, combining the power and range of her earlier years with the emotional depth and behind-the-beat phrasing of her last period. Accompanied by her rhythm section of the time (pianist Marshall Otwell, bassist John Leftwich, and drummer Donald Bailey) and occasionally the tenor of Zoot Sims, McRae really digs into the material, interpreting the songs in her own style but with a knowing nod toward Holiday. This wonderful set is far superior to most of the Billie Holiday tribute albums and reminds one how much Carmen McRae is missed.\nThe second volume of Carmen McRae's heartfelt tribute to Billie Holiday, like the first, comes from a broadcast taped by WBGO-FM at the Blue Note in New York City on New Year's Eve, 1983. McRae takes a few minutes to explain the evolution of her tribute and she hardly attempts to sing Holiday's material in the same way, but utilizing her own powerful, emotional approach, often lagging behind the beat. McRae also delves into songs that Holiday performed but are not as readily associated with her, such as &quot;Laughing at Life&quot; and &quot;You Ain't Gonna Bother Me No More.&quot; Her rhythm section, including pianist Marshall Otwell, bassist John Leftwich, and drummer Donald Bailey, provides strong support, with the occasional appearance of tenor saxophonist Zoot Sims (especially on &quot;My Old Flame&quot; and &quot;Mean to Me&quot;) providing an added bonus. Like the first volume, this Novus CD was not released until after McRae's death, while this outstanding set makes jazz fans wonder why record labels don't mine public radio live broadcasts for similar performances more often. (AllMusic)\n\nVoume 1\n01 - Intro.flac\n02 - Miss Brown To You.flac\n03 - Good Morning Heartache.flac\n04 - I'm Gonna Lock My Heart and Throw Away the Key.flac\n05 - Fine and Mellow.flac\n06 - Them There Eyes.flac\n07 - Lover Man.flac\n08 - I Cried for You (Now it's Your Turn to Cry Over Me).flac\n09 - God Bless The Child.flac\n10 - I Hear Music.flac\n11 - I'm Pulling Through.flac\n12 - Don't Explain.flac\n13 - What A Little Moonlight Can Do.flac\nVolume 2\n01 - Intro.flac\n02 - Laughing At Life.flac\n03 - You Ain't Gonna.flac\n04 - Bother Me No More.flac\n05 - Yesterdays.flac\n06 - My Old Flame.flac\n07 - Nice Work If You Can Get It.flac\n08 - Billie's Blues.flac\n09 - Travelin' Light.flac\n10 - Medley- If You Were Mine-It's Like Reaching for The Moon.flac\n11 - I'm Painting The Town Red.flac\n12 - You've Changed.flac\n13 - Mean To Me.flac\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:a298f6377d7d833201c00e66188119d13746f7b8","amp;dn":"Carmen+McRae+-+1983+-+For+Lady+Day+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a298f6377d7d833201c00e66188119d13746f7b8","infoHashBuffer":{"type":"Buffer","data":[162,152,246,55,125,125,131,50,1,192,14,102,24,129,25,209,55,70,247,184]},"announce":[],"urlList":[]}}