{"title":"Donald W. Loveland - Three Views of Logic. Mathematics, Philosop","uid":10249506,"size":11108046,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a320b21c35b840a986f7cc6581536878976c73f6&amp;dn=Donald+W.+Loveland+-+Three+Views+of+Logic.+Mathematics%2C+Philosop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1401330976,"description":"Description\nProduct Details\nBook Title: Three Views of Logic: Mathematics, Philosophy, and Computer Science\t\nBook Author: Donald W. Loveland (Author), Richard E. Hodel (Author), S. G. Sterrett (Author)\nPaperback: 344 pages\nPublisher: Princeton University Press (January 26, 2014)\nLanguage: English\nISBN-10: 0691160449\nISBN-13: 978-0691160443\n\n===================================================================================\nBook Description\nPublication Date: January 26, 2014\nDemonstrating the different roles that logic plays in the disciplines of computer science, mathematics, and philosophy, this concise undergraduate textbook covers select topics from three different areas of logic: proof theory, computability theory, and nonclassical logic. The book balances accessibility, breadth, and rigor, and is designed so that its materials will fit into a single semester. Its distinctive presentation of traditional logic material will enhance readers' capabilities and mathematical maturity.\nThe proof theory portion presents classical propositional logic and first-order logic using a computer-oriented (resolution) formal system. Linear resolution and its connection to the programming language Prolog are also treated. The computability component offers a machine model and mathematical model for computation, proves the equivalence of the two approaches, and includes famous decision problems unsolvable by an algorithm. The section on nonclassical logic discusses the shortcomings of classical logic in its treatment of implication and an alternate approach that improves upon it: Anderson and Belnap's relevance logic. Applications are included in each section. The material on a four-valued semantics for relevance logic is presented in textbook form for the first time.\nAimed at upper-level undergraduates of moderate analytical background, Three Views of Logic will be useful in a variety of classroom settings.\n*** Gives an exceptionally broad view of logic\n*** Treats traditional logic in a modern format\n*** Presents relevance logic with applications\n*** Provides an ideal text for a variety of one-semester upper-level undergraduate courses.\n\n===================================================================================\nFrom the Back Cover\n&quot;Formal logic should no longer be taught as a course within a single subject area, but should be taught from an interdisciplinary perspective. Three Views of Logic has many fine features and combines materials not found together elsewhere. We have needed an accessible textbook like this one for quite some time.&quot;--Hans Halvorson, Princeton University\n\n&quot;This concise, precise, and clear textbook is unique in the range of material covered and the level at which it is written, which is intended for undergraduates. The exercises are a considerable help to the student and the examples are useful and interesting.&quot;--David Plaisted, University of North Carolina, Chapel Hill\n\n&quot;Loveland, Hodel, and Sterrett are all internationally recognized and leading researchers in their field. Their new textbook gives an excellent introduction to the resolution of propositional and first-order predicate logic, and an outstanding overview of computability theory. The examples and exercises are well chosen, and the material is accessible to students without a logic background.&quot;--Frank Wolter, University of Liverpool\n\n===================================================================================\nAbout the Author\nDonald W. Loveland is professor emeritus of computer science at Duke University and the author of &quot;Automated Theorem Proving: A Logical Basis&quot;. Richard E. Hodel is associate professor emeritus of mathematics at Duke University and the author of &quot;An Introduction to Mathematical Logic&quot;. S. G. Sterrett is the Curtis D. Gridley Distinguished Professor of History and Philosophy of Science at Wichita State University and the author of &quot;Wittgenstein Flies a Kite: A Story of Models of Wings and Models of the World&quot;.\n===================================================================================","torrent":{"xt":"urn:btih:a320b21c35b840a986f7cc6581536878976c73f6","amp;dn":"Donald+W.+Loveland+-+Three+Views+of+Logic.+Mathematics%2C+Philosop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a320b21c35b840a986f7cc6581536878976c73f6","infoHashBuffer":{"type":"Buffer","data":[163,32,178,28,53,184,64,169,134,247,204,101,129,83,104,120,151,108,115,246]},"announce":[],"urlList":[]}}