{"title":"Two Worlds NTSC XBOX360-CCCLX","uid":10990116,"size":7572884220,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:a323d60ccdb7b1a73267fab9e37594330a090573&amp;dn=Two+Worlds+NTSC+XBOX360-CCCLX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zerodayz","files":-1,"time":1409991631,"description":"Title: Two Worlds\nDate: 8/24/07\nSystem: Xbox360\nRegion: NTSC/U Only\nFilename: ccclx-tworld.rar\n#Disks: 100 x\n\n*prepatched w/ included security files*\n\nTwo Worlds combines the extremely dynamic and sophisticated combat system with\nthe meaning and freedom of exploration exceeding the accomplishments of other\ngames of the genre. A top quality Role Playing experience - the ultimate goal\nof the Two Worlds project is to deliver a superior Role Playing Game to the PC\nand Xbox 360 market where players have a real chance to shape the game world with\ntheir actions - to an extent that has yet to seen in other productions. This premise\nwill be supported with a strong, non-linear storyline, mind blowing graphics, and\nstunning combat sequences. To attract the mass audience, the complexity of the game\nwill be achieved mainly through a variety of meaningful choices while the User\nInterface will be simplified.\n\n- Offering a freedom of choice unseen in other Role Playing Games. The world literally\n  comes to life as it immediately reacts to the player's actions and changes accordingly\n  offering new and exciting challenges.\n\n- Strong, non-linear storyline. Players can shape their own story by choosing the path\n  of conducting the main conflict and resolving meaningful side-quests.\n\n- Spectacular and dynamically choreographed fights. The combat system combines intuitive\n  steering, tactical challenges and movie-like visual experiences.\n\n- Free and unlimited character development. Players can experiment with different careers\n  and even reverse their former choices with the help of &quot;career changers&quot;.\n\n- Animals to be ridden on. Players can travel and fight on various animals from horses to\n  tamed lizards and beasts.\n\n- A choice of traps and snares are at the Player's disposal making the gameplay both rich\n  and flexible.\n\n- Huge variety of items to be found. Randomly generated pieces of equipment, thematic sets\n  and combined items offer the space to experiment and satisfy the need to collect.\n\n- Wide range of beautifully rendered terrains: from high mountains to seashores and deep\n  caves with all of the locations featuring ultra sharp texturing and stunning design.\n\n- Hyper-realistic tree physics and sophisticated weather system make the world come to life\n  as has never been seen before.\n\n- Advanced Artificial Intelligence that manages group behaviour of large virtual communities.\n\n- Up to 8 players in the multiplayer mode.\n\n- Symphonic music to make the experience more emotional and memorable.\n\n- Extensive usage of Pixel Shader 2.0 and 3.0, HDR, multiple materials and unique shadow engine\n  to ensure the best visuals possible.\n\n","torrent":{"xt":"urn:btih:a323d60ccdb7b1a73267fab9e37594330a090573","amp;dn":"Two+Worlds+NTSC+XBOX360-CCCLX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a323d60ccdb7b1a73267fab9e37594330a090573","infoHashBuffer":{"type":"Buffer","data":[163,35,214,12,205,183,177,167,50,103,250,185,227,117,148,51,10,9,5,115]},"announce":[],"urlList":[]}}