{"title":"Catherine Coulter - FBI 14 - Whiplash","uid":6560546,"size":165170280,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a385409c3d18ca9142c4c8c2a2b76e0b968fb4b3&amp;dn=Catherine+Coulter+-+FBI+14+-+Whiplash&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"metheguy","files":13,"time":1311448557,"description":"Coulter, Catherine - FBI 14 - Whiplash\n\n\n\nUnabridged\nNarrated by Paul Costanzo and Renee Raudman\n11 hrs, 27 min\nAudio Release Jun 15, 2010\nBrilliance Audio\n32kb, 22050 hz\n10 parts\n\nYale professor Dr. Edward Kender\\'s father is undergoing chemotherapy when the supply of a critical accompanying drug, Culovort, suddenly runs out. Unwilling to accept the drug manufacturer\\'s disingenuous excuse of production line problems, Dr. Kender hires private investigator Erin Pulaski to prove that something more sinister is going on at Schiffer Hartwin.\nMeanwhile, in Maryland, married FBI agents Lacey Sherlock and Dillon Savich are investigating a rather unusual case: Senator David Hoffman is experiencing a ghostly apparition with possible malicious intent. The case is baffling, and Sherlock and Savich are not sure what to believe, even after witnessing the disturbing specter for themselves. They\\'re no closer to cracking the case when a call comes in from Connecticut: A top foreign Schiffer Hartwin employee has been found murdered behind the drug company\\'s U.S. headquarters.\nUnbeknownst to the FBI, Erin Pulaski had uncovered a bombshell in her investigation: The Culovort shortage is set to bring in a windfall profit in excess of two billion dollars. Upon learning of the murder, Erin is certain it has something to do with her findings, but she risks exposing herself by coming forward. As the feds move in, the case becomes even more complicated for Erin, since the murder of a foreign national on federal land can mean only that the pharmaceutical house has a secret of epic proportions -- one it would do anything to keep hidden.\n\n","torrent":{"xt":"urn:btih:a385409c3d18ca9142c4c8c2a2b76e0b968fb4b3","amp;dn":"Catherine+Coulter+-+FBI+14+-+Whiplash","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a385409c3d18ca9142c4c8c2a2b76e0b968fb4b3","infoHashBuffer":{"type":"Buffer","data":[163,133,64,156,61,24,202,145,66,196,200,194,162,183,110,11,150,143,180,179]},"announce":[],"urlList":[]}}