{"title":"Queen - Crazy Little Thing Called Love  (2nafish)","uid":5403677,"size":149028868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a4210ffe5ec1f355e9c49dd6047cb73c59b8b037&amp;dn=Queen+-+Crazy+Little+Thing+Called+Love++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1267519708,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Crazy Little Thing Called Love&quot; is a song performed by the English rock band Queen, written by singer Freddie Mercury. While it peaked at number two in the UK, it hit number one on the U.S. charts on February 23, 1980, remaining there for four consecutive weeks. It topped the charts in Australia for six weeks.\n\nAs reported by Mercury in Melody Maker, May 2, 1981, Mercury composed &quot;Crazy Little Thing Called Love&quot; on the guitar in just five to ten minutes. Other accounts say that he wrote it while lounging in a bubble bath in the Bayerischer Hof Hotel in Munich during one of Queen's extensive Munich recording sessions. He took it to the studio shortly after writing it and presented it to bandmates Roger Taylor and John Deacon. The three of them, with their new producer Mack, recorded it at Musicland Studios in Munich. The entire song was reportedly recorded in less than half an hour (although Mack says it was six hours).\n\nThe &quot;Crazy Little Thing Called Love&quot; single hit number two in the UK and became the first U.S. number-one hit for the band.\n\nThe Game is the eighth studio album by British rock band Queen released 30 June 1980. It was the only Queen album to reach the #1 position in both the United Kingdom and the United States and became Queen's best selling studio album in the US with four million copies sold to date, tying News of the World's US sales tally. Notable songs on the album include the bass-driven &quot;Another One Bites the Dust&quot; and the rockabilly &quot;Crazy Little Thing Called Love&quot;, both of which reached number 1 in the United States. The Game was the first Queen album to use a synthesizer (an Oberheim OB-X). The album's working title was &quot;Play the Game&quot;, but Taylor voiced concern about its possible overtones of conformity, so it was changed to simply &quot;The Game&quot;.\n\nThe album features a more pop/rock sound than its predecessor, Jazz. The album's style would be augmented on Queen's next release Hot Space, and future Queen albums. At approximately 35 minutes, The Game is the shortest of Queen's studio albums.\n\nRe-issued in May 2003 on DVD-Audio with Dolby 5.1 surround sound and DTS 5.1. The 5.1 mix of &quot;Coming Soon&quot; features an alternate backing track, because the final master tapes were not found when mixing the album to 5.1.\n\nThe photo on the cover of the EMI CD is different from that originally used on the LP and cassette even though the Hollywood CD still has the original photo. The original photo (with Taylor having folded arms and May not having a hand resting upon his exposed hip) is shown in the article. This alternate photo was also used on cover of the DTS DVD-Audio edition of the album released in 2003.\n\n&quot;Crazy Little Thing Called Love&quot;, &quot;Sail Away Sweet Sister (To The Sister I Never Had)&quot;, &quot;Coming Soon&quot;, and &quot;Save Me&quot; were recorded from June to July 1979. The rest of the songs were recorded between February and May 1980.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a4210ffe5ec1f355e9c49dd6047cb73c59b8b037","amp;dn":"Queen+-+Crazy+Little+Thing+Called+Love++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4210ffe5ec1f355e9c49dd6047cb73c59b8b037","infoHashBuffer":{"type":"Buffer","data":[164,33,15,254,94,193,243,85,233,196,157,214,4,124,183,60,89,184,176,55]},"announce":[],"urlList":[]}}