{"title":"Nirvana - Roots of Nirvana - CD Rip - (Flac) - Mojo Magazine","uid":7044638,"size":418912941,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4f05051fae18b314e902df7cad1de8c9964a056&amp;dn=Nirvana+-+Roots+of+Nirvana+-+CD+Rip+-+%28Flac%29+-+Mojo+Magazine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":17,"time":1329699232,"description":"Nirvana - Roots of Nirvana - CD Rip - (Flac) - Mojo Magazine   \n\n\n\n   01 Mudhoney - In N Out Of Grace (Remastered)\n                                                \n   02 Clown Alley - On The Way Up\n                                                                 \n   03 Beat Happening - Bewitched\n                                                                 \n   04 Shonen Knife - Twist Barbie\n                                                                 \n   05 Big Black - Bad Penny\n                                                                       \n   06 Fang - The Money Will Roll Right In\n                                                         \n   07 Big Dipper - You Are Not Patsy\n                                                               \n   08 The Vaselines - Jesus Wants Me For A Sunbeam\n                                                \n   09 Young Marble Giants - Colossal Youth\n                                                        \n   10 Meat Puppets - Plateau\n                                                                      \n   11 Scratch Acid - Cannibal\n                                                                     \n   12 Green River - Aint Nothing To Do\n                                                           \n   13 Melvins - Night Goat (AmRep single version)\n                                                \n   14 Flipper - Sex Bomb\n                                                                          \n   15 Iggy Pop And The Stooges - Gimme Danger\n\n\n\nUploader Note:\n\nThe Vaselines - Jesus Wants Me For A Sunbeam (Covered by Nirvana for their MTV Unplugged In New York concert)        \n\n\nCD Liner Notes:\n\n...The Vaselines, The Breeders, Scratch Acid, The Pixies, The Sex Pistols, Raincoats, Melvins, Tales Of Terror, The Stooges, Butthole Surfers, Young Marble Giants....\n\n...the list goes on. It is one of many that populates Kurt Cobains Journals, published posthumously in 2002, which detail the bands that the author was listening to and which provide an insight into the music that shaped Nirvanas sound.  \nThen again, spend any amount of time with any member of Nirvana and the conversation soon turned to music in animated terms. While the band themselves struggled with the dehumanising influence that came with global superstardom, as  \nindividuals they never lost their passion for music itself. That said, there were moments of guilt-tripping brought on by an adhesion to an almost impractical punk rock code, the rules of which were often reductive and which Kurt himself realised were there to be broken.\n\nKurt Cobain Quote:\n\nPunk is musical freedom. Its saying, doing and playing what you want. In Websters terms, NIRVANA means freedom from pain, suffering and the external world, and thats pretty close to my definition of punk rock\n\n\nThat definition of punk and musical freedom is embodied on this 15-track collection that is designed to reflect just a few of Nirvanas influences. In truth, to do them justice we would need a box set. Watch out! Here comes another list...\n\n\nLiner Notes by: Phil Alexander (Editor-in-Chief, MOJO Magazine, London, England. December 2010)\n\n\nFormat: Flac\nSize: 400MB\n\nUploader Notes:\n\nI have replaced the Meat Puppets track with a Flac version taken off their CD release. This was done because the version on this Mojo release had a faulty ending due to incorrect gap editing.\n\nI have included a 320 MP3 of the Fang track. The version on this Mojo release has a faulty end and I have not been able to find a correct Flac version to replace.\n\nI have included a 320 MP3 of the Big Black track. The version on this Mojo release has a faulty end and I have not been able to find a correct Flac version to replace.\n\nI have added the standard two second silence to the beginning of each track and a one second silence at the end. This release is specifically designed for right click folder playback with VLC.  \n\n\n\nTo play Flac files - type into Google: videolan vlc player \n\nDownload VLC media player, install and thats it.\n\nWindows Media Player does not support Flac at the moment though there are free codecs that will allow you to play Flac files in WMP.\n\nBoth WMP and VLC player can be installed on the same computer without any problems therefore allowing complete freedom of choice. \n\nFlac is a lossless format and gives you CD quality playback.\n","torrent":{"xt":"urn:btih:a4f05051fae18b314e902df7cad1de8c9964a056","amp;dn":"Nirvana+-+Roots+of+Nirvana+-+CD+Rip+-+%28Flac%29+-+Mojo+Magazine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4f05051fae18b314e902df7cad1de8c9964a056","infoHashBuffer":{"type":"Buffer","data":[164,240,80,81,250,225,139,49,78,144,45,247,202,209,222,140,153,100,160,86]},"announce":[],"urlList":[]}}