{"title":"Landmarks of the Persian Renaissance - Monumental Funerary Archi","uid":9297695,"size":67431836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4f12e8e254742cb288d4af1e0792f7bf85ee7d9&amp;dn=Landmarks+of+the+Persian+Renaissance+-+Monumental+Funerary+Archi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1386183879,"description":"Michailidis, Melanie, &quot;Landmarks of the Persian Renaissance : Monumental Funerary Architecture in Iran &amp; Central Asia (10th &amp; 11th centuries)&quot;\nMassachusetts Institute of Technology, Dept. of Architecture | ISBN: N/A | 2007 | PDF | 412 pages | 65 mb\n\nThis study investigates the sudden proliferation of mausolea in Iran and Central Asia in the tenth and eleventh centuries and how their patrons, secular rulers of Iranian descent, drew on the pre-Islamic past in new ways specific to each region. Mausolea constructed in the tenth and eleventh centuries have a wide geographical spread across modem Iran and the ex-Soviet Central Asian republics. However, the monuments take two different forms: the tomb tower and the domed square. There are formal and functional differences and a different geographical distribution, with the earliest tomb towers concentrated in the inaccessible Alborz Mountains in northern Iran. This remote region had a very different historical trajectory from that of Central Asia, where the earliest extant domed square mausolea are located. Historians of architecture have often noted that certain features seen in these mausolea have some vague connection with the pre-Islamic past, but this connection has never been precisely defined or explained; I argue that the cultural dynamics which resulted in particular architectural forms were very different in these two regions: pre-Islamic Iranian traditions were selectively continued in the Caspian region of northern Iran, whereas other elements of the Iranian past were consciously revived in Central Asia. Two of the mausolea that I analyze, the Samanid mausoleum and the Gunbad-i Qabus, are well-known monuments which appear in virtually every survey of Islamic art, whereas most of the others are almost completely unknown.","torrent":{"xt":"urn:btih:a4f12e8e254742cb288d4af1e0792f7bf85ee7d9","amp;dn":"Landmarks+of+the+Persian+Renaissance+-+Monumental+Funerary+Archi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4f12e8e254742cb288d4af1e0792f7bf85ee7d9","infoHashBuffer":{"type":"Buffer","data":[164,241,46,142,37,71,66,203,40,141,74,241,224,121,47,123,248,94,231,217]},"announce":[],"urlList":[]}}