{"title":"Michael Norris - Carolina Shag Dancing - Together Steps DVD","uid":6423837,"size":3691909338,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a58d140713b0310b30124eb305eb867ba1a1f702&amp;dn=Michael+Norris+-+Carolina+Shag+Dancing+-+Together+Steps+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"scottvenzel","files":2,"time":1306392517,"description":"Michael Norris and LeAnn Best, have been dance partners in the Carolina Shag for 10 years, winning for the first time in the Junior I Division of the National Shag Dance Championships in 1994. Michael and LeAnn took 2nd place in their first year in the Junior II Division in 1995, then swept the division for the next 5 consecutive years, taking 1st place from 1996 through 2000. In 1996, they won the Best Overall Award at the National Shag Dance Championships, the first ever for a Junior Division couple. They repeated as Best Overall Champions in 1997, 1999, 2000 and 2002\n\nMoving into the Pro Shag Division in 2001, they placed second behind multi-time champions Sam West &amp; Jackie McGee . In 2001, they took 1st place in the Shag Division at the U.S. Open Swing Dance Championships in Anaheim. In 2002, they won both the Pro and Best Overall Divisions at the National Shag Dance Championships.\n\nMichael and LeAnn have been members of the National Shag Dance Team for many years, sharing in 1st place wins in the Team Division in 2000 at the US Open Swing Dance Championships and 4 times (most recently in 2002) at the US Grand Nationals Dance Championships in Atlanta. In 2001, Michael was named co-captain (with Jennifer Beaver) of the National Shag Team.\n\nMichael and LeAnn are also accomplished professional 'Swing' dancers, winning the Open Classic Swing Division at the US Open Swing Dance Championships in 1999.\n","torrent":{"xt":"urn:btih:a58d140713b0310b30124eb305eb867ba1a1f702","amp;dn":"Michael+Norris+-+Carolina+Shag+Dancing+-+Together+Steps+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a58d140713b0310b30124eb305eb867ba1a1f702","infoHashBuffer":{"type":"Buffer","data":[165,141,20,7,19,176,49,11,48,18,78,179,5,235,134,123,161,161,247,2]},"announce":[],"urlList":[]}}