{"title":"[GirlsWay]  - The Business of Women Part Six - Showdown - 400p","uid":12189214,"size":289325494,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a598a95ffc3b5d975d92d7653b6d604a0b89f04d&amp;dn=%5BGirlsWay%5D++-+The+Business+of+Women+Part+Six+-+Showdown+-+400p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pornboy89","files":1,"time":1438621530,"description":"[GirlsWay] - Shyla Jennings, Vanessa Veracruz, Samantha Rone &amp; India Summer - The Business of Women Part Six - Showdown - 400p [.mp4]\n\n.......:::Screenshots:::.......\n &lt;a href=&quot;\nhttp://imgnemo.com/?v=995434&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?v=995434&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnemo.com/?g=616981&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?g=616981&lt;/a&gt;\n\nDescription:\n\nIndia has instructed her menial stepdaughter to take Samantha back to Ms. Veracruz, and act like she has what she wants. Samantha is equipped with a safe word so that it's clear when to make their move. While the unsuspecting Vanessa parades her wealth around in the form of India's best girls, she makes the mistake of taking them back to India's mansion.\n\nVanessa flaunts her jewels in front of India taunting her, and laying the facts out for her. Vanessa has her own daughter, her last girl, her business, and seemingly the upper hand. India sits in silence, tantalized while savoring the mockery Vanessa is making of herself. Vanessa orders her girls to put on a show for 'Mommy.' While Samantha and Shyla play their roles, India's knowing smirk proves she is getting tired of Vanessa's embarrassing tirade. Vanessa continues to bark all the orders, but India loses her patience when Villain Vanessa gets a bit too high on her horse.\n\nMs. Summer stands, face to face with Ms. Veracruz and challenges her to exert her control. When Ms. Summer speaks, the cards turn, and Samantha and Shyla take the side of the hand that feeds. India instantly assumes control. Vanessa's words mean nothing any longer, and her subsequent break down leaves her dragged through India's mud, begging to come back to the home she's always been destined for. \n\nIf you don't care for the story, expect a hot lesbian orgy with the four women. Plenty of f2f cunnilingus and fingering. Enjoy!","torrent":{"xt":"urn:btih:a598a95ffc3b5d975d92d7653b6d604a0b89f04d","amp;dn":"%5BGirlsWay%5D++-+The+Business+of+Women+Part+Six+-+Showdown+-+400p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a598a95ffc3b5d975d92d7653b6d604a0b89f04d","infoHashBuffer":{"type":"Buffer","data":[165,152,169,95,252,59,93,151,93,146,215,101,59,109,96,74,11,137,240,77]},"announce":[],"urlList":[]}}