{"title":"TVAC Boeing 717-200 The Last Legacy V2 - FS2004.zip","uid":4160033,"size":45486339,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a5d5f0f0b055b90531cffce70a6d620e18669250&amp;dn=TVAC+Boeing+717-200+The+Last+Legacy+V2+-+FS2004.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aitor9000","files":1,"time":1209328227,"description":"The Vans Aircraft Company: The \\&quot;Boeing 717-200 The Last Legacy\\&quot;\n \n\nThis model is a replica from the real one. Each and every detail are reproduced on this model without afecting frames per second and are based on flight and maintenance manuals from the aircraft. \n\n\nThis model characteristics are: \n\n\nAIRCRAFT \n\nState of the art replica of the aircraft \nNose section has been redesigned adding the vortilons on 3D \nWing Root Section has been redesigned giving better shape to this section \nFuselaje with double bouble style \nComplete 3D Fan Blades \nWing/ Nacelle lights \nVelocity wheels with steering compressing nose wheel \nForward Stairs with realistic full motion animation \nForward Exit/Service redesigned with full interior animation and Lights effects \nDynamic Shine on fuselage, engines, vertical and horizontal stab \nThe horizontal Stabilizer has been redesigned adding a countless number of details \nAnimated horizontal Stabilizer (Stabs move up and Down according to trim) \nPerfectly simulated loss of hydraulic pressure on the horizontal stabilizer \nDiferential Ailerons (Hi and Low Speed each one independent) \none touch Reverses (The Clam Shell reverser now arm fully with just a touch of the reverser \\&quot;F2\\&quot; ) \nFully operational animated Landing Lights (Extends with the action of landing lights CTRL+L) \nHighly detailed gear and actuators \nRealistic animation of brakes and roll spoilers \nDetailed every part of the flap, hinges and actuators \nSuspension adjusts height to load \nHighly detailed External power receptacle and Ground crew compartment. \nImprovement of Parking Mode (now adds Catering Trucks, baggage belts truck, Baggage train and fuel truck) \nHighly Detailed and animated Catering Truck \nHighly Detailed and animated baggage belts truck \nHighly Detailed and animated Baggage train \nHighly Detailed and animated fuel truck \nGround Power unit has been perfectly modelled and it works and comunicate with the 2D Panel \nAnimated Flight Deck Door \nHighly detailed and animated Captain window. \nMaintenance Mode has been added (includes Meteo Radar, main and nose landing gear by doors \nPerfect modelled Wheather Radar \nHigh detailed Pitots, static intakes and stall probe. \nMulti stage flap animation -BOEING Style flight manual with more than 120 pages. \nTaxi, flood lights, Nav, strobe and beacons \nFlight Dynamics tested by real airline pilots and totally realiable on flight manuals and Speed booklets \nHi Definition Textures 32Bits \n\n \nVIRTUAL COCKPIT \n\nAll the functions on the virtual cockpit are fully functional and animated, you can perform a complete flight from within the VC. \nOver 80 switches clickable and animated \nThrust, flap, spoiler animated -Perfectly modelled and animated captain window and it\\&amp;#039;s mechanisms \nRain glass effect \nDisplay Control System \nMaster caution System \nAnimated Rudder pedals, Ailerons and Elevator Yokes \nAnimated Sterring Wheel with PUSH for parking brakes \nEvery switch, handle or Knob modelled in 3D \nFully operational FMC \nCabin lightning \nFully operational autopilot \nFully operational Displays knobs and switches \nAnimated Flight deck doors \nHighly detailed and animated Stairs \nAnimated Service and main exits \nSpectacular night lighting \nFlood panel lights FX \nHighly detailed reflecting-transparent windows \nClickable Sunshine screens\n\n\nSOUNDS \n\nFull sound package recorded in engine run test out and inside of the aicraft. \nMulti channel Stereo. \n\n\nPANEL \n\nRedesigned fully operational FMC \nPerfeclty simulated PFD \nNavigation display with ROSE, ARC, MAP and TERRAIN modes. \nMultifunction Display (EICAS, Eicas2, Configuration, Electrical, Fuel, Hydraulic, Stauts and Miscellaneous Display all can be choosen by controls in the pedestal. \nPanel Flood lights. \nFully operational Pedestal with throttles, MFD control panel, COM1 and COM2, XPNDR, Take off condition, TRIM, Fuel cut-off and Flaps, Spoilers, Fuel x Feed, handles \nFully operational Overhead Panel \nMODES PANEL (Here can be activated all modes in the aircraft GPU, Ground service Cars, Maintenance Mode, Captain window, Cockpit Door, Main Door, Forward Stairs and cargo Doors) \nMFD Control Panel And extra control panel can be activated on the main panel. \nZOOM PANEL All the Display can be Zoomed with this comand. \nTwo kind of models has been included for those who prefer flying inside of Virtual Cockpit and for those who prefer without VC. \n\nThis package includes all the liveries of the operators of the B717 such as:\n\nAirTran \nMidwest \nQantas Link \nImpulse \nBangkok Airways \nTrans World \nTurkmenistan \nHawaiian Airlines \nAeBal (Aerolineas Baleares) \nOlympic Airways \nJETSTAR \nVUELAMEX \n\n\nFor more information browse http://www.vansairco.com/ \n\n\nThis package include:\n* Installer.\n* Two updates (vc lights / nose down crash).\n* Operation manual and Checklist.\n\n\nEnjoy!!!\n\n\n \n\n","torrent":{"xt":"urn:btih:a5d5f0f0b055b90531cffce70a6d620e18669250","amp;dn":"TVAC+Boeing+717-200+The+Last+Legacy+V2+-+FS2004.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5d5f0f0b055b90531cffce70a6d620e18669250","infoHashBuffer":{"type":"Buffer","data":[165,213,240,240,176,85,185,5,49,207,252,231,10,109,98,14,24,102,146,80]},"announce":[],"urlList":[]}}