{"title":"Coast to Coast AM March 26 2013","uid":8328229,"size":55863206,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a6a6f84dfb5b9c7f6b6f71f1cbfef042dc5a6969&amp;dn=Coast+to+Coast+AM+March+26+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1364833227,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-26-13\nHost: \tGeorge Noory\nGuests: \tDiane Hennacy Powell, Glynis McCants\n\nPsychiatrist Dr. Diane Hennacy Powell discussed psychic abilities as well as her recent work studying the tremendous gifts of autistic savants. Many people who have psychic abilities develop them after some kind of altering experience, such as a head trauma, NDE, or accident, she reported. Savants often can't do basic things that we take for granted, yet they can exhibit amazing specific abilities far beyond the scope of the average person. &quot;To me that's something that's as remarkable as ESP-- why put it into a different category?,&quot; she pondered. While scientists have tended to be closed minded about PSI abilities, they've been more open to study savants because testing results can be repeated more reliably, she noted.\n\nAutistic savants are able to do what they do because they see the world without the encumbrance of the newer part of the brain (which is usually comprised in them), and are able to access more raw data, she explained. They can have perfect pitch in music, photographic or highly detailed memories, and an ability to detect order in ways we can't pick up. One savant drew a completely accurate periodic table without ever having seen one; another known as The Human Camera, Stephen Wiltshire, has the ability to draw exact replicas of complicated structures and cityscapes after just a single view.\n\nPowell recently coined the acronym UEC (unexplained experiences of consciousness) to use instead of telepathy, ESP and other types of paranormal phenomena-- 'loaded' terms which can cause scientists to turn away. She cited the research of Dean Radin on &quot;presentiment,&quot; which demonstrated that people can have a certain brain response seconds before being shown a disturbing image. She also mentioned the intriguing phenomena of &quot;future memory,&quot; which is as though you've literally visited the future, and then in the present when these events unfold you recognize them, and can sometimes alter their course. Doing things that activate the right brain (the visual/spatial side), such as art and dance, can increase one's receptivity to psychic abilities, she further added.\nPopes, Names, &amp; Numbers\n\nFirst hour guest, numerologist Glynis McCants spoke about Pope Francis' personal numerology versus Pope Benedict's, as well the numerology of names. Both Popes have a '3' lifepath with a '2' attitude, but they are very different as people. Pope Francis has a destiny number of '3' which means he is called to motivate and uplift other people, while Benedict has bunch of '8s' in his chart, which can be associated with poor health, she detailed. You can glean information about a person by looking at the numerological association of the first vowel in their first name, she noted. For example, E is the first vowel in the name George, and is a '5' vibration, signifying a person who likes to stay in constant motion, and needs to know what the real story is. For a complete list of first vowel significances, see this page (scroll down).\n\nNews segment guests: Charles R. Smith, Joshua P. Warren\nWebsite(s):\n\n    dianehennacypowell.com\n    numberslady.com\n\nBook(s):\n\n    The ESP Enigma\n    Glynis Has Your Number\n    Love by the Numbers\n\n","torrent":{"xt":"urn:btih:a6a6f84dfb5b9c7f6b6f71f1cbfef042dc5a6969","amp;dn":"Coast+to+Coast+AM+March+26+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6a6f84dfb5b9c7f6b6f71f1cbfef042dc5a6969","infoHashBuffer":{"type":"Buffer","data":[166,166,248,77,251,91,156,127,107,111,113,241,203,254,240,66,220,90,105,105]},"announce":[],"urlList":[]}}