{"title":"[Doc ITA] Il Muro di Belino (History Channel)","uid":5201699,"size":312891392,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a70d9ff016b9827eedac987676b89a8f5561dbfd&amp;dn=%5BDoc+ITA%5D+Il+Muro+di+Belino+%28History+Channel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"black mamba TNT","files":1,"time":1260201567,"description":"Come diretta conseguenza della seconda guerra mondiale e della guerra fredda, la Germania, nel 1949, fu divisa. Sul piano economico la Germania occidentale visse negli anni 50 un fortissimo boom, erano gli anni del cosiddetto &quot;Wirtschaftswunder&quot; (miracolo economico). Aiutata all'inizio dai soldi americani, la Germania Federale riuscÃƒÂ¬ in breve tempo a diventare nuovamente una nazione rispettata per la sua forza economica.\n\nLa parte orientale faceva molto piÃƒÂ¹ fatica a riprendersi: era svantaggiata all'inizio per le pesanti richieste economiche fatte dall'Unione Sovietica per riparare i danni subiti nella guerra e per la mancanza di aiuti paragonabili a quelli che riceveva la parte occidentale. Inoltre la rigida struttura di pianificazione nazionale dell'economia non favorÃƒÂ¬ lo stesso sviluppo come nella parte occidentale del paese. PiÃƒÂ¹ i due paesi si stabilivano al livello politico, piÃƒÂ¹ si facevano sentire le differenze per quanto riguarda lo standard di vita.\n\nIn quegli anni il confine tra est ed ovest non era ancora insuperabile e per tutti gli anni '50 centinaia di migliaia di persone fuggivano ogni anno dall'est all'ovest, per la maggior parte erano giovani con meno di 30 anni e spesso persone con una buona formazione professionale, laureati, operai specializzati e artigiani, che all'ovest si aspettavano un futuro piÃƒÂ¹ redditizio e piÃƒÂ¹ libero. Questo continuo dissanguamento stava diventando un pericolo serio per la Germania dell'est ed era un'ulteriore causa delle difficoltÃƒÂ  economiche di questo stato.\n\nL'erezione del muro\n\nNelle prime ore del 13 agosto del 1961 le unitÃƒÂ  armate della Germania dell'est interruppero tutti i collegamenti tra Berlino est e ovest e iniziavano a costruire, davanti agli occhi esterrefatti degli abitanti di tutte e due le parti, un muro insuperabile che attraversava tutta la cittÃƒÂ , che divideva le famiglie in due e tagliava la strada tra casa e posto di lavoro, scuola e universitÃƒÂ . Non solo a Berlino ma in tutta la Germania il confine tra est ed ovest diventÃƒÂ² una trappola mortale. I soldati ricevettero l'ordine di sparare su tutti quelli che cercano di attraversare la zona di confine che con gli anni fu attrezzata con dei macchinari sempre piÃƒÂ¹ terrificanti, con mine anti-uomo, filo spinato alimentato con corrente ad alta tensione, e addirittura con degli impianti che sparavano automaticamente su tutto quello che si muoveva nella cosiddetta &quot;striscia della morte&quot;.\n\nBloccato quasi completamente il dissanguamento dello stato, negli anni 60 e 70 la DDR visse anch'essa un boom economico. Tra gli stati dell'est diventÃƒÂ² la nazione economicamente piÃƒÂ¹ forte e i tedeschi cominciarono a rassegnarsi alla divisione. Di riunificazione si parlava sempre meno e solo durante le commemorazioni e le feste nazionali.\n\n\n\n\nLa caduta del muro\n\nQuello che infine, per la grande sorpresa di tutti e nel giro di pochissimo tempo portÃƒÂ² alla riunificazione furono due fattori: l'arrivo di Gorbaciov come leader dell'Unione Sovietica e le crescenti difficoltÃƒÂ  politiche ed economiche dei paesi dell'est e specialmente della DDR. Con la &quot;Perestroika&quot;, cioÃƒÂ¨ la radicale trasformazione della politica e della economia e con la &quot;Glasnost&quot; , che doveva portare alla trasparenza politica, Gorbaciov cominciÃƒÂ² a cambiare strada.\n\n\n\n\nI dirigenti della DDR videro questo processo prima con un certo imbarazzo e poi con crescente resistenza. Nel corso del 1989, i cambiamenti democratici, le piccole rivoluzioni nell'economia e nella politica in Polonia, in Ungheria e nell'Unione Sovietica riempivano ogni giorno i giornali in tutta l'Europa, solo nella DDR il tempo sembrava essersi fermato, ma molta gente adesso era impaziente e cominciÃƒÂ² a protestare e manifestare apertamente.\n\n\n\n\nOgni tentativo di lasciare la DDR in direzione ovest equivaleva ancora a un suicidio, ma nell'estate del '89 la gente della DDR trovÃƒÂ² un'altra via di fuga: erano le ambasciate della Germania Federale a Praga, Varsavia e Budapest il territorio occidentale dove si poteva arrivare molto piÃƒÂ¹ facilmente! CominciÃƒÂ² un assalto in massa a queste tre ambasciate che dovevano ospitare migliaia di persone stanche di vivere nella DDR. Ma il colpo decisivo arrivÃƒÂ² quando l'Ungheria, il 10 settembre, aprÃƒÂ¬ i suoi confini con l'Austria. Ora, la strada dalla Germania dell'est all'ovest (attraverso l'Ungheria e l'Austria) era libera! La valanga di fuga stava diventando inarrestabile.\n\nAnche l'ultimo tentativo da parte del governo della DDR di salvare il salvabile, cioÃƒÂ¨ il cambiamento dei vertici del partito comunista e del governo non servÃƒÂ¬ a nulla. Quando la sera del 9 novembre un portavoce del governo della DDR annunciÃƒÂ² una riforma molto ampia della legge sui viaggi all'estero, la gente di Berlino est lo interpretÃƒÂ² a modo suo: il muro doveva sparire. Migliaia di persone si riunivano all'est davanti al muro, ancora sorvegliato dai soldati, ma migliaia di persone stavano anche aspettando dall'altra parte del muro, all'ovest, con ansia e preoccupazione. Nell'incredibile confusione di quella notte, qualcuno, e ancora oggi non si sa esattamente chi sia stato, dette l'ordine ai soldati di ritirarsi e, tra lacrime ed abbracci, migliaia di persone dall'est e dall'ovest, scavalcando il muro, si incontravano per la prima volta dopo 29 anni.\n\n\n\n\nDati Tecnici:\n\nDimensione: 298Mb\nDurata: 43m44s\n\nVideo Codec: Xvid\nVideo Bitrate: 848 kbps\nRisoluzione: 464 x 352\nFPS (Frames/sec): 25.000\nQF (Frame quality): 0.208\n\nAudio Codec: mp3\nAudio Bitrate: 97 kb/s (2 chnls)\nFreq Audio: 48000 Hz\n\n\nScreenshots:\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/th_bscap0073yf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/th_bscap0073yf.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0120qr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0120qr.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0133ke.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0133ke.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0144pa.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0144pa.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0155wz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0155wz.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a70d9ff016b9827eedac987676b89a8f5561dbfd","amp;dn":"%5BDoc+ITA%5D+Il+Muro+di+Belino+%28History+Channel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a70d9ff016b9827eedac987676b89a8f5561dbfd","infoHashBuffer":{"type":"Buffer","data":[167,13,159,240,22,185,130,126,237,172,152,118,118,184,154,143,85,97,219,253]},"announce":[],"urlList":[]}}