{"title":"NWO, ZioNazi, Matrix, Illuminati, Freemason, Secret Societies Vo","uid":6463014,"size":182729421,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7810a2af2de1d2e4145ea71e7fd58a44bad2f7e&amp;dn=NWO%2C+ZioNazi%2C+Matrix%2C+Illuminati%2C+Freemason%2C+Secret+Societies+Vo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sparx101","files":997,"time":1307853908,"description":"This is the NWO collection volume 2.\nEnglish and Russian books.\n\nIt includes the knock out version of the Protocols of Learned Elders of Zion in two versions, one is the original Victor Mandsen, and modern English version.\n\nSome of the Russian books by Eduard Hodos are the bomb. Even if you do not know Russian, it still worth reading it via some translation service.\n\nEnglish books:\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - -\nVolume 2\n\n    100 main laws of Shulchan Aruch - the foundation of ZioNazism and fascism\n\n    The Secret Rabbinical Teachings Concerning Christians\n\n    Degenerates Rule The World! by Gregory Klimov\n\n    The Protocols of the Learned Elders of Zion in modern English.\n\n    The best audio version is included in\n    ./Books/Audio/Protocols_Modern_English subdirectory. Sounds incredible. The .txt file from which it was converted to audio is available in the same directory.\n\n    The audio TTS (text to audio) conversion was performed using TextAloud reader in batch mode, and NeoSpeech Paul 16 voice - the best of them all. Highly recommended.\n\n    The Protocols of the Learned Elders of Zion, Victor E. Marsden version.\n\n    The best audio version is included in\n    ./Books/Audio/Protocols of Zion - Marsden subdirectory. It also contains the .txt file from which it was converted to audio.\n\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nFirst of all, before we even start looking at some nasty details, listen to this carefully:\n\nWhat you have in your hands with these protocols is something, you better listen for as many times as it takes for you to learn every minute detail of it, every single idea, and every single point.\n\nDo not take sides while listening to it. Just find some place where you are not disturbed, close your eyes, put everything aside, and forget about all you know.\n\nAnd then listen. And if you do not understand something, listen again, and again, and again.\n\nUntil you see every bit of it, and you will, eventually.\n\nBecause what you see here is a masterpiece, nothing less, no matter how you cut it, the master piece the likes of which you have never seen before, the deepest secret, held for ages in the depths of the secret society of global magnitude.\n\nThe more you listen, the more you will be able to see what rules your life? Why are people so vicious against each other? Why do they lick asses and suck dicks? just to survive, just to survive? Why do they behave like animals? submitting to their superiors as though those were the life giving messengers of nothing less than God? Why do they paint their faces, just to follow some stupid fashion of idiocy? Why do they shake their asses, just to be like all others, Why do they make fools of themselves, as though life was nothing more than some grand comedy, or even parody? Why do people do what they do Just to be like all others? For what? And then what?\n\nWhy do politicians lie their dirty mouths off all day long? Why do they sell their balls just to be in power? For what? Why do they prostitute themselves? What do they expect to achieve at the end? Hell? Just like we see all around? What an achievement! You can hardy find something as idiotic as to crave for power, control, prestige and so called authority just for the sake of it, while deep inside, not caring for anything but themselves, just like these protocols state. Such a waste of life and ones own potential it is. What an exercise in futility!\n\nWhy do the say: &quot;I am just making money&quot;, as though they were nothing more than the money making machines? Why do you see all this evil all around?\n\nJust look and see.\n\nWithout judgement, one way or the other. Without condemnation or approval.\n\nJust see.\n\nBecause, that is what will make you free at the end, free of all the zombie programming, done to your mind, morning to night, every single day of your life, since the cradle.\n\nYou will finally see how the world really works, how it is ruled, who is it owned by, and how your mind is controlled, every moment of your life.\n\nAnd that is freedom.\n\nFreedom to know your own limitations, freedom of seeing those blocks, that forever seem to prevent you from living a fulfilling life, because you seem to bump with your head against the unending avalanche of all sorts of difficulties, you seem to be experiencing all your life.\n\nBecause you really do not understand how it all really works.\n\nAnd so you run in circles of frustration, and limitations that only exist in your own mind, that will inevitably result in misery, and unfulfilled life.\n\nNow...\n\nWe are not going to bother with this so called forgery charge, peddled in all the desperate attempts to somehow minimise the significance of these protocols. That is totally unproductive.\n\nWhat does it matter, forgery or not, if it exactly corresponds with reality as you can see it with your own eyes?\n\nDo you think you live in a real world? Or is it nothing more than the world of fiction? What is real? Do you know? Who is real? Which words? Which book? Which knowledge? Which system of belief?\n\nWould you consider something, that was said by someone, who you know to be intelligent?\n\nOr would you dismiss what they have to say on the basis that it is some kind of &quot;forgery&quot;?\n\nThe entire human knowledge and history, and all the acts of creation in art, literature, and even science, is nothing but &quot;forgery&quot;.\n\nBecause it, as of necessity, borrows some things from the past. Otherwise, life would come to a grinding halt, if you had to reinvent the wheel every time.\n\nAnd that is what in essence the protocols are.\n\nAll the desperate attempts to call it some &quot;forgery&quot; are not only idiotic, but futile.\n\nThe Truth can not be stopped. Once the word is spoken, it is like a bird, that flew away from your hands. You won't catch it again.\n\nJust in passing, about this &quot;forgery&quot; charge:\n\nWould you consider Shul-han Arookh or Tanya a forgery?\n\nBecause it is, according to this argument, forever peddled against the protocols. Because these &quot;new&quot; laws are simply reiterations of the old laws, described in Talmud, only adapted to times.\n\nLet us consider just a few major points...\n1. State is Supreme\n\nBasically, the most important thing in these protocols is the State. State therefore is Supreme. Supreme authority, supreme power, supreme significance, supreme wealth, supreme dictatorship.\n\nThe individual, no matter who he is, be it even the king himself is secondary.\n\nThe individual life and all its manifestations is to submit himself totally and unconditionally to the power of the State.\n\nAll his individual desires, interests, concerns and creative impulses are of no significance of any kind.\n\nIf he deviates from the norm, he is to be punished be it utter brutality or even a death sentence.\n\nLife as such has no meaning in this scheme.\n\nThe only meaning there is is the meaning and significance of a super-state.\n\nIf someone comes up with some idea of something new or some criticism of any of it, he is to be reminded of his relative significance in the scheme of things, and if he persists, the punishment is unavoidable, and there exists no limit to its severity.\n2. Why learned elders?\n\nWell, it is one of the most fundamental beliefs of Judaists, that Judaism is the only &quot;religion&quot; of rational. All other religions are irrational, and thus, are nothing more than idol worshipping as they classify it.\n\nThe central belief of Judaists is the supreme value and significance of the mind.\n\nIt is all about the mind.\n\nTherefore, the prime and supreme requirement is learning, and training ones mind with all the power of all those mountains of knowledge of the &quot;elders&quot;.\n\nConceptually, there is no such a thing as heart in their so called religion.\n\nThere is also no concept of intuition, which is a prime driving force behind all creation.\n\nThere is only a so called reason, which is considered to be the supreme guiding factor.\n\nIn that respect, it is interesting to note that it says in their scriptures:\n\nRabbi argues with God, and God eventually concedes.\n\nThis is something beyond comprehension.\n\nBecause a rabbi is considered to be superior even to nothing less than God itself.\n\nThis clearly explains the mind orientation of not only these protocols, but the entire Judaism as a system, a system of thought and argument that is.\n\nIt is completely dry and dead, as we shall see. Because it does not allow anything but the mind, and mind is just one aspect of existence, but there are other aspects, such as love, feeling, intuition, spontaneity, playfulness.\n\nWhere is in this so called religion, religion of hate and arrogance of superiority, which is nothing more than a byproduct of an inferiority complex?\n\nThere is no such a thing as compassion, there is no such a thing as love, there is no such a thing as feeling, there is no such a thing as innocent giggle of a child, playing on the street, utterly unconcerned with all this so called rational stuff.\n\nBecause he has to be brought under total control. He has to submit his innocence to so called reason. He has to totally suppress his spontaneity, and replace it with so called reason, the reason imposed by a dictator, in the form of learned elders of Zion.\n\nYou are not even allowed to think independently, going to the point of obscene. Even to empty your bowels, you need to ask that omni-potent rabbi of what is the right way to do it.\n\nA rabbi was asked: can I piss on the roof of a synagogue?\n\nRabbi thought for a moment, and then said - yes, but not on the roof, but from the roof.\n\nOne man was building a shack, and so he came to a rabbi and asked him, which side of the door should I make my window on?\n\nCan you imagine that kind of idiocy?\n\nAnd that is what Talmud and these so called scriptures are full of, up to their ears. Utter disgust, utter idiocy, utter inconsistency. It is not clear there is a single point they argree upon.\n\nWhat is this? Religion? Or mind washing procedure?\n\nAnd these are the &quot;god's chosen people&quot;, full of all sorts of garbage knowledge, up to their ears? Then where is their intelligence? Why can't to just about anything without asking some rabbi about the &quot;right&quot; way of doing it?\n\nWhy do you have this library size Talmud, where one rabbi argues the other about the same thing, saying things that are diametrically opposite?\n\nNot only that, but there are several versions of Talmud, and since they do not reconcile with each other, they created new scriptures, trying to merge the old scriptures and somehow try to fit it all together, such as Tanya of Chabad Lubavitch sect.\n\nAnd it still does not fit. No matter how you cut it, it does not reconcile. Contradictions everywhere. Irreconcilable contradictions. Contradictions within itself.\n\nAnd they claim that rabbi can even win an argument with God itself?\n\nWell, in that case, all of it is nothing but idiocy of degenerates, totally unable to think independently, and not surprising at all. Just look at these very protocols. What do they tell you but ordering to be a slave and submit to any kind of garbage they feed you?\n\nNo wonder you have the highest number of schizophrenics among Jews. Because, in their very scriptures, they are told to intermarry, and never marry anyone outside their sect, which inevitably produces degenerates. Nature does not tolerate narrowing of a genetic pool. Nature is about diversifying, about creating new features, which has been shown to stimulate genius. It is a well known fact that among geniuses the highest percentage are those, that are a mix of different nationalities.\n\nAnd that is the bottom line of it all.\n3. A limitation of the infinite, forever unfolding intelligence\n\nAs you shall see in these protocols, everything is subdued and brought under total control.\n\nThere is no such a thing as freedom, according to these protocols. All the freedom is subject to the Law. One is free to do only those things, that are allowed by the so called law.\n\nBut - who - has created these laws? God? - all knowing? omni-potent? and omni-scient?\n\nOr some mortal, just like any other, with his own mind, conditioned by others, called &quot;elders&quot;?\n\nThen what is the value of his life?\n\nAre these laws absolute? Do they include any other permutations of the Infinite Intelligence, forever unfolding, and never fitting the old, the known?\n\nWhat is creativity then? Just following the same old footsteps, walking on the same ancient path, doing the same stupid things the others did, boring as it gets?\n\nWhat is a spontaneous expressions of a dance, or a poem, or a paining?\n\nShould it also be checked if it fits some stupid book, written by the Talmudists and so called elders?\n4. Diversity\n\nOne of the prime aspects of the Infinite, forever expanding Intelligence is diversity.\n\nDiversity of nations, languages, cultures, traditions, shades of color of the skin.\n\nIn that diversity, all possible manifestations of intelligence are allowed expression, complementing each other and adding to each other, forever expanding the scope of what is life.\n\nThis is the very meaning of it all.\n\nAny attempts to constrict that diversity are fatal, and so futile.\n\nWhen you have an absolute rule, ruling a single nation, with a single set of so called laws, regardless of how &quot;perfect&quot; they might be presented as, what you end up with is degeneracy and decay. Inevitably so.\n\nFinally, you will end up with society thinking along the same boring lines, forever doing the same stupid things, and forever agreeing with the same ideas that the others have, because they are the only ideas that are &quot;allowed&quot;.\n\nAnd thus their symbol of a symbolic snake, biting its own tail, which is the same thing as dog, chasing his own tail. Forever.\n\nThe same as a wheel of karma in Indian thought.\n\nEventually, the whole thing simply does not make any sense, and life as such, looses all its meaning.\n\nAt the end, what you end up with, is biorobots and zombies programmed with the same limited ideology of fascist dictate, imposed with the sword and fire upon all...\n\nThe whole life looses all its meaning, all its beauty, and all its impetus to be.\n\nWhy be? What for?\n\nWhat is the meaning of life, if the only thing you are allowed to do is to be just like others? What is it for? Is it just a grand exercise in futility?\n\nWhat is the essence of their so called happiness? What is it about?\n\nAbout stuffing your bellies with food? And chasing the so called fashion? That your mind is programmed to consider as ultimate in your prestige at some show of funky chickens? Isn't it what most of you do, following some fashion and the opinion of the herd, just as they tell you on that zombie box called TV?\n\nWhy are you doing all that idiotic stuff?\n\nJust because the others do? Just as programmed?\n\nBecause stuffing your bellies with food is just about the only thing left for you to do, besides multiplying like a bacteria, devouring all, and destroying all and everything that does not align with your zombie program as preached by the so called elders, which is what Judaism is in essence.\n\nWhat else do you see in it besides beating your head against the wall?\n\nThe religion of a belly, the religion of material, and that is why they invented this so called &quot;dialectic materialism&quot;, and delivered all that sick and deadly ideology of the dry mind via their so called prophet Karl Marx.\n\nAnd, not surprisingly, they have created such a bloodbath during the Russian revolution, that is unparallelled in the entire human history. Between 30 to 70 million people have been slaughtered by these thugs of Trotsky and Beria kind. Even the World War 2 genocide simply pales in comparison. And no one even heard about the biggest genocide in the entire human history, the genocide in Russia by ZioNazis. How come?\n\nBecause it is a logical conclusion of this whole ideology of a concentration camp of a self-imposed ghettos, which is the early model of this so called one world government and this so called New World Order, which is nothing more than a global ghetto, a single super-state, ruled by a single government, and via a single hand of so called supreme ruler.\n\nIn other words, the sickest and most futile model of hell broken loose, and we are beginning to see its final stages.\n5. Who could possibly write these protocols?\n\nTwo people, Rothschild and Asher Ginsberg known by his Hebrew name Ahad Haam.\n\nNo one else could possibly speak with such authority, confidence and understanding of money and power of Gold and its perverse influence on the machinery of the world.\n\nOne interesting point: It says in the protocols that one can not possibly become the ruler, unless he was trained all his life for this job, trained by those, who pass this &quot;sacred&quot; knowledge from generation to generation. Just like the Rothschild family tree.\n\nThat is why these protocols speak with such eloquence on the matters of economics, finances and money.\n\nThe only one, who could possibly speak with full confidence and all the necessary knowledge of the slavery of money, giving the ultimate power over the world to the biggest and baddest bankers, is Rothschild. There simply exists no one who could possibly speak with such confidence and authority about nothing less than enslaving the entire world via money and gold. Who else could that possibly be? Any idea?\n\nAll others are just blabberers, talking heads, and wannabes of all kinds, talking their heads off, while the air moves freely inside their sculls, without understanding a single thing they are talking about, just like these protocols state in no uncertain terms.\n\nWho could possibly speak of enslavement of mankind, and with such a confidence, but those, who own the vast majority of the world's gold supplies?\n\nAnd so, listen to these protocols, Then listen again. And see.\n\nDo they, by any chance, remind you of everything you see around you, down to the last dot and comma?\n\nWhere do you think the events in the world come from? Just some accidental thing? Just some coincidence?\n\nAnd what you will find, and inevitably so, that every single thing you see in the world, all these bloody and utterly senseless wars, all this paranoia about so called terrorism, all these empty speeches about so called freedom and democracy, and the rest of it, every single bit of it was already described in the protocols, and with such an appalling clarity, that it simply boggles ones mind.\n\nIf there is anything that is real in this world, than this is these protocols, and for THOUSANDS of years, since the beginning of times.\n\nIt is all just the same plan, cherished in the minds of Pharisees, just like we know of 2000 years ago, and well before that time.\n\nOne thing is certain, you have never seen anything like this in your entire life and you never have imagined anything like this possible even in principle...\n\nAnd that is the bottom line of it all...\n6. Secrecy\n\nThis is one of the most mind blowing aspects of Judaism. Secrecy.\n\nHave you ever heard of any religion that operates like some clandestine operation, in utter secrecy?\n\nTheir scriptures are secret, and the penalty for disclosing is nothing short of death!\n\nTheir so called elders are secret.\n\nSo called Goyim, or non-Jews, are not to see their so called sacred scriptures.\n\nWhy?\n\nIs it some kind of Mafia? Gang of some sort? Or is it religion?\n\nReligion of what? Satanism, by any chance?\n\nWhy would anyone who is not corrupt or has the worst of intents, keep even the sacred things, like religion, secret?\n\nNot only that, but it is even secret from Jews. Some versions of Talmud are not available even to plain, ordinary rabbis. Why?\n\nUnless it is about evil, most profound, which it actually is. And there is so much evidence of it all over, libraries could be filled with it.\n\nIs it related to this supremacy idea, by any chance?\n7. Supremacy\n\nThis is another one of those interesting things about this so called religion. Supremacy.\n\nYou see, they claim to be the God's chosen people, unlike all others, which is actually written in their scriptures.\n\nAll non-Jews are considered to be even worse than dogs. Nothing more than fices, and in the literal sense of the word. Non-Jews are considered to be nothing more than brainless idiots, the sheer purpose of which is to serve the Jews, and the only reason they are in human form, is not to disgust the Jews, whom they are to serve, with their dirty look if they were animals in a literal sense.\n\nHow do you like that for breakfast?\n\nSo... Are these protocols real?\n\nNah, they are unreal. How could anyone in his clear mind even begin to imagine to concoct such an appalling document as this one?\n\nIs it real?\n\nHow could this be, unless we are dealing with people with mental and psychic problems?\n","torrent":{"xt":"urn:btih:a7810a2af2de1d2e4145ea71e7fd58a44bad2f7e","amp;dn":"NWO%2C+ZioNazi%2C+Matrix%2C+Illuminati%2C+Freemason%2C+Secret+Societies+Vo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7810a2af2de1d2e4145ea71e7fd58a44bad2f7e","infoHashBuffer":{"type":"Buffer","data":[167,129,10,42,242,222,29,46,65,69,234,113,231,253,88,164,75,173,47,126]},"announce":[],"urlList":[]}}