{"title":"[DvdRip-Divx-Ita-Ac3]Neon Genesis Evangelion 1.01 You Are (Not) ","uid":4814884,"size":1504602112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a850bf97bd643f5f4dd328ca95d9e32a725a3e9c&amp;dn=%5BDvdRip-Divx-Ita-Ac3%5DNeon+Genesis+Evangelion+1.01+You+Are+%28Not%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1238508779,"description":"La trama ÃƒÂ¨ in larga parte un adattamento punto per punto della serie originale di Neon Genesis Evangelion dall'episodio 1 al 6. Mentre alcuni eventi sono presentati esattamente nello stesso modo, a volte con la stessa angolazione della camera, alcuni eventi si svolgono in maniera differente.\nShinji Ikari arriva a Neo-Tokyo 3, mandato dal padre Gendo Ikari. Mentre si aggira per la cittÃƒÂ , si ritrova tra il fuoco incrociato dell'esercito delle Nazioni Unite e il quarto Angelo (terzo nella serie originale), Sachiel. Soccorso dal capitano Misato Katsuragi, Shinji viene portato al quartier generale della NERV e viene costretto dal padre Gendo, che ÃƒÂ¨ riuscito a diventare comandante supremo della NERV, a pilotare l'UnitÃƒÂ  EVA 01 contro Sachiel, poichÃƒÂ© la sua prima pilota, la misteriosa Rei Ayanami, ÃƒÂ¨ troppo ferita per farlo. Dopo il combattimento iniziale, Shinji viene accolto da Misato come il suo nuovo coinquilino e iscritto alla scuola media. Il film ritrae i tentativi di Shinji di inserirsi nella nuova vita insieme a Misato, Rei e gli altri personaggi mentre continua a difendere Neo-Tokyo 3 e il mondo dagli Angeli come nuovo pilota dell'UnitÃƒÂ  01. Appare un altro Angelo, e Rei e Shinji devono prelevare l'energia dell'intero Giappone per avere la minima possibilitÃƒÂ  di affrontarlo.\nNella scena finale, Kaworu Nagisa si risveglia sulla Luna, dicendo in maniera enigmatica che non puÃƒÂ² piÃƒÂ¹ aspettare di incontrare Shinji... \n","torrent":{"xt":"urn:btih:a850bf97bd643f5f4dd328ca95d9e32a725a3e9c","amp;dn":"%5BDvdRip-Divx-Ita-Ac3%5DNeon+Genesis+Evangelion+1.01+You+Are+%28Not%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a850bf97bd643f5f4dd328ca95d9e32a725a3e9c","infoHashBuffer":{"type":"Buffer","data":[168,80,191,151,189,100,63,95,77,211,40,202,149,217,227,42,114,90,62,156]},"announce":[],"urlList":[]}}