{"title":"Heterogeneous Catalysis - Fundamentals and Applications","uid":12081188,"size":4623337,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8835115c4c76fb34896532ce789e45423c25dd7&amp;dn=Heterogeneous+Catalysis+-+Fundamentals+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435773340,"description":"Heterogeneous Catalysis - Fundamentals and Applications - Julian R.H. Ross (Elsevier, 2012).pdf\n\nISBN: 978-0-444-53363-0\n\nHeterogeneous catalysis plays a part in the production of more than 80% of all chemical products. It is therefore essential that all chemists and chemical engineers have an understanding of the fundamental principles as well as the applications of heterogeneous catalysts. This book introduces the subject, starting at a basic level, and includes sections on adsorption and surface science, catalytic kinetics, experimental methods for preparing and studying heterogeneous catalysts, as well as some aspects of the design of industrial catalytic reactors. It ends with a chapter that covers a range of examples of important catalytic processes.\n\nThe book leads the student to carrying out a series of &quot;tasks&quot; based on searches of the internet and also on the use of web-based search tools such as Scopus or Web of Science. These tasks are generally based on the text; they can be used entirely for self-study but they can also be tailored to the requirements of a particular course by the instructor/lecturer giving the course.\n\nThe author has had over 40 years of experience in catalytic research as well as in lecturing on the principles of catalysis. He was for more than 20 years the Editor of Catalysis Today.\n\nCoverage of all aspects of catalysis in carefully organised text\nInclusion of material on the historical development of the subject and the personalities involved\nAll concepts illustrated by practical examples\nInclusion of a wide range of problems and solutions, case studies, and supplementary web based material which will be regularly updated\nAuthor has over 40 years research experience of almost all covered subjects\nProvides companion materials webiste","torrent":{"xt":"urn:btih:a8835115c4c76fb34896532ce789e45423c25dd7","amp;dn":"Heterogeneous+Catalysis+-+Fundamentals+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8835115c4c76fb34896532ce789e45423c25dd7","infoHashBuffer":{"type":"Buffer","data":[168,131,81,21,196,199,111,179,72,150,83,44,231,137,228,84,35,194,93,215]},"announce":[],"urlList":[]}}