{"title":"Dynamics of Structure and Foundation - A Unified Approach (Males","uid":6437666,"size":6596595,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8cd43fcfbad0a75804f18d60f46846faf650506&amp;dn=Dynamics+of+Structure+and+Foundation+-+A+Unified+Approach+%28Males&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1306849436,"description":"Dynamics of Structure and Foundation - A Unified Approach: 1. Fundamentals\nPublisher: CRC | Pages: 882 | 2008-12-17 | ISBN 0415471451 | PDF \n\nDesigned to provide engineers with quick access to current and practical information on the dynamics of structure and foundation, this unique work, consisting of two separately available volumes, serves as a complete reference, especially for those involved with earthquake or dynamic analysis, or the design of machine foundations in the oil, gas, and energy sector. \n\nThis first volume deals with theories and formulations, covering the full range of topics involved with dynamics of structure and foundation. It specifically focuses on a unified approach in dealing with dynamic soil-structure interaction and geotechnical considerations for dynamic soil-structure interaction. The authors present new insights and theories, such as the computation of Rayleigh damping for structures with a large number of degrees of freedom, and the dynamic analysis of Hammer foundations, considering non-classical soil damping. \n\nIn a clear style, this well-illustrated guide addresses detailed topics, grouped in the following major themes: elasticity and numerical methods in engineering; lumped parameter vibration; soil-structure systems under static load, and structural and soil dynamics. Intended for academics and professionals in civil and structural engineering involved with earthquake or dynamic analysis or the design of machine foundations. \n","torrent":{"xt":"urn:btih:a8cd43fcfbad0a75804f18d60f46846faf650506","amp;dn":"Dynamics+of+Structure+and+Foundation+-+A+Unified+Approach+%28Males","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8cd43fcfbad0a75804f18d60f46846faf650506","infoHashBuffer":{"type":"Buffer","data":[168,205,67,252,251,173,10,117,128,79,24,214,15,70,132,111,175,101,5,6]},"announce":[],"urlList":[]}}