{"title":"Oxblood - 6 Hard Years","uid":4633126,"size":140134456,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a8f7dd8faae1395033f96f91721624c09115673e&amp;dn=Oxblood+-+6+Hard+Years&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"most_hated","files":22,"time":1231458373,"description":"The band started out in 1992. There was not much of an oi scene in nyc at the time. Some bands came and went until four die hards members, tired of no shows, no bands, but so much oi in their blood to start a band for themselves, and embark onto a journey that still continues today. A band that would go down and still is in the history of oi as the most infamous, angry, violent band around. In the beginning, the line-up consisted of Harry drums, Paul bass, Mac guitar, frank vocals. Harry left the band to pursue his tattooing career in 1994. Frank left right after that to pursue his Psychobilly band. The current line up consist of Mac on vocals, Paul bass, Kevin drums, and Dave on guitar. In spite of their reputation, rumors and setbacks that they have encountered throughout the years, Oxblood is still alive and kicking. The gods of of oi are looking upon them and guiding them through thick &amp; thin to the path of victory. Hated &amp; proud themes on our lyrics are a reflection of our everyday skinhead life in New York City. We sing about things we go through, like violence, being locked up, the New York Police Department, working by chance not by choice etc. Unlike other bands we don't just sing about it, we actually live it. We do many covers in our sets by bands like Criminal Class - soldier, Combat 84 - violence, Brutal Combat - skinhead, Sham 69, 4skins, &amp; other early oi French bands.\n\n format: mp3\n bit rate: 320kbps  \n ripped with: windows media player","torrent":{"xt":"urn:btih:a8f7dd8faae1395033f96f91721624c09115673e","amp;dn":"Oxblood+-+6+Hard+Years","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8f7dd8faae1395033f96f91721624c09115673e","infoHashBuffer":{"type":"Buffer","data":[168,247,221,143,170,225,57,80,51,249,111,145,114,22,36,192,145,21,103,62]},"announce":[],"urlList":[]}}