{"title":"Pastrami on Rye_ An Overstuffed History of - Ted Merwin.epub","uid":12995871,"size":2013499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa0f2b3478c4de958c0b29b48fd5a3c4a6f0dfcc&amp;dn=Pastrami+on+Rye_+An+Overstuffed+History+of+-+Ted+Merwin.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mr_mando","files":1,"time":1450160232,"description":"Pastrami on Rye: An Overstuffed History of the Jewish Deli - Ted Merwin\r\n\r\n\r\nFor much of the twentieth century, the New York Jewish deli was an iconic institution in both Jewish and American life. As a social space it rivaled—and in some ways surpassed—the synagogue as the primary gathering place for the Jewish community. In popular culture it has been the setting for classics like When Harry Met Sally. And today, after a long period languishing in the trenches of the hopelessly old-fashioned, it is experiencing a nostalgic resurgence.\r\n \r\nPastrami on Rye is the first full-length history of the New York Jewish deli. The deli, argues Ted Merwin, reached its full flowering not in the immigrant period, as some might assume, but in the interwar era, when the children of Jewish immigrants celebrated the first flush of their success in America by downing sandwiches and cheesecake in theater district delis. But it was the kosher deli that followed Jews as they settled in the outer boroughs of the city, and that became the most tangible symbol of their continuing desire to maintain a connection to their heritage. Ultimately, upwardly mobile American Jews discarded the deli as they transitioned from outsider to insider status in the middle of the century. Now contemporary Jews are returning the deli to cult status as they seek to reclaim their cultural identities. \r\n \r\nRichly researched and compellingly told, Pastrami on Rye gives us the surprising story of a quintessential New York institution","torrent":{"xt":"urn:btih:aa0f2b3478c4de958c0b29b48fd5a3c4a6f0dfcc","amp;dn":"Pastrami+on+Rye_+An+Overstuffed+History+of+-+Ted+Merwin.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa0f2b3478c4de958c0b29b48fd5a3c4a6f0dfcc","infoHashBuffer":{"type":"Buffer","data":[170,15,43,52,120,196,222,149,140,11,41,180,143,213,163,196,166,240,223,204]},"announce":[],"urlList":[]}}