{"title":"Acts Of Vengeance (Complete)","uid":7655968,"size":702865803,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ab31e203a1da4c0cad3243a8a05ab68016d2ab34&amp;dn=Acts+Of+Vengeance+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"SplhcbPrime","files":-1,"time":1348156486,"description":"&quot;Acts of Vengeance&quot; is a comic book crossover storyline that ran through several titles published by Marvel Comics from December, 1989 to February, 1990.\n\nThe core titles of the crossover include The Avengers; Avengers Spotlight; Avengers West Coast; Captain America; Iron Man; Quasar; Thor; and Fantastic Four.  Major tie-ins included The Amazing Spider-Man among other Spider-Man titles, and The Uncanny X-Men, too.  An epilogue features in Cloak and Dagger; Web Of Spider-Man; and in an Avengers Annual.\n\nA stranger (the Asgardian god, Loki, in disguise) coerces a group of master super villains, which Loki calls the Prime Moviers, to join forces in a conspiracy to destroy the super hero team, The Avengers, especially his arch-rival, Thor.  Loki does this to strike back at his adopted brother Thor, and is also bitter that he inadvertently caused the formation of The Avengers.  The super villain team consists of Doctor Doom, Kingpin, Magneto, Mandarin, Red Skull, and The Wizard.  Loki also attempts to recruit characters Apocalypse, Cobra, and Mad Thinker, but they all decline.  Loki also approaches Namor, The Sub-Mariner, but he rejects the offer stating he is not a villain anymore.\n\nTo assist the master villains, Loki engineers a jailbreak at the holding facility, The Vault.  The lesser villains are then directed against heroes (mainly The Avengers and Spider-Man) who have never fought them before, the theory being that the unfamiliarity will act in favor of the villains.\n\nWhile they did manage to give many of the heroes unusual fits, the plan eventually fails as the master villains fail to cooperate, and bicker with each other, with Magneto attacking Red Skull and imprisoning him in a buried crypt.  The super villain pawns are defeated by the super heroes.  A frustrated Loki reveals himself and imprisons the Kingpin, Mandarin and Wizard, while Doctor Doom is revealed to have been using a Doombot.  (Magneto is not present.)  The Avengers track the group and defeat the villains, with Thor forcing Loki to flee back to their native home of Asgard.\n\nAlthough this event was huge in its scope, covering almost every Marvel title at the time, it had few lasting consequences.  The most significant outcomes perhaps were the transformation of Psylocke into an Asian ninja assassin, and the first appearance of the New Warriors team in comics (in the pages of Thor.)  Although Spider-Man briefly gained the powers of Captain Universe, he lost them fairly soon afterward.\n\nThis torrent contains all The Acts Of Vengeance titles I could find, and is in the best reading order I could muster.  If you see any flaws whatsoever, please advise.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners, please.\n\n","torrent":{"xt":"urn:btih:ab31e203a1da4c0cad3243a8a05ab68016d2ab34","amp;dn":"Acts+Of+Vengeance+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab31e203a1da4c0cad3243a8a05ab68016d2ab34","infoHashBuffer":{"type":"Buffer","data":[171,49,226,3,161,218,76,12,173,50,67,168,160,90,182,128,22,210,171,52]},"announce":[],"urlList":[]}}