{"title":"Trouble in the Fields: An Artists Tribute to Nanci Griffith[2012","uid":10351904,"size":327770211,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ab97b3df0a9cbafdd0a8b3ed5d93365a16069dde&amp;dn=Trouble+in+the+Fields%3A+An+Artists+Tribute+to+Nanci+Griffith%5B2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1402681264,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Paradiddle Records/01007\nCountry: USA\nYear: November 6, 2012\nGenre: folk/americana\nFormat: CD,Album\n\n[b]\n1-Listen to the Radio -Sara Hickman\n2-Trouble in the Fields- Caroline Doctorow\n3- I'm Not Driving These Wheels-The Kennedy\n4- If I Were A Child -Tom Russel\n5- I Wish it Would Rain -Eric Brace &amp; Last Train Home With Alice Despard\n6- The Flyer- Amy Rigby\n7-Talk To Me While I'm Listening- Jerry Jeff Walker\n8- Gulf Coast Highway- Tracy Grammer &amp; Jim Henry\n9- It's A Hard Life Wherever You Go- Edwina Hayes \n10-Last of The True Believers- John Stewart\n11- Anyone Can Be Somebody's Fool- Julie Gold\n12-Lookin' For The Time- Red Molly \n13- I Don't Wanna Talk About Love - Carolyn Hester\n14-Love At The Five And Dime- Stacey Earle &amp; Mark Stuart\n\n\n\nGood Times says - &quot;...unique (and wonderful) new album... a high water mark for Paradiddle as a true creative force in Americana/roots...&quot; This CD features 14 Nanci Griffith compositions, some familiar, some not, performed by an eclectic array of artists. From 60's folk revivalists, John Stewart and Carolyn Hester, to contemporary folk rockers, The Kennedys, every song, is imbued with the individual style and personality of each artist. \n\nGrammy award winning Texas singer-songwriter Nanci Griffith has been recording since 1978. Her most recent CD, Intersection, was released this year. She describes her style as, &quot;folkabilly&quot; which can best be described as a hybrid of folk, country and pop. In addition to her own songs, Griffith is well known for her interpretations of other songwriters' material. Several of these same artists, including Jerry Jeff Walker, Tom Russell, John Stewart, and Julie Gold, repay the favor on Trouble in The Fields.\n\nNanci has always tackled political and social topics in her songs and her current record is her most rebellious to date. You can pick up &quot;A Blue Girl in a Red State&quot; bumper sticker at her latest concert performances. Her activism includes an affiliation with Mines Advisory Group (MAG), which is an international not-for-profit, non-governmental organization that assists people affected by landmines and unexploded ordnance. Profits generated by sales of this CD will benefit this charity.\n\nThis project has been a labor of love for executive producers, Pete and Maura Kennedy, who recently toured with Nanci to support her latest release. Paradiddle Records is honored and excited to be a part of it.\n","torrent":{"xt":"urn:btih:ab97b3df0a9cbafdd0a8b3ed5d93365a16069dde","amp;dn":"Trouble+in+the+Fields%3A+An+Artists+Tribute+to+Nanci+Griffith%5B2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab97b3df0a9cbafdd0a8b3ed5d93365a16069dde","infoHashBuffer":{"type":"Buffer","data":[171,151,179,223,10,156,186,253,208,168,179,237,93,147,54,90,22,6,157,222]},"announce":[],"urlList":[]}}