{"title":"The Darkest Jungle, The True Story of the Darien Expedition","uid":4312868,"size":275565070,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:abcf2e0fe9e8c6a8e6c7a17b3b89a483426d0605&amp;dn=The+Darkest+Jungle%2C+The+True+Story+of+the+Darien+Expedition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"deandominic","files":189,"time":1216910646,"description":"General Information\n===================\n Title............: The Darkest Jungle: The True Story of the Darien Expedition and America&amp;#039;s Ill-Fated Race to Connect the Seas                               \n Author...........: Todd Balf            \n Read By..........: Scott Brick                           \n Publisher........: Books on Tape; Unabridged edition (2003)\n\nOriginal Media Information\n==========================\n Media............: 8 CDs \n \nFile Information\n================\n Number of MP3s...: 184\n Total Duration...: 9 hours 27 minutes\n Total MP3 Size...: 262 MB           \n Encoder Settings.: CBR 64 kbit/s 44100 Hz Mono          \n ID3 Tags.........: v1.1, v2.3\n\nBook Description\n================\n\nThe Darkest Jungle tells the harrowing story of America&amp;#039;s first ship canal exploration across a narrow piece of land in Central America called the Darien, a place that loomed large in the minds of the world&amp;#039;s most courageous adventurers in the nineteenth century. With rival warships and explorers from England and France days behind, the 27-member U.S. Darien Exploring Expedition landed on the Atlantic shore at Caledonia Bay in eastern Panama to begin their mad dash up the coast-hugging mountains of the Darien wilderness. The whole world watched as this party attempted to be the first to traverse the 40-mile isthmus, the narrowest spot between the Atlantic and Pacific in all the Americas.\n\nLeading them was the charismatic commander Isaac Strain, an adventuring 33-year-old U.S. Navy lieutenant. The party could have turned back except, said Strain, they were to a man &quot;revolted at the idea&quot; of failing at a task they seemed destined to accomplish. Yet Strain&amp;#039;s party would wander lost in the jungle for another sixty nightmarish days, following a tortuously contorted and uncharted tropical river. Their guns rusted in the damp heat, expected settlements never materialized, and the lush terrain provided little to no sustenance. As the unending march dragged on, the party was beset by flesh-embedding parasites and a range of infectious tropical diseases they had no antidote for (or understanding of). In the desperate final days, in the throes of starvation, the survivors flirted with cannibalism and the sickest men had to be left behind so, as the journal keeper painfully recorded, the rest might have a chance to live.\n\nBased on the vividly detailed log entries of Strain and his officers, other period sources, and Balf&amp;#039;s own treks in the Darien Gap, this is a rich and utterly compelling historical narrative that will thrill readers who enjoyed In the Heart of the Sea, Isaac&amp;#039;s Storm, and other sagas of adventure at the limits of human endurance.\n","torrent":{"xt":"urn:btih:abcf2e0fe9e8c6a8e6c7a17b3b89a483426d0605","amp;dn":"The+Darkest+Jungle%2C+The+True+Story+of+the+Darien+Expedition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abcf2e0fe9e8c6a8e6c7a17b3b89a483426d0605","infoHashBuffer":{"type":"Buffer","data":[171,207,46,15,233,232,198,168,230,199,161,123,59,137,164,131,66,109,6,5]},"announce":[],"urlList":[]}}