{"title":"[Billiard Deluxe]","uid":8538911,"size":103768651,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ad7e1b1c097ce733c5b623e8ed4f93f9a79c7d0d&amp;dn=%5BBilliard+Deluxe%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"[The-B1ight3r]","files":-1,"time":1370342879,"description":"[The-B1ight3r]:~Instant Play~\n\nSynopsis/Precis:\n\nBilliard Deluxe is a not simply ?one more? billiard game. It rather a brand new billiard game with its own style and character. For the first time you can find all most popular billiard game in one package. With Billiard Deluxe you can select not only the game to play, but also the place to do that. You can choose the interior, which allows you to feel comfortable, you can select game accessories you most prefer, you can select not only thing, but the spirit.\nProgram offers you the 4 most popular billiard game types:\n- Pool including 5 top subtypes: 8-ball, 9-ball, 10-ball, One pocket, Straight pool\n- Snooker\n- Russian billiard\n- Carambole (carom). \nBilliard Deluxe allows player to select the most important game components, such as game hall interior, tables, cues, which are represented in several predefined styles / shapes. Game uses modern 3D-engine to provide best motion, graphic and sound quality. You can play with your partner on the same computer or through network. Computer (artificial intelligence) opponent with different levels of experience is also for your service.\nThere is special tutorial mode, which supports you to understand the stroke technique and to predict the ball path and results.\nThe rules of games are conformed to (with minor changes to increase playability) rules determined by Billiard Congress of America (pool), World Professional Billiards &amp; Snooker Association (snooker), Russian Billiard Federation (Russian billiard) and United States Billiard Association (carom).\n\nImportant Notes:\n\n-The ISO file Is Password Protected\n-The password is the same as the file name, excluding the .iso extension\n-Copy and paste the name of the game in the little dialog box\n-Either mount using an image processor program onto a virtual drive or extract to    any desired location that you prefer.\n-Open the game folder and search for the executive button to play instantly!!!!\n-Injoy quality rips only from [The-B1ight3r]\t","torrent":{"xt":"urn:btih:ad7e1b1c097ce733c5b623e8ed4f93f9a79c7d0d","amp;dn":"%5BBilliard+Deluxe%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad7e1b1c097ce733c5b623e8ed4f93f9a79c7d0d","infoHashBuffer":{"type":"Buffer","data":[173,126,27,28,9,124,231,51,197,182,35,232,237,79,147,249,167,156,125,13]},"announce":[],"urlList":[]}}