{"title":"Thief-The_Dark_Project-DVNiSO","uid":8211493,"size":737097696,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ae98a5b40f86f8f85842c366060df5e757f0c5f6&amp;dn=Thief-The_Dark_Project-DVNiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Totenkruez","files":-1,"time":1362248790,"description":"Thief: The Dark Project\nby EIDOS.\n\nFormat.....: BIN/CUE\nRAR Count......:  50  X 15MB\nDate.......: December 2, 1998\nGame Rating....: [**********] 10/10\nCracker....: DaJackal\nProtection.....: CD Checks\n\nRequirements: Windows 95/98, Pentium 166, 32MB RAM, 4xCD, DX 6\n\nR E L E A S E    I N F O\n\nThief:  The  Dark  Project  is  a  revolutionary  first person action\nadventure  that introduces  stealth, subterfuge, and mystery to a tired\ngenre of mindless shooting\n\nAs  Garrett, a  cynical  and  world-weary master thief, you must make\nuse of stealth and  intellect to complete your missions. You live in an\nancient city of  a fictional past  where magic and primitive technology\ncoexist uneasily.  Your victims  are the city's  corrupt and privileged\nnobility, whose wealth is at your disposal as long as their guards dont\nsee you, at least not until it is too late.\n\nYour dark heroics earn you the  attention of a mysterious patron  who\noffers you a fortune if  you can  retrieve an  enormous gemstone with a\nnotorious reputation. But it soon becomes  clear that  more is at stake\nthan a comfortable retirement. Your efforts trigger a  conflict between\nveiled powers  who compete to  pull your strings. You'll need  all your\nstrength and wits  to discover the  truth and  escape from  the web  of\nintrigue and deception spun around you.\n\nGarrett's   adventures   will   take   you   through  moon-lit   city\nstreets,  guarded  mansions, secure prisons, blazing factories, haunted\ncathedrals, abandoned ruins,  grim catacombs, subterranean lost cities,\nand even into strange, distant  realms  where the laws of this earth no\nlonger apply.\n\nFEATURES:\n^^^^^^^^^\nSuccess requires more  than  firepower - use stealth and intellect to\noutwith your enemies.\n\nUnique  weapons help  you  achieve  your goals: Use your Blackjack to\nknockout unsuspecting opponents, a  noise  arrow  to throw them off the\ntrail, moss bombs to silence your footsteps in stone corridors,  and if\nthese don't keep you out of sight, it  might be time to resort to  more\ndrastic measures, like a fire arrow, or your trusty sword.\n\nThe  revolutionary  &quot;Dark Engine&quot; TM  provides advanced environmental\nsimulation  never  before  achieved in a PC game.  Advanced AI includes\ncreatures  with  &quot;hearing&quot; capabilities,  which react  to sounds in the\nenvironment - so step lightly across the stones  and look  for carpeted\nareas to sneak past enemies.\n\nImprovise tactics  in  a fluid, ever-changing  game world,  without the\nrestrictions   of   conventional  game   engines.  Provides   realistic\nsimulation   of   fire,   water,  wind    and  their  effects  in   the\ngame environment: flammable  objects catch fire, buoyant objects float,\nheavy objects can be used to block doors.\n\nAdvanced   graphics   engine   with   multiple  texture  resolutions,\ndynamic lighting.","torrent":{"xt":"urn:btih:ae98a5b40f86f8f85842c366060df5e757f0c5f6","amp;dn":"Thief-The_Dark_Project-DVNiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae98a5b40f86f8f85842c366060df5e757f0c5f6","infoHashBuffer":{"type":"Buffer","data":[174,152,165,180,15,134,248,248,88,66,195,102,6,13,245,231,87,240,197,246]},"announce":[],"urlList":[]}}