{"title":"Cars 2 (2011) [Xbox360][RegionFree][MULTi5]","uid":6478365,"size":7838695512,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:af002d98cba12beb248e4f219db5bdf00d67b5c3&amp;dn=Cars+2+%282011%29+%5BXbox360%5D%5BRegionFree%5D%5BMULTi5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":2,"time":1308403163,"description":"Cars 2 (2011) [Xbox360][RegionFree][MULTi5]\n &lt;a href=&quot;\nhttp://uk.xbox360.ign.com/objects/100/100482.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uk.xbox360.ign.com/objects/100/100482.html&lt;/a&gt; &lt;a href=&quot;\nhttp://www.3djuegos.com/10685/cars-2/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.3djuegos.com/10685/cars-2/&lt;/a&gt;\n\nEnglish:\n------------\nPlatform: Xbox 360 \nLanguages: English, Spanish, French, Italian, German \nRegion: Regionfree \nFormat: ISO \nWave 11 \nGenre: Driving, Arcade \nDeveloper: Avalanche Software \nDistributed by: Disney \nAlso available on: PC PS3 Wii PSP DS \nReleased: June 23, 2011 \nRecommended price: 54.99 \nRecommended age (ESRB): 7 + \n\nDescription: \n-------------------- \nCars 2: The Game offers players within the International Training Centre CHROME (Headquarters Operations Command Recognition and espionage motorized), choose from over 20 different characters and train to become world-class spy. As part of its international training, participate in a simulation of dangerous missions with high-tech devices to avoid and reduce opponents. \nBased on computer-animated Pixar Cars 2: The Video Game follows the exploits of characters Lightning McQueen and Mater car, and to train in a secret facility known as chromium, short for Headquarters Operations Command Recognition Motorized and espionage. They are joined by Finn and Shiftwell McMissile Holley in his bid to become the car equivalent of the spies. The game introduces a series of missions to complete cheerful, as use of gadgets for each car to escape or to stop their rivals. It will also be able to perform stunts like the reverse driving air tricks, and two wheels driving the objectives to complete. Cars 2: The Video Game also interacts with the free-to-play World of Cars Online, allowing players to unlock rewards in both versions of the specific tasks. \n\n\n\n\nEspaÃƒÂ±ol:\n-------------\nPlataforma: Xbox 360\nIdiomas: Ingles, EspaÃƒÂ±ol, Frances, Italiano, Aleman\nRegion: RegionFree\nFormato: ISO\nWave 11\nGÃƒÂ©nero: ConducciÃƒÂ³n, Arcade\nDesarrollado por: Avalanche Software\nDistribuido por: Disney\nTambiÃƒÂ©n disponible en: PC  PS3  Wii  PSP  DS \nLanzamiento: 23 de junio de 2011 \nPrecio recomendado: 54.99 \nEdad recomendada (PEGI): 7+ \n\nDescripcion:\n--------------------\nCars 2: El Videojuego ofrece a los jugadores en el interior del Centro Internacional de FormaciÃƒÂ³n CROMO (Cuartel General del Comando de Operaciones de Reconocimiento y espionaje motorizados), donde elegir entre mÃƒÂ¡s de 20 personajes diferentes y entrenar para convertirse en espÃƒÂ­as de clase mundial. Como parte de su formaciÃƒÂ³n internacional, participarÃƒÂ¡n en una simulaciÃƒÂ³n de misiones peligrosas con aparatos de alta tecnologÃƒÂ­a para evadir y disminuir los adversarios.\nBasado en la pelÃƒÂ­cula animada por computadora de Pixar, Cars 2: The Video Game sigue las hazaÃƒÂ±as de personajes coche Rayo McQueen y Mater, ya que entrenar en una instalaciÃƒÂ³n secreta conocida como el cromo, la abreviatura de Cuartel General del Comando de Operaciones de Reconocimiento y espionaje motorizado. A ellos se suman McMissile Finn y Shiftwell Holley en su intento de convertirse en el coche-equivalente a los espÃƒÂ­as. El juego introduce una serie de misiones para completar alegre, como uso de los gadgets de cada vehÃƒÂ­culo para escapar o para detener sus rivales. TambiÃƒÂ©n serÃƒÂ¡ capaz de realizar acrobacias como el revÃƒÂ©s de conducciÃƒÂ³n, trucos de aire, y dos ruedas de conducciÃƒÂ³n a los objetivos de completar. Cars 2: The Video Game tambiÃƒÂ©n interactÃƒÂºa con el libre-a-jugar a World of Cars Online, permitiendo a los jugadores para desbloquear recompensas en ambas versiones de la realizaciÃƒÂ³n de tareas especÃƒÂ­ficas.\n\n\n","torrent":{"xt":"urn:btih:af002d98cba12beb248e4f219db5bdf00d67b5c3","amp;dn":"Cars+2+%282011%29+%5BXbox360%5D%5BRegionFree%5D%5BMULTi5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af002d98cba12beb248e4f219db5bdf00d67b5c3","infoHashBuffer":{"type":"Buffer","data":[175,0,45,152,203,161,43,235,36,142,79,33,157,181,189,240,13,103,181,195]},"announce":[],"urlList":[]}}