{"title":"Cerebus - High Society","uid":8644387,"size":380928254,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:af05ce20a8a3f81c39ee1a4ced92eaae0bb85b05&amp;dn=Cerebus+-+High+Society&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fudoh101","files":25,"time":1372953434,"description":"Issue 26 to 50. The High Society story-line.\n\nPublished by Aardvark 1981-1983.\n\nVolume two of the Cerebus the Aardvark series, High Society, is the beginning of the main Cerebus story line and one of the finest graphic novels ever published. If you have to start from the very beginning, you'll need the first volume, Cerebus, but if you don't mind a modicum of confusion, this is a much more satisfying place to begin. The artwork is much improved and the level of humor reaches its high point in the series to date. (Unkind critics point to High Society as the older, funnier book of the Cerebus series.)\nParliamentary politics were never so much fun as they are in the Prime Minister election of 1414. Lord Julius and the mysterious Astoria battle for control of the city-state Iest with Cerebus as their unwitting pawn. Goats, bunny sketches, the Regency Elf, and Moon Roach join the pandemonium, helping to set the stage for things to come. High Society is a home run; an instant classic both as a stand-alone volume and in the context of the rest of the series. Beware though, the ending dovetails directly into Church and State; You may want to grab that volume as well, because once you start the series, the story of Cerebus gets increasingly harder to put down.","torrent":{"xt":"urn:btih:af05ce20a8a3f81c39ee1a4ced92eaae0bb85b05","amp;dn":"Cerebus+-+High+Society","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af05ce20a8a3f81c39ee1a4ced92eaae0bb85b05","infoHashBuffer":{"type":"Buffer","data":[175,5,206,32,168,163,248,28,57,238,26,76,237,146,234,174,11,184,91,5]},"announce":[],"urlList":[]}}