{"title":"POV Pantyhose Sex #5 (DVD.xvid) - feet,stockings,panty","uid":4622114,"size":733492640,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:afcf4c8edfd1604c0114c54f892eb064ad4d1b45&amp;dn=POV+Pantyhose+Sex+%235+%28DVD.xvid%29+-+feet%2Cstockings%2Cpanty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"h0tspurred","files":4,"time":1231078968,"description":"POV Pantyhose Sex #5 (DVD.xvid) \n\n\n \n\n\n\nscreens:\n  &lt;a href=&quot;\nhttp://mainx.blogbugs.org/4558394/POV-Pantyhose-Sex-5---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mainx.blogbugs.org/4558394/POV-Pantyhose-Sex-5---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nStarring:\n\nRoxy Jezel, Avy Lee Roth, Ava Ramone, Monique Fuentes, Shy Love \n\n\n\nThis starts out with lovely Roxy Jezel in shiny beige PH with a little skirt and black platform slides! She teases JB and soon he`s rubbing his cock against her pretty silky legs as she talks to him. Slipping the heels off she strokes him with her feet before rubbing her cotton panel against him as well. Next she gives him a BJ for a bit and rubs her legs on it some more before straddling him to jack him with her hand till he cums on her thigh! \n\nNext is Avy Lee Roth in a minidress with shiny beige PH and black high pumps! She teases him and soon he`s kissing her legs and ass till he rubs his cock on her ass and legs. She gives him a BJ for a bit till her gives her head thru the hose then he rips open her PH to fuck her for a bit till he pulls out and she strokes him onto her tummy. \n\nNext is Ava Ramone in black seamed PH and platform slides! She strokes him with her legs for a bit and gives him a BJ till they 69 and he rips open her PH to fuck her a bit then she blows him again and gives him a hand job till he cums all over her leg. \n\nMonique Fuentes is next in a skirt with shiny black PH with lacy control top and black pumps. She teases him with her legs and rubs his cock on her legs then strokes him with her hands and feet till he cums getting a little on her foot. \n\nShy Love is next in shiny tan lite control top PH giving him a BJ to start out. They fuck in a couple positions as well after the hose are ripped open till she jacks him off onto her thigh! \n\n\n\nFormat:      AVI (xvid)\nResolution:  528x400\nDuration:    55 mins.\n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:afcf4c8edfd1604c0114c54f892eb064ad4d1b45","amp;dn":"POV+Pantyhose+Sex+%235+%28DVD.xvid%29+-+feet%2Cstockings%2Cpanty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afcf4c8edfd1604c0114c54f892eb064ad4d1b45","infoHashBuffer":{"type":"Buffer","data":[175,207,76,142,223,209,96,76,1,20,197,79,137,46,176,100,173,77,27,69]},"announce":[],"urlList":[]}}