{"title":"Haven (2004) Orlando Bloom,Zoe Saldana","uid":8832294,"size":563478874,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b018e06035d0ce4a6cbb0cc2d0aefb35c21f0e25&amp;dn=Haven+%282004%29+Orlando+Bloom%2CZoe+Saldana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"peaquod","files":-1,"time":1377019148,"description":"&quot;Haven&quot; is an entertaining movie, with a complex non-linear screenplay with many characters that have their lives entwined. There are many credible sub-plots and considering the running time of 99 minutes, the situations and characters are very well-developed. The direction and acting are great, there are many beautiful locations but the screenplay is really top-notch.\n\nIn Cayman Island, the daughter of a powerful man - Andrea (Zoe Saldana) - and the fisherman Shy (Orlando Bloom) are in a deep but secret love, hidden from Andrea's parents. When Andrea's father sails in a fish-trip, they have a night of love at Andrea's home; however they sleep and are surprised by the arrival of her family in the morning. Later, Andrea's brother Hammer (Anthony Mackie) throws acid on the face of Shy and spends four months in prison. In Miami, the dirty businessman Carl Ridley (Bill Paxton) is chased by Federal agents and escapes with his teenage daughter Pippa (Agnes Bruckner) to Cayman Island trying to reach his lawyer Mr. Allen (Stephen Dillane). Pippa meets the small time thief Fritz (Victor Rasuk) sleeping in her room and he invites her to go a party. Before leaving the condo, Fritz sees Carl counting lots of money. Fritz owes money to the dangerous drug dealer Richie Rich (Razaaq Adoti) and tells him about the fortune Carl has. Along a Friday 13th night, their lives entwine in a chain of tragic events","torrent":{"xt":"urn:btih:b018e06035d0ce4a6cbb0cc2d0aefb35c21f0e25","amp;dn":"Haven+%282004%29+Orlando+Bloom%2CZoe+Saldana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b018e06035d0ce4a6cbb0cc2d0aefb35c21f0e25","infoHashBuffer":{"type":"Buffer","data":[176,24,224,96,53,208,206,74,108,187,12,194,208,174,251,53,194,31,14,37]},"announce":[],"urlList":[]}}