{"title":"Halo Spartan Assault 2014 (2-click run)","uid":9894686,"size":1149934009,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b0b132f9603e161746cafecde8f0aefa2c34ea43&amp;dn=Halo+Spartan+Assault+2014+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"The_Duck1","files":-1,"time":1396687181,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nAvailable only for Windows 8 and Windows Phone 8, &quot;Halo: Spartan Assault&quot; is a new top-down action shooter that brings a &quot;Halo&quot; video game to touch-based devices for the first time in franchise history. Developed by 343 Industries in conjunction with Vanguard Games, &quot;Halo: Spartan Assault&quot; provides an accessible, pick-up-and-play experience for fans and newcomers alike. Set between the events of &quot;Halo 3&quot; and &quot;Halo 4,&quot; &quot;Halo: Spartan Assault&quot; is a new chapter of the award-winning &quot;Halo&quot; universe that explores the first missions of the Spartan Ops program and dives deeper into the backstory of Human-Covenant wars. Play through the eyes of either Commander Sarah Palmer or Spartan Davis stationed aboard the UNSC Infinity as they fight never-before-seen battles against Covenant forces. With rich storytelling, intuitive controls, and best-in-class action, audio and graphics, &quot;Halo: Spartan Assault&quot; brings the epic scale and action of the &quot;Halo&quot; universe to mobile devices through unrivaled action and intensity.\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:b0b132f9603e161746cafecde8f0aefa2c34ea43","amp;dn":"Halo+Spartan+Assault+2014+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0b132f9603e161746cafecde8f0aefa2c34ea43","infoHashBuffer":{"type":"Buffer","data":[176,177,50,249,96,62,22,23,70,202,254,205,232,240,174,250,44,52,234,67]},"announce":[],"urlList":[]}}