{"title":"Susan Schneider - The Language of Thought. A New Philosophical D","uid":10440226,"size":711547,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b11046d976ae6a311f3505d0344a11158e6afb7a&amp;dn=Susan+Schneider+-+The+Language+of+Thought.+A+New+Philosophical+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1403879667,"description":"Description\nProduct Details\nBook Title: The Language of Thought: A New Philosophical Direction\t\nBook Author: Susan Schneider (Author)\nHardcover: 272 pages\nPublisher: The MIT Press (April 29, 2011)\nLanguage: English\nISBN-10: 0262015579\nISBN-13: 978-0262015578\n\n===================================================================================\nBook Description\nPublication Date: April 29, 2011\nThe language of thought (LOT) approach to the nature of mind has been highly\ninfluential in cognitive science and the philosophy of mind; and yet, as Susan Schneider argues, its philosophical foundations are weak. In this philosophical refashioning of LOT and the related computational theory of mind (CTM), Schneider offers a different framework than has been developed by LOT and CTM's main architect, Jerry Fodor: one that seeks integration with neuroscience, repudiates Fodor's pessimism about the capacity of cognitive science to explain cognition, embraces pragmatism, and advances a different approach to the nature of concepts, mental symbols, and modes of presentation.\nAccording to the LOT approach, conceptual thought is determined by the manipulation of mental symbols according to algorithms. Schneider tackles three key problems that have plagued the LOT approach for decades: the computational nature of the central system (the system responsible for higher cognitive function); the nature of symbols; and Frege cases. To address these problems,] Schneider develops a computational theory that is based on the Global Workspace approach; develops a theory of symbols, &quot;the algorithmic view&quot;; and brings her theory of symbols to bear on LOT's account of the causation of thought and behavior. In the course of solving these problems, Schneider shows that LOT must make peace with both computationalism and pragmatism; indeed, the new conception of symbols renders LOT a pragmatist theory. And LOT must turn its focus to cognitive and computational neuroscience for its naturalism to succeed.\n\n===================================================================================\nReviews\nA must-read for proponents and opponents of the language of thought alike.(John Heil, Professor of Philosophy, Monash University, and Professor of Philosophy-Neuroscience-Psychology, Washington University in St Louis)\n\nSusan Schneider has written a beautifully clear and highly original reappraisal of the language of thought hypothesis, reworking it from its very roots and bringing it into harmony with the latest developments in cognitive and computational neuroscience. Her fine book makes essential reading for philosophers of mind and cognitive scientists alike.(E.J. Lowe, Durham University)\n\nSusan Schneider's The Language of Thought: A New Philosophical Direction does precisely what its title claims: it provides a new orientation for the language of thought and the related computational theory of mind. Schneider bravely stakes out new theoretical commitments for LOT, such as a pragmatist theory of concepts and a theory of symbols. Whether you agree or disagree with the LOT approach -- I myself am a critic -- Schneider's book is an absolutely necessary read for anyone interested in philosophy of mind and the foundations of cognitive science.(Mark Bickhard, Henry R. Luce Professor in Cognitive Robotics and the Philosophy of Knowledge, Lehigh University)\n\n===================================================================================\nAbout the Author\nSusan Schneider is Assistant Professor of Philosophy, a faculty member in the Institute for Research in Cognitive Science and the Center for Cognitive Neuroscience, and a member of the Center for Neuroscience and Society at the University of Pennsylvania.\n===================================================================================","torrent":{"xt":"urn:btih:b11046d976ae6a311f3505d0344a11158e6afb7a","amp;dn":"Susan+Schneider+-+The+Language+of+Thought.+A+New+Philosophical+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11046d976ae6a311f3505d0344a11158e6afb7a","infoHashBuffer":{"type":"Buffer","data":[177,16,70,217,118,174,106,49,31,53,5,208,52,74,17,21,142,106,251,122]},"announce":[],"urlList":[]}}