{"title":"Batman Beyond - COMPLETE (NTSC)","uid":10703141,"size":53377474560,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b1526d31bcd9e18faa686278eb5fd9a43315f05e&amp;dn=Batman+Beyond+-+COMPLETE+%28NTSC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Aqualad700","files":8,"time":1407250447,"description":"Terry McGinnis was just an ordinary teenager...until his father was mysteriously murdered. Suspecting foul play at his father's company Wayne/Powers Corporation, Terry meets Bruce Wayne and learns a secret identity hidden for decades. Now too old to battle injustice, Wayne refuses to help. So Terry does what any brash young kid would do: steal the Batsuit and take matters into his own hands! Vowing to avenge his father's death, Terry dons the high-tech suit ? tricked out with jetpacks, a supersensitive microphone and even camouflage capabilities ? in search of his father's assassin. Get in on the action from the beginning of a new partnership between an ex-crimefighter and his apprentice.\n\nSpecial features:\n\nAudio Commentary:Rebirth, Pt.1 Audio Commentary: Audio Commentary with Bruce Timm- Producer, Alan Burnett- Producer, Paul Dini- Producer, Glenn Murakami- Producer, and Curt Geda- Director Shriek Audio Commentary: Audio Commentary with Bruce Timm- Producer, Alan Burnett- Producer, Glenn Murakami- Producer, Curt Geda- Director, and Stan Berkowitz- Writer \nInterviews:Inside Batman Beyond: Every Batman fan wishes they could sit at a table with it?s creators of the series. Well, now here?s a chance for that to take place with a few surprises\nMusic Only Track:Music of The Knight: Bruce Timm intro?s the music from five key scenes of Batman Beyond as you choose which one you would like to hear with dramatic music only.\n\n26 episodes on 4 discs\n&quot;Inside Batman Beyond: The Panel&quot; discussion with Producer Bruce Timm, Producer Alan Burnett, Producer Glen Murakami, Producer Paul Dini and Moderator Jason Hillhouse\nCommentary on episodes &quot;Splicers&quot; and &quot;Eggbaby&quot; with producers Bruce Timm and Glen Maurakami and others.\n\nThe final 13 episodes on two discs\nInside Batman Beyond: Season 3: the producers of Batman Beyond (Bruce Timm, Alan Burnett, Paul Dini &amp; Glen Murakami) join moderator Jason Hillhouse for the last installment of their in-depth panel discussion\nClose-Up On...: Sit down with the creative minds behind Batman Beyond as they discuss their favorite moments from key episodes of the series' final season: &quot;Out of the Past&quot;; &quot;The Call, Part 1&quot;; &quot;The Call, Part 2&quot;; &quot;The Curse of Kobra, Part 1.&quot;","torrent":{"xt":"urn:btih:b1526d31bcd9e18faa686278eb5fd9a43315f05e","amp;dn":"Batman+Beyond+-+COMPLETE+%28NTSC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1526d31bcd9e18faa686278eb5fd9a43315f05e","infoHashBuffer":{"type":"Buffer","data":[177,82,109,49,188,217,225,143,170,104,98,120,235,95,217,164,51,21,240,94]},"announce":[],"urlList":[]}}