{"title":"Once We Had a Country - Robert McGill.epub","uid":9270053,"size":774328,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b19c4fd1e45cf3d42f9248c98deae7228fa06022&amp;dn=Once+We+Had+a+Country+-+Robert+McGill.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Mohammad_AT","files":1,"time":1385757510,"description":"A richly textured novel of idealism and romance, Once We Had a Country re-imagines the impact of the Vietnam War by way of the women and children who fled with the draft dodgers.\n\nIt's the summer of 1972. Maggie, a young schoolteacher, leaves the United States to settle with her boyfriend, Fletcher, on a farm near Niagara Falls. Fletcher is avoiding the Vietnam draft, but they've also come to Harroway with a loftier aim: to start a commune, work the land and create a new model for society. Hopes are high for life at Harroway; equally so for Maggie and Fletcher's budding relationship, heady as it is with passion, jealousy and uncertainty. As the summer passes, more people come to the farm--just not who Maggie and Fletcher expected. Then the US government announces the end of the draft, and Fletcher faces increasing pressure from his family to return home. At the same time, Maggie must deal with the recent disappearance of her father, a missionary, in the jungle of Laos. What happened in those days before her father vanished, and how will his life and actions affect Maggie's future? Once We Had a Country is a literary work of the highest order, a novel that re-imagines an era we thought we knew, and that compels us to consider our own belief systems and levels of tolerance.","torrent":{"xt":"urn:btih:b19c4fd1e45cf3d42f9248c98deae7228fa06022","amp;dn":"Once+We+Had+a+Country+-+Robert+McGill.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b19c4fd1e45cf3d42f9248c98deae7228fa06022","infoHashBuffer":{"type":"Buffer","data":[177,156,79,209,228,92,243,212,47,146,72,201,141,234,231,34,143,160,96,34]},"announce":[],"urlList":[]}}