{"title":"The Legend of Korra S04 NL Gesproken","uid":13255974,"size":2292535508,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b1c068b718e4469a975af381f5f516c6fab1ac3c&amp;dn=The+Legend+of+Korra+S04+NL+Gesproken&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jordiadr","files":10,"time":1453217254,"description":"The Legend of Korra Seizoen 4 Nederlands Gesproken\r\n\r\nOm de wereld te redden heeft Avatar Korra haar meest intense gevecht ooit doorstaan. Nu gaat ze op een drie jaar durende reis om haar wonden te laten helen en zichzelf te herontdekken. Zal Korra genezen en terug kunnen keren in haar rol als Avatar in Republic City?\r\n\r\nNA AL DIE JAREN - Drie jaar geleden heeft Zaheer Korra vergiftigd en de leden van Team Avatar gaan nu door met hun leven; Kai en Opal helpen een noodlijdend dorp in Earth Kingdom.\r\nKORRA ALLEEN - Korra’s drie jaar durende reis brengt haar naar veel onverwachte plaatsen.\r\nDE KRONING - Prins Wu’s grote dag wordt verpest door Kuvira; Korra denk dat ze het geheim voor herstel heeft gevonden.\r\nDE ROEP - Tenzin geeft Jinora, Ikki en Meelo de belangrijkste missie ooit – vind Korra.\r\nVIJAND VOOR DE POORTEN - Kuvira bedreigt Zaofu; Bolin staat middenin de onenigheid tussen Su Beifong en Kuvira.\r\nDE SLAG OM ZAOFU - Korra hervat haar rol als de Avatar, maar is ze er wel klaar voor? Bolin en Varrick breken met het leger van Kuvira.\r\nHERENIGD - Korra keert terug naar Republic City en Team Avatar begint aan hun eerste missie samen in drie jaar wanneer Prins Wu wordt vermist. Bolin en Varrick zijn op de vlucht","torrent":{"xt":"urn:btih:b1c068b718e4469a975af381f5f516c6fab1ac3c","amp;dn":"The+Legend+of+Korra+S04+NL+Gesproken","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1c068b718e4469a975af381f5f516c6fab1ac3c","infoHashBuffer":{"type":"Buffer","data":[177,192,104,183,24,228,70,154,151,90,243,129,245,245,22,198,250,177,172,60]},"announce":[],"urlList":[]}}