{"title":"Sexually Broken--Cute innocent Japanese girl BOXED!  Marica Hase","uid":8150046,"size":1545834958,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b26719f95f97201b3a3a2d1a59a4ba15634c5999&amp;dn=Sexually+Broken--Cute+innocent+Japanese+girl+BOXED%21++Marica+Hase&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1360975710,"description":"Cute innocent Japanese girl BOXED! Throat fucked, pussy fucked, CUM ripped from her helpless body | Marica Hase | Matt Williams\n\nFebruary 15, 2013 \n \n\nMP4 only.\n    \n \nSexually Broken is pleased to have Marica Hase in the house. This cute girl is all the rage back home in Japan, and now we have her helpless and cumming like a cute little Anime girl.\n\nMarica finds herself completely helpless in a custom made box that traps her arms behind her. The box is tightly screwed together, there will be no escape for our sexy Japanese girl. Stuck in a cage and boxed, Marica looks so innocent, we pull her out of the cage and hook her up to chains and pull her to her toes. She moans as we spread her legs and attack her little pussy with a vibrator. She struggles not to cum, she would be so humiliated if we made her cum. She fights but we make her cum and cum hard, she's lost this battle. For punishment we flog her perfect tight ass. It is obvious she likes it and embarrassed that we know she likes it.\n\nAfter making her cum a couple of times we take her down from the chains and attach her to the beam. We put her into a severe squatting position and with heavy L brackets screw her to the beam. She is now stuck to that beam until we let her out or time ends. With her cute face and pretty mouth at cock level, Marica knows what to expect next.\n\nWe find a nose hook and make our little Japanese girl even cuter. The nose hook pulls her mouth open and we slide our hard cock into her sweet mouth. We brutally fuck her pretty face, pushing the big cock all the way down her tiny throat. Throat boarding at it's best. Marica struggles with the big cock, so we add a vibrator to her pussy and make her cum over and over while she tries to cope with a skull fucking of epic proportions. \n\nWe unscrew Marica, place her on her back and spread her long legs with a spreader bar. We don't even need lube, our Japanese girl's pussy is dripping wet. The cock slides in and Marica is soon cumming yet again. We take turns fucking her hot pussy and tiny throat, back and forth we fuck Marica into subspace and beyond. We finger blast her to a squirting orgasm and leaves her with some form of liquid dripping out of every one of her holes. \n \nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_15mhase2/SexuallyBroken-Marica-Hase-Matt-Williams-Cute-innocent-Japanese-girl-BOXED-Throat-fucked-pussy-fucked-CUM-ripped-from-her-helpless-body.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_15mhase2/SexuallyBroken-Marica-Hase-Matt-Williams-Cute-innocent-Japanese-girl-BOXED-Throat-fucked-pussy-fucked-CUM-ripped-from-her-helpless-body.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:b26719f95f97201b3a3a2d1a59a4ba15634c5999","amp;dn":"Sexually+Broken--Cute+innocent+Japanese+girl+BOXED%21++Marica+Hase","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b26719f95f97201b3a3a2d1a59a4ba15634c5999","infoHashBuffer":{"type":"Buffer","data":[178,103,25,249,95,151,32,27,58,58,45,26,89,164,186,21,99,76,89,153]},"announce":[],"urlList":[]}}