{"title":"Sharp World Clock 6.41 [CRUDE][JUHAX69X]","uid":11580447,"size":9825721,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b26a9bd460de5883fcb499648b521acea6558462&amp;dn=Sharp+World+Clock+6.41+%5BCRUDE%5D%5BJUHAX69X%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUHAX69X","files":-1,"time":1417121599,"description":"Sharp World Clock 6.41 [CRUDE][JUHAX69X]\n \n \n \nDo you have friends, relatives or business partners all over the world or in different time zones?\nIs it important for you to know the exact time in the world - on the other side of the globe or in a different state or time zone of your own country? Is dealing with different time zones essential for your work as a manager, broker, stock trader or currency trader? Are you disappointed in slow, ad-cluttered online time services and want to try something better and more refined?\nHow would you like a state-of-the-art, fully customizable and elegant little international world time clock program for your Windows desktop? Look no further, you have come to the right place!\n \nSharp World Clock is probably the most sophisticated and beautiful time zone clock program for the Windows desktop, perfectly designed for the demanding private and business user.\n \n \nFeatures:\n \n- Clocks can be undocked from the main window (and docked again later).\n- You never need to update the daylight saving rules again. Windows time zone information are applied.\n- Clocks can be freely floating - no background any more! Background and clock face\ntransparency can be adjusted separately.\n- Clocks feature smooth shadows, like in the Vista clock (Windows Vista / 7 only).\n- Different clock hands (9 styles included for each hour/minute and second hand).\n- User definable presets in the design configuration - edit existing designs and add your own.\n- Editable, resizable numbers on the analog clock faces (you do not have to use background\nimages anymore if you want numbers).\n- Resizable country flags on clock faces.\n- Newly designed time zone calculator, with intuitive meeting scheduler.\n- Unlimited alarms with single / count-down / daily / weekly / monthly / annual / periodic alarms.\n- Separate (optional) date label additionaly to the time label.\n- Spoken time and read-aloud messages in the alarm center... and more!\n \n \n6.41 (September 29th, 2014):\n \n- Fixed the Configuration Assistant for some users who were having issues on Windows 8.1.\n- Added an option &quot;Keep on Screen&quot; in the settings (activated by default), which tries to keep all windows within the visible screen area Since a few users were having problems with this function, they can now deactivate it. Mainly for those users the next new feature is meant:\n- Added a menu item &quot;Center Clocks&quot; to the tray icon context menu: can be used if clocks are somehow out-of-reach.\n- The edit dialog is now a little larger, so the controls have more space.\n \nHomepage: programming[dot]de/worldclock.php\n \n \n \nCheck the &quot;Read Me&quot; file and the installation pics, of My own installation.\n \nVirustotal link from the patch, is in the &quot;Read Me&quot; file. Result: 100% clean.\n \n \nIf You like this upload, please share it with others by seeding.\n \nThank You","torrent":{"xt":"urn:btih:b26a9bd460de5883fcb499648b521acea6558462","amp;dn":"Sharp+World+Clock+6.41+%5BCRUDE%5D%5BJUHAX69X%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b26a9bd460de5883fcb499648b521acea6558462","infoHashBuffer":{"type":"Buffer","data":[178,106,155,212,96,222,88,131,252,180,153,100,139,82,26,206,166,85,132,98]},"announce":[],"urlList":[]}}