{"title":"Judy Garland in Concert Volume 1","uid":13729573,"size":357983238,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b3ca074e75522f83f2a8cff430a0d13c55857663&amp;dn=Judy+Garland+in+Concert+Volume+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":1,"time":1456995857,"description":"Judy Garland in Concert Volume 1 (Big Papi) VHSRip 1964\r\n\r\nBig Papi trying out some VHS to MP4 conversions.  This is concert is volume 1.  There is a volume 2 on the way so be sure top grab it.\r\n\r\nPer wikipedia\r\n\r\n[quote]Judy Garland (born Frances Ethel Gumm, June 10, 1922 – June 22, 1969) was an American singer, actress, and vaudevillian. She was renowned for her contralto vocals and attained international stardom which continued throughout a career that spanned more than 40 years as an actress in musical and dramatic roles, as a recording artist, and on concert stages.[1] Respected for her versatility, she received a Juvenile Academy Award and won a Golden Globe Award as well as a Special Tony Award. She was the first woman to win a Grammy for Album of the Year.\r\n\r\nGarland was nominated for the Academy Award for Best Actress for her role in the remake of A Star Is Born and for Best Supporting Actress for her performance in the 1961 film Judgment at Nuremberg. She remains the youngest recipient (at 39 years of age) of the Cecil B. DeMille Award for lifetime achievement in the motion picture industry.\r\n\r\nAfter appearing in vaudeville with her two older sisters, Garland was signed to Metro-Goldwyn-Mayer as a teenager. There, she made more than two dozen films, including nine with Mickey Rooney, and 1939's The Wizard of Oz. After 15 years, she was released from the studio and then gained new success through record-breaking concert appearances, including a return to acting, beginning with critically acclaimed performances.\r\n\r\nDespite her professional triumphs, Garland struggled immensely in her personal life, starting when she was a child. Her self-image was strongly influenced by film executives, who said she was unattractive and constantly manipulated her onscreen physical appearance.  She was plagued by financial instability, often owing hundreds of thousands of dollars in back taxes. She married five times, with her first four marriages ending in divorce. She also had a long battle with drugs and alcohol, which ultimately led to her death from a barbiturate overdose at the age of 47.\r\n\r\nIn 1997, Garland was posthumously awarded a Grammy Lifetime Achievement Award. Several of her recordings have been inducted into the Grammy Hall of Fame. In 1999, the American Film Institute placed her among the ten greatest female stars of classic American cinema.[/quote]\r\n\r\n[url=http://extraimago.com/image/aN0M][img]http://extraimago.com/images/2016/03/03/vlcsnap-2016-03-02-23h47m51s710.md.png[/img][/url]\r\n[url=http://extraimago.com/image/aN00][img]http://extraimago.com/images/2016/03/03/vlcsnap-2016-03-02-23h48m06s603.md.png[/img][/url]\r\n\r\n[url=http://extraimago.com/image/aN0B][img]http://extraimago.com/images/2016/03/03/vlcsnap-2016-03-02-23h48m38s645.md.png[/img][/url]\r\n[url=http://extraimago.com/image/aN0Y][img]http://extraimago.com/images/2016/03/03/vlcsnap-2016-03-02-23h50m59s620.md.png[/img][/url]","torrent":{"xt":"urn:btih:b3ca074e75522f83f2a8cff430a0d13c55857663","amp;dn":"Judy+Garland+in+Concert+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3ca074e75522f83f2a8cff430a0d13c55857663","infoHashBuffer":{"type":"Buffer","data":[179,202,7,78,117,82,47,131,242,168,207,244,48,160,209,60,85,133,118,99]},"announce":[],"urlList":[]}}