{"title":"Is Modern Israel a Fulfillment of Bible Prophecy","uid":5930020,"size":2245731916,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b4f2a460b2ee506db08398e6dfc87473f0a7aeb3&amp;dn=Is+Modern+Israel+a+Fulfillment+of+Bible+Prophecy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Porkster","files":-1,"time":1288741885,"description":"Israel: Rejected or Restored? Does modern Israel have a role in the End Times? Did God fulfill the Old Testament prophecies of the restoration of Israel with Ezra, Nehemiah, and the early church, or have we seen them come to pass in recent decades? Many Christians believe that the creation of the modern state of Israel in 1948 fulfilled Old Testament prophecy and heralded the imminent return of Christ. But what does the Bible mean when it talks about the &quot;restoration&quot; of Israel? And what happens to the identity of God's people and the entire fabric of Bible prophecy when modern Israel becomes the subject of the Old Testament prophets? Jim Fletcher: Arguing in the Affirmative Author of It's the End of the World As We Know It, speaker Jim Fletcher is the director of Prophecy Matters, Master Books, and the Icon Publishing Group. Drawing heavily from 20th century Israeli history, the Zionist movement, several Old Testament passages, and his own personal experience in Israel, Fletcher argues that God's support of the modern state of Israel as the restored kingdom foretold in the prophets is indisputable. Approximately 30 minutes in length. Gary DeMar: Arguing in the Negative In his opening statement, American Vision President Gary DeMar weaves a cohesive argument from scripture and history, demonstrating the fulfillment of Old Testament prophecies in times past, the misapplication of New Testament images by premillenial commentators, and the confusion that ensues when the modern Israel &quot;package deal&quot; is forced on the Scriptures. Approximately 30 minutes in length. Informal Discussion between the two views approximately 50 minutes in length. Includes two Bonus Lectures on Ezekiel 38 &amp; 39 by Gary DeMar (approximately 40 minutes each).\n\n\n(uploader's notes: I've also included the DeMar/Ice debate, The Great Tribulation: Past or Future, which is a youtube rip - http://www.youtube.com/watch?v=h3WrtZ_H7OU. Personally, I have found that both Preterism and Futurism are good at pointing out the errors in each other's doctrines while ignoring their own inconsistencies. And while I don't subscribe to either side, I believe that both sides are partially correct. Viewers may find DeMar's lecture explaining how the events in Ezekiel chapters 38 &amp; 39 have already transpired during the time of Esther to be very convincing. In other words, you probably won't be expecting Russia to invade Israel as a fulfillment of the Gog/Magog invasion anytime soon.)\n\n.ConspiracyHub Com\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n* Be part of Advanced Science\n* Go to site to request reseeding or to make discussion!\n* Copy Our Torrents To All 'Open' Trackers!!!\n\n","torrent":{"xt":"urn:btih:b4f2a460b2ee506db08398e6dfc87473f0a7aeb3","amp;dn":"Is+Modern+Israel+a+Fulfillment+of+Bible+Prophecy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4f2a460b2ee506db08398e6dfc87473f0a7aeb3","infoHashBuffer":{"type":"Buffer","data":[180,242,164,96,178,238,80,109,176,131,152,230,223,200,116,115,240,167,174,179]},"announce":[],"urlList":[]}}