{"title":"Lincoln Child - Terminal Freeze - Unb","uid":4740133,"size":296852728,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b5df793cafd70486e3010a1b0097f407237a6a4e&amp;dn=Lincoln+Child+-+Terminal+Freeze+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RamJamSam","files":21,"time":1235509288,"description":"Lincoln Child - Terminal Freeze - Unb\nRead by:  Scott Brick\nRuntime:  10 Hours and 17 Minutes\n\n\n\n\nA breathtaking discovery at the top of the world...\nA terrifying collision between modern science and Native American legend . . . \nAn electrifying new thriller from New York Times best-selling author Lincoln Child.\n\n\n\nTwo hundred miles north of the Arctic Circle lies Alaska's Federal Wildlife Zone, one of the most remote and inhospitable places on Earth. But for paleoecologist Evan Marshall and a small group of fellow scientists, an expedition to the Zone represents a once-in-a-lifetime opportunity to study the effects of global warming. \n\nEverything about the expedition changes, however, with an astonishing find. On a routine exploration of a glacial ice cave, the group discovers an enormous ancient animal, encased in solid ice. The media conglomerate sponsoring their research immediately intervenes and arranges the ultimate spectacle: the creature will be cut from the ice, thawed, and revealed live on television. Despite dire warnings from the local Native American village, and the scientific concerns of Marshall and his team, the &quot;docudrama&quot; plows ahead...until the scientists make one more horrifying discovery. The beast is no regular specimen; it may be an ancient killing machine. And they may be premature in believing it dead.\n\nIn this riveting new thriller, Lincoln Child weaves together a stunning Arctic landscape, a terrifying mythic creature, and a pervasive mood of chaos and fear. With Terminal Freeze, Child demonstrates why he has become a major best-selling author, and why his novels electrify and enthrall so many.\n\n\n\n\nGooD SeeDinG!\n","torrent":{"xt":"urn:btih:b5df793cafd70486e3010a1b0097f407237a6a4e","amp;dn":"Lincoln+Child+-+Terminal+Freeze+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5df793cafd70486e3010a1b0097f407237a6a4e","infoHashBuffer":{"type":"Buffer","data":[181,223,121,60,175,215,4,134,227,1,10,27,0,151,244,7,35,122,106,78]},"announce":[],"urlList":[]}}