{"title":"Finding Life Beyond Trauma: Using Acceptance and Commitment Ther","uid":7226403,"size":5532282,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b694c332bb0e96f9ff28686fdfc2fb3c5d59717f&amp;dn=Finding+Life+Beyond+Trauma%3A+Using+Acceptance+and+Commitment+Ther&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spr0ut1ng","files":-1,"time":1335693251,"description":"Hope this helps. May God bless and help you.\n\n\nIf you've experienced trauma-whether as a result of common life events like accidents or abusive personal relationships or extraordinary experiences like war or natural disasters-you may find that the pain and emotional unease you feel don't go away over time. In fact, they may get worse. But the trauma you experienced lies in the unchangeable past. Because of your strength and perseverance, you survived, and now the rest of your life stretches before you. How do you want to live it? Finding Life Beyond Trauma is about living life well after a traumatic event. It uses the powerful techniques of acceptance and commitment therapy (ACT) to help you take a different approach to painful feelings and chart a new course for a rich and meaningful life.\n\nFirst, you'll learn to accept the pain, sadness, and anxiety that can arise in connection to your trauma. By exploring mindfulness techniques, you'll be able to remain present with painful feeings and stop avoiding the thoughts and situations that bring them up. Instead of focusing on the past, you'll clarify what you want your life to be about right now and in the future. With your values clearly in mind, commit to actions that will express them in your life-guided by the powerful tools you'll find in this book.\n\n\n\n\n\nPLEASE SEED! so other people can benefit ","torrent":{"xt":"urn:btih:b694c332bb0e96f9ff28686fdfc2fb3c5d59717f","amp;dn":"Finding+Life+Beyond+Trauma%3A+Using+Acceptance+and+Commitment+Ther","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b694c332bb0e96f9ff28686fdfc2fb3c5d59717f","infoHashBuffer":{"type":"Buffer","data":[182,148,195,50,187,14,150,249,255,40,104,111,223,194,251,60,93,89,113,127]},"announce":[],"urlList":[]}}