{"title":"Origami_Facil_y_Divertido","uid":3762720,"size":29124025,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6e094cf1ee7eadb0677b3b393871d05f2fee4bd&amp;dn=Origami_Facil_y_Divertido&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darknest_1","files":1,"time":1186244702,"description":"Origami\nEl origen de la palabra procede de los vocablos japoneses &quot;oru&quot; (plegar) y &quot;kami&quot; que designa al papel. Pero ÃƒÂ©ste no ha sido su ÃƒÂºnico significado, ya que a travÃƒÂ©s del tiempo este arte ha tenido cambios en el nombre que lo identifica. En los primeros siglos de su existencia, se le llamaba Kami por el significado que se habÃƒÂ­a creado para papel, que en realidad es homÃƒÂ³nimo de la palabra que usan para los espÃƒÂ­ritus de los dioses. Pasaron los siglos y tomÃƒÂ³ el nombre de Orikata, que significa en espaÃƒÂ±ol &quot;ejercicios de doblado&quot;. No fue hasta 1880 que se desarrollÃƒÂ³ la palabra Origami a partir de las raÃƒÂ­ces &quot;Oru&quot; y &quot;Kami&quot;, antes mencionadas. Uno de los centros importantes en el gÃƒÂ©nero del origami es EspaÃƒÂ±a, en donde asignaron el vocablo papiroflexia al arte geomÃƒÂ©trico de hacer plegados para figuras en papel.\n\ncomo un arte educativo en el cual las personas desarrollan su expresiÃƒÂ³n artÃƒÂ­stica e intelectual. TambiÃƒÂ©n lo exponen como la esencia que se esconde tras los dedos de quienes pliegan papeles para darle nacimiento a innumerables figuras. La particularidad de esta tÃƒÂ©cnica es la transformaciÃƒÂ³n del papel en formas de distintos tamaÃƒÂ±o y simbologÃƒÂ­a, partiendo de una base inicial cuadrada o rectangular que pueden ir desde sencillos modelos hasta plegados de gran complejidad. Los sujetos preferidos para modelar son animales y otros elementos de la naturaleza como flores, ÃƒÂ¡rboles entre otros motivos.","torrent":{"xt":"urn:btih:b6e094cf1ee7eadb0677b3b393871d05f2fee4bd","amp;dn":"Origami_Facil_y_Divertido","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6e094cf1ee7eadb0677b3b393871d05f2fee4bd","infoHashBuffer":{"type":"Buffer","data":[182,224,148,207,30,231,234,219,6,119,179,179,147,135,29,5,242,254,228,189]},"announce":[],"urlList":[]}}