{"title":"Fashionable Technology: The Intersection of Design, Fashion, Sci","uid":8463397,"size":17542015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b814eeb3434d59e78e016b792a1bcdd56be574be&amp;dn=Fashionable+Technology%3A+The+Intersection+of+Design%2C+Fashion%2C+Sci&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ariane_c","files":1,"time":1368299202,"description":"Publisher: Springer Vienna Architecture (February 13, 2009)  PDF 249 pages\n\nThe interplay of electronic textiles and wearable technology, wearables for short, and fashion, design and science is a highly promising and topical subject. Offered here is a compact survey of the theory involved and an explanation of the role technology plays in a fabric or article of clothing. The practical application is explained in detail and numerous illustrations serve as clarification. Over 50 well-known designers, research institutes, companies and artists, among them Philips, Burton, MIT Media Lab, XS Labs, New York University, Hussein Chalayan, Cute Circuit or International Fashion Machines are introduced by means of their latest, often still unpublished, project, and a survey of their work to date. Given for the first time is a list of all the relevant information on research institutes, materials, publications etc. A must for all those wishing to know everything about fashionable technology.\n\nAbout the Author\n\nSabine Seymour received a Master of Social and Economic Sciences from the University of Economics in Vienna and Columbia University s MBA program in New York and an MPS in Interactive Telecommunications from NYU S Tisch School of the Arts.\nShe introduced the course &quot;Fashionable Technology&quot; and is a long standing faculty member at Parsons The New School For Design in New York and joined the University for Art and Industrial Design in Linz. She has taken part in numerous international congresses and events including Smart Fabrics, Ars Electronica Festival, Cooper Hewitt National Design Museum. She has also been a curator of pertinent exhibitions such as Our Cyborg Future: Me or Machine? Newcastle, UK, in 2007 and ISEA 2004 in Helsinki, Finland and Tallinn, Estonia.","torrent":{"xt":"urn:btih:b814eeb3434d59e78e016b792a1bcdd56be574be","amp;dn":"Fashionable+Technology%3A+The+Intersection+of+Design%2C+Fashion%2C+Sci","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b814eeb3434d59e78e016b792a1bcdd56be574be","infoHashBuffer":{"type":"Buffer","data":[184,20,238,179,67,77,89,231,142,1,107,121,42,27,205,213,107,229,116,190]},"announce":[],"urlList":[]}}