{"title":"Disney Cartoon - The Wuzzles - Complete Series","uid":4511525,"size":2936267897,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b95a177af99f2d9774e923c616e595588ba6f6e4&amp;dn=Disney+Cartoon+-+The+Wuzzles+-+Complete+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"cowboy23","files":14,"time":1226793803,"description":"\nThis is one of the lesser known cartoon series&amp;#039; produced by Disney in the 80&amp;#039;s, probably because it only lasted one season. Have fond memories of watching this when I was young, maybe others will remember it as well. As far as quality I&amp;#039;d give these episodes an 8 out of 10. Enjoy\n\nSUMMARY\n\nThe Wuzzles is an American animated television series created for Saturday morning television, and was first broadcast on September 14, 1985 on CBS. An idea of Michael Eisner for his new Disney television animation studio, the Wuzzles are animal creatures composed of half of one animal and half of another. Only 13 episodes of The Wuzzles were produced, making it the shortest running animated series produced by Disney. More episodes were planned to be made, but they were never made due to the death of Bill Scott (the voice of Moosel). One season later, The Wuzzles moved to ABC (which was eventually sold to Disney) for reruns, and disappeared from network television after that.\n\nThe Wuzzles stars a variety of short, rounded animal characters (each called a Wuzzle). Each is a roughly even, and colorful, mix of two different animal species (as the theme song mentions, &quot;...livin&amp;#039; with a split personality&quot;), and all the characters sport wings on their backs. All of the Wuzzles live on the Isle of Wuz. Double species are not limited to the Wuzzles themselves. From the appleberries they eat to the telephonograph in the home, nearly everything on Wuz is mixed together in the same way the Wuzzles are.\n\nThe characters in the show were marketed extensively. The characters were featured in children&amp;#039;s books, as plush toys, and in a board game.\n\nDisney premiered two animated series on the same day, The Wuzzles and Disney&amp;#039;s Adventures of the Gummi Bears, but on different networks. The Wuzzles was on CBS, and Gummi Bears was on NBC. Although Gummi Bears was a successful series, The Wuzzles was not, at least in the US. The Wuzzles did not build ratings momentum there. However, it does have a fan base today. It was a much bigger success in the United Kingdom where it pilot episode aired as a theatrical featurette","torrent":{"xt":"urn:btih:b95a177af99f2d9774e923c616e595588ba6f6e4","amp;dn":"Disney+Cartoon+-+The+Wuzzles+-+Complete+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b95a177af99f2d9774e923c616e595588ba6f6e4","infoHashBuffer":{"type":"Buffer","data":[185,90,23,122,249,159,45,151,116,233,35,198,22,229,149,88,139,166,246,228]},"announce":[],"urlList":[]}}