{"title":"Lucille Bogan - Complete Recordings 1923-1935, Vols. 1,2,3","uid":4789026,"size":198316779,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b9f77a9c8ac33cac9e379bdbd643caed5616ee78&amp;dn=Lucille+Bogan+-+Complete+Recordings+1923-1935%2C+Vols.+1%2C2%2C3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beoram","files":-1,"time":1237650212,"description":"COMPLETE RECORDINGS 1923-1935 [Document Records]:\n\nVOL 1 (1923-1930):\n    01 - The pawn shop blues\n    02 - Lonesome daddy blues\n    03 - Chirpin` the blues\n    04 - Triflin` blues\n    05 - Don`t mean you no good blues\n    06 - Sweet Patunia\n    07 - Levee blues\n    08 - Kind Stella blues\n    09 - Jim Tampa blues\n    10 - War time man blues\n    11 - Cravin` whiskey blues\n    12 - Nice and kind blues\n    13 - Women won`t need no men\n    14 - Doggone wicked blues\n    15 - Oklahoma man blues\n    16 - New way blues\n    17 - Pay roll blues\n    18 - Coffee grindin` blues\n    19 - Pot hound blues\n    20 - My Georgia grind\n    21 - Whiskey selling woman\n\nVOL 2 (1930-1933):\n    01 - They ain`t walking no more\n    02 - Dirty treatin` blues\n    03 - Sloppy drunk blues\n    04 - Alley boogie\n    05 - Crawlin` lizard blues\n    06 - Struttin` my stuff\n    07 - Black angel blues\n    08 - Tricks ain`t walking no more\n    09 - Red cross man\n    10 - T &amp; N O blues\n    11 - My baby come back\n    12 - Forty-two hundred blues\n    13 - Walkin` blues\n    14 - House top blues\n    15 - Baking powder blues\n    16 - Groceries on the shelf\n    17 - Seaboard blues\n    18 - Roll and rattler\n    19 - Superstitious blues\n    20 - Mean twister\n    21 - Troubled mind\n    22 - New Muscle Shoals blues\n\n\nVOL 3 (1934-1935):\n    01 - You got to die some day\n    02 - Lonesome midnight blues\n    03 - Boogan ways blues\n    04 - My man is boogan me\n    05 - Pig iron Sally\n    06 - I hate that train called the M. and O.\n    07 - Drinking blues\n    08 - Tired as I can be\n    09 - Sweet man, sweet man\n    10 - Reckless woman\n    11 - Down in Boogie Alley\n    12 - Changed ways blues\n    13 - Bo-easy blues\n    14 - That`s what my baby likes\n    15 - Shave `em dry (take 1)\n    16 - Shave `em dry (take 2)\n    17 - Shave `em dry (alt. tk.)\n    18 - Barbecue Bess\n    19 - B.D. woman`s blues\n    20 - Jump steady daddy\n    21 - Man stealer blues\n    22 - Stew meat blues\n    23 - Skin game blues\n\n\nBessie Jackson was a pseudonym of Lucille Bogan, a classic female blues artist from the '20s and '30s. Her outspoken lyrics deal with sexuality in a manner that manages to raise eyebrows even within a genre that is about as nasty as recorded music ever got prior to the emergence of artists such as 2 Live Crew or Ludacris. The name change seems to be quite different in her case than the usual pattern among blues artists who recorded under other names simply to make an end run around pre-existing recording contracts. Jackson/Bogan seemed to be looking for something more substantial, in that she not only changed her name but her performance style as well, and never recorded again under the name of Lucille Bogan once the Jackson persona had emerged. This was despite having enjoyed a hit record in the so-called &quot;race market&quot; in 1927 with the song &quot;Sweet Petunia&quot; as Bogan, but perhaps this was a scent she was trying to hide from.\n\nThis performer came out of the extremely active blues scene of Birmingham, AL, in the '20s. She was born Lucille Anderson in Mississippi, picking up Bogan as a married name. She was the aunt of pianist and trumpet player Thomas &quot;Big Music&quot; Anderson. Bogan made her first recordings of the tunes &quot;Lonesome Daddy Blues&quot; and &quot;Pawnshop Blues,&quot; in 1923, in New York City for the OKeh label. Despite the blues references in the titles, these were more vaudeville numbers. She moved to Chicago a year or two later and developed a huge following in the Windy City, before relocating to New York City in the early '30s, where she began a long collaborative relationship with pianist Walter Roland. This was the type of musical combination that many songwriters and singers only dream about; he was a perfect foil, knew what to play on the piano to bring out the best in her voice, and was such a sympathetic partner that it is hard to know where her ideas start and his end, no matter what name she was using. The pair made more than 100 records together before Bogan stopped recording in 1935.\n\nOne of the most infamous of the Jackson sides is the song &quot;B.D. Woman's Blues,&quot; which 75 years later packs more of a punch than the lesbian-themed material of artists such as Holly Near or the Indigo Girls. &quot;B.D.&quot; was short for &quot;bull dykes,&quot; after all, and the blues singer lays it right on the line with the opening verse: &quot;Comin' a time/women ain't gonna need no men.&quot; Well, except for a good piano player such as Walter Roland or some of her other hotshot accompanists such as guitarists Tampa Red and Josh White, or banjo picker Papa Charlie Jackson. She herself gets an accordion credit on one early recording, quite unusual for this genre. Certainly one of Bogan's greatest talents was as a songwriter, and she copyrighted dozens of titles, many of them so original that other blues artists were forced to give credit where credit was due instead of whipping up &quot;matcher&quot; imitations as was more than norm. She still wrote songs during her later years living in California, and her final composition was &quot;Gonna Leave Town,&quot; which turned out to be quite a prophetic title. By the time Smokey Hogg cut the tune in 1949, Jackson really had left town, having passed away the previous year from coronary sclerosis. While the material of some artists from this period has become largely forgotten, this is hardly the case for her; Saffire: The Uppity Blues Women have recorded several of her songs, as has bandmember Ann Rabson on her solo projects, as well as the naughty novelty band the Asylum Street Spankers.\n\n- Eugene Chadbourne, All Music Guide\n\n","torrent":{"xt":"urn:btih:b9f77a9c8ac33cac9e379bdbd643caed5616ee78","amp;dn":"Lucille+Bogan+-+Complete+Recordings+1923-1935%2C+Vols.+1%2C2%2C3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9f77a9c8ac33cac9e379bdbd643caed5616ee78","infoHashBuffer":{"type":"Buffer","data":[185,247,122,156,138,195,60,172,158,55,155,219,214,67,202,237,86,22,238,120]},"announce":[],"urlList":[]}}