{"title":"The Complete Annotated Grateful Dead Lyrics by David Dodd","uid":13280799,"size":27119832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba7349f58c117de1cc3a553f74b8fb1e570995c1&amp;dn=The+Complete+Annotated+Grateful+Dead+Lyrics+by+David+Dodd&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"75skully","files":5,"time":1453487887,"description":"\nThe Annotated Grateful Dead Lyrics By David Dodd.\r\n1997-98 Research Associate, Music Dept., Univ. of Calif. at Santa Cruz\r\nThe opinions expressed are those of the author, not of the University of California) Notes and essays © 1995-2007 David Dodd, or by their authors. \r\nAll Grateful Dead lyrics © Ice Nine Publishing. Copyright Notice.\r\n\r\n\r\n\r\nDedicated to the Memory of Jerry Garcia.\r\n\r\n\r\nIntroduction to the Project:\r\n\r\n\r\nThis book/website provides footnotes for Grateful Dead song lyrics. The standard procedure will be to provide links for words or phrases which might benefit from some elucidation, without attempting to give definitive &quot;interpretations,&quot; \r\nsince that's a very personal endeavor.\r\n\r\nAs appropriate, some lyrics will include an analysis section, which will provide technical information on the lyric's construction, and some potential avenues for interpretation. I actively encourage anyone with differing interpretations to send them to me via the links provided in each song's pages.\r\n\r\nWithin each lyric's pages, some links will be to footnotes within that page, and some to sites outside of this website. That's the fun of it, I think. Some of the links are to commercial databases; this is not meant as an endorsement.\r\n\r\nThe scope of the project will be limited to lyrics of original songs performed by the Grateful Dead. The covers have been more than adequately covered by Blair Jackson in his columns on &quot;Roots&quot; in The Golden Road, which have been collected into a chapter of his book: Goin' Down the Road: a Grateful Dead Travelling Companion.. For a web site on the covers, see Randy Jackson's excellent Roots of the Grateful Dead. Additionally, Mike Carver is making an effort to collect annotations for songs which appeared in rec.music.gdead at his site.\r\n\r\nEnjoy the ride!","torrent":{"xt":"urn:btih:ba7349f58c117de1cc3a553f74b8fb1e570995c1","amp;dn":"The+Complete+Annotated+Grateful+Dead+Lyrics+by+David+Dodd","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba7349f58c117de1cc3a553f74b8fb1e570995c1","infoHashBuffer":{"type":"Buffer","data":[186,115,73,245,140,17,125,225,204,58,85,63,116,184,251,30,87,9,149,193]},"announce":[],"urlList":[]}}