{"title":"[SoM]Un giorno perfetto[DvdRip-XviD-Ita-Mp3]","uid":4625438,"size":730324992,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc095c37fb9da6aa37d54aa7555f4888b90689a4&amp;dn=%5BSoM%5DUn+giorno+perfetto%5BDvdRip-XviD-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1231192907,"description":"Emma e Antonio, sposati con due figli, sono separati da circa un anno. Antonio vive da solo nella casa dove avevano abitato insieme, Emma ÃƒÂ¨ andata a stare da sua madre coi bambini. Poi, una notte qualunque, una volante viene chiamata nel palazzo e la polizia si accinge a fare irruzione nell'appartamento dove qualcuno dice di aver sentito degli spari. &quot;Un giorno perfetto&quot;, in un serrato rincorrersi di avvenimenti racconta le ventiquattro ore che precedono questo momento, la vita semplice eppure &quot;unica&quot; di un gruppo di personaggi pedinati passo passo: Camilla compie sette anni, suo fratello Aris fa un esame all'universitÃƒÂ , Emma perde il lavoro in un call-center, sua figlia Valentina incontra un ragazzo che le piace, l'Onorevole Elio Fioravanti ÃƒÂ¨ in giro per comizi elettorali, la sua bella moglie Maja scopre di essere incinta, il piccolo Kevin viene invitato a una festa lussuosa, la professoressa Mara ha un appuntamento col suo amante - e Antonio vede la moglie per l'ultima volta. Le loro storie si incrociano sul grande palcoscenico di una Roma frenetica e inquietante, che sembra portare alla tragedia - anche se un minimo gesto, una sola parola, potrebbe deviare la traiettoria del destino. Un giorno perfetto racconta con ironia, commozione e pietÃƒÂ , una feroce storia d'amore, quella che separa e unisce Emma e Antonio. E mette in scena mondi diversi e lontani, che si incrociano come in un giallo inesorabile. Scorrono davanti ai nostri occhi le aule scolastiche e i bus affollati, le tangenziali di periferia e le strade del centro, i ricchi e i poveri, i privilegi e il precariato, le madri e i padri, i figli e le figlie, lungo un percorso che si addentra nei territori del presente, cercando di dare forma a una realtÃƒÂ  caotica, sfuggente, e sconosciuta.","torrent":{"xt":"urn:btih:bc095c37fb9da6aa37d54aa7555f4888b90689a4","amp;dn":"%5BSoM%5DUn+giorno+perfetto%5BDvdRip-XviD-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc095c37fb9da6aa37d54aa7555f4888b90689a4","infoHashBuffer":{"type":"Buffer","data":[188,9,92,55,251,157,166,170,55,213,74,167,85,95,72,136,185,6,137,164]},"announce":[],"urlList":[]}}