{"title":"Led Kaapana...Black Sand(2000)[FLAC]","uid":6477855,"size":412513807,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bcffc6e0c46b723471717aa6c52fd3f16100b17a&amp;dn=Led+Kaapana...Black+Sand%282000%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":18,"time":1308385309,"description":"[img]http://image.allmusic.com/00/amg/cov200/dre100/e180/e180350oqpf.jpg[/img][color=Green]Black Sand [2000] Dancing Cat / 38015[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 Punahoo Special -Kaapana 3:25 \n2 Koke'e -Kaapana 5:39 \n3 Ninipo Ho'onipo -Kaapana 5:11 \n4 Mokupuni Nui -Haugen 4:42 \n5 Aloha la No O Maui -Kaapana 5:03 \n6 Nui Papa -Noble, Poroi 4:46 \n7 Tue Hey -Kaapana 3:47 \n8 Kanaka Waiwai/O Maria -Almeida 6:16 \n9 Waiakanaio -Huddy 5:58 \n10 Highway to Hana -Kaapana 7:19 \n11 Salomila/New 'Opihi Moemoe -Traditional 3:08 \n12 Akaka Falls -Parker 5:04 \n13 Black Sand -Traditional 3:22 \n\nOn this album by the slack key legend Led Kaapana on George Winston's slack key-dedicated label Dancing Cat, Kaapana shows off some outstanding versatility, playing in some six different tunings as well as performing one tune on the autoharp. The album starts out with Fred Punahoa's signature song, &quot;Punahoa Special.&quot; Kaapana follows it up with a nice slow version of the more or less standard &quot;Koke'e&quot; and a song from the prolific Queen Liliuokalani, from when she was still a princess. A pair of songs then praise both the big island and Maui, respectively, and a pair of Tahitian songs show off another side of Kaapana's influences and likes. A couple of religious songs are played on the autoharp, showing some versatility in Kaapana's playing, and more standards and improvisations take turns filling the next few songs. The album finishes with a trio of powerful works, two of them duets. &quot;Salomila&quot; and &quot;New 'Opihi Moemoe&quot; are performed as duets by Kaapana and the renowned Leonard Kwan, showing off some outstanding work from both players. Kaapana then performs in duet with label founder Winston on piano, to somewhat lesser effect. The piano playing is good, but somewhat out of place, if not a little too strong for a duet with the light tone of the slack key. Finally, Kaapana finishes with &quot;Black Sand,&quot; in tribute to a beach near his old hometown. He's in his comfortable G-major tuning here, with a spunky bass quality backing up some picking that is quicker than many of the other tunes. The sound is still relaxed, but there's a mildly playful nostalgia present as well. For slack key albums, the Dancing Cat label is full of worthwhile listens, and this album certainly ranks among the best. Kaapana is a legend in his own right, although it should be noted that there are other players of equal ability. Pick it up for a good beginning example of slack key or a generally nice listen for the experienced slack key fan.\n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2011/01/08/2746/[/url]","torrent":{"xt":"urn:btih:bcffc6e0c46b723471717aa6c52fd3f16100b17a","amp;dn":"Led+Kaapana...Black+Sand%282000%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcffc6e0c46b723471717aa6c52fd3f16100b17a","infoHashBuffer":{"type":"Buffer","data":[188,255,198,224,196,107,114,52,113,113,122,166,197,47,211,241,97,0,177,122]},"announce":[],"urlList":[]}}