{"title":"Sexually Broken--Huge breasted blonde Alyssa Lynn restrained on","uid":12888865,"size":883964712,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:bd3ead7242a1d2b9085481777030e61424a2d5a2&amp;dn=Sexually+Broken--Huge+breasted+blonde+Alyssa+Lynn+restrained+on+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":1,"time":1449084280,"description":"Huge breasted blonde Alyssa Lynn restrained on a sybian and facefucked by BBC, multiple orgasms! | Alyssa Lynn | Matt Williams | Jack Hammer \r\n\r\nDecember 2, 2015\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nBusty cum slut throat trained on huge cock while cumming her brains out \r\n\r\nThey don’t get much better than Alyssa Lynn. It isn’t just that she is tan, blonde and sporting boobs the size of mountains. She honestly loves this stuff. This is not some bored starlet coasting through for a paycheck, this is a sexual athlete ready to be put thorough her paces. She can’t wait to get started, and frankly neither can we. Some BBC and a sybian should do the trick.\r\n\r\nBound on her back with her oiled flesh gleaming and those giant tits pointed towards the ceiling and a sybian bolted in place onto her shaved pussy, Alyssa is ready for the ride of her life. Which we dish out with vigor and great enthusiasm. The switch is flipped on, the world’s most powerful vibrator gets to work and we do as well. The set up is simple…facefuck her into next week as she cums her brains out over and over and over again.\r\n\r\nBack and forth we pass her head like a busty game of tetherball as Alyssa drools and goes crossed eyed. Huge black cock takes her face as she takes every inch without a whimper. Well, to be fair, there is some whimpering, but they are more whimpers of pleasure as she is throat trained. Alyssa is a sports car of sex doing what she was born to do. And she does it so very well.\r\n\r\nAlyssa is rode hard and put away wet, her sides heaving and her eyes clouded over. She and her eager holes met a sybian and two hard cocks. The tools and technology won but I don’t think Alyssa minded one bit. This one will definitely be back! \r\n\r\nScreens \nhttp://www.sexuallybroken.com/sexual/bondage/trailer.php?y=2015&amp;p=12_02alynn&amp;u=SexuallyBroken-Alyssa-Lynn-Matt-Williams-Jack-Hammer-Huge-breasted-blonde-Alyssa-Lynn-restrained-on-a-sybian-and-facefucked-by-BBC-multiple-orgasms\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:bd3ead7242a1d2b9085481777030e61424a2d5a2","amp;dn":"Sexually+Broken--Huge+breasted+blonde+Alyssa+Lynn+restrained+on+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd3ead7242a1d2b9085481777030e61424a2d5a2","infoHashBuffer":{"type":"Buffer","data":[189,62,173,114,66,161,210,185,8,84,129,119,112,48,230,20,36,162,213,162]},"announce":[],"urlList":[]}}