{"title":"Surfactant Science and Technology - Retrospects and Prospects","uid":14962469,"size":113579636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd650e35a604c5cbf4426e658c06a4dc58388a6a&amp;dn=Surfactant+Science+and+Technology+-+Retrospects+and+Prospects&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466162595,"description":"Surfactant Science and Technology - Retrospects and Prospects - Laurence S. Romsted (CRC, 2014).pdf\r\n\r\nISBN 978-1-4398-8296-2\r\n\r\nSurfactant research explores the forces responsible for surfactant assembly and the critical industrial, medical, and personal applications, including viscosity control, microelectronics, drug stabilization, drug delivery, cosmetics, enhanced oil recovery, and foods. Surfactant Science and Technology: Retrospects and Prospects, &quot;a Festschrift in honor of Dr. Kash Mittal,&quot; provides a broad perspective with chapters contributed by leaders in the fields of surfactant-based physical, organic, and materials chemistries. Many of the authors participated in a special symposium in Melbourne, Australia, honoring Kash Mittal’s 100th edited book at the 18th Surfactants in Solution (SIS) meeting. Each chapter provides an overview of a specific research area, with discussions on past, present, and future directions.\r\n\r\nThe book is divided into six parts. Part I reviews the evolution of theoretical models for surfactant self-assembly, and introduces a model for interpreting ion-specific effects on aggregate properties. Part II focuses on interactions of surfactant solutions with solid supports; uses contact angles to understand hydrophobic/hydrophilic changes in a lipid layer; uses surface tension to understand molecular arrangements at interfaces; reviews spreading phenomena; discusses pattern formation on solid surfaces; and applies tensiometry to probe flavor components of espresso. Part III discusses novel DNA-based materials, multifunctional poly(amino acid)s–based graft polymers for drug delivery, and polymeric surfactants for stabilizing suspensions and emulsions.\r\n\r\nPart IV introduces farm-based biosurfactants from natural products and &quot;greener&quot; biosurfactants from bacteria. Part V explores lyotropic liquid crystals and their applications in triggered drug release; microemulsion properties and controlled drug release; the role of hydrotopes in formulations and in enhancing solubilization in liquid crystals; the potential of ionic liquids to generate tunable and selective reaction media; and provides an overview of stimuli-responsive surfactants. Focusing on emulsions, Part VI reviews the design of emulsion properties for various commercial applications, the role of surfactants in the oil and gas industries, and surfactant mechanisms for soil removal via microemulsions and emulsification","torrent":{"xt":"urn:btih:bd650e35a604c5cbf4426e658c06a4dc58388a6a","amp;dn":"Surfactant+Science+and+Technology+-+Retrospects+and+Prospects","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd650e35a604c5cbf4426e658c06a4dc58388a6a","infoHashBuffer":{"type":"Buffer","data":[189,101,14,53,166,4,197,203,244,66,110,101,140,6,164,220,88,56,138,106]},"announce":[],"urlList":[]}}