{"title":"Gwar - Let Us Slay  (2nafish)","uid":5580317,"size":130529284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:be4a9e28058cb12a5d7c92c44a90468a414dd176&amp;dn=Gwar+-+Let+Us+Slay++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1274519543,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nLust in Space is the eleventh studio album by GWAR. It was released on August 18, 2009. It is their first album since returning to their old label Metal Blade Records. The album will also see the return of former bassist Casey Orr. Lust in Space debuted at #96 on the Billboard top 200 Charts and according to Blabbermouth it was GWAR's highest position reached for the debut of an album.\n\nThe cover is an homage/parody of the Kiss album Love Gun.\n\nThis time around, GWAR manages to steal a Scumdog ship and prepares to finally leave Earth; however, Cardinal Syn returns and plans an attack. GWAR then seeks the help of Zog, an old Scumdog commander who trained Oderus, to help them. However, it turns out that he's become nothing but old and homeless. GWAR eventually sets everything straight and leave Earth, promising to stop on tour, and keep us all up to date on their activities.\n\nThe album also introduces a new Destructo, Sawborg, who wields a sawblade arm and has another sawblade sticking out of his head. He is not mentioned on the album, except briefly in &quot;GWARnography&quot;.\n\nGWAR is a two-time Grammy Award-nominated Shock Rock band formed in Richmond, Virginia, in 1984. The band is best known for its elaborate sci-fi/horror film inspired costumes, raunchy obscene lyrics, and graphic stage performances which consist of humorous re-enactments of politically and morally taboo themes.\n\nThe band's characteristic costumes are generally made of foam latex, styrofoam, and hardened rubber. The costumes cover very little, with the rest of their bodies accentuated with makeup. They further their production in concert by spraying their audiences with fluids. Most of the fluids are made of water and powdered food coloring which, for the most part, flakes off or washes out easily. The thicker fluids are made from a clear seaweed  extract called carrageenan which is also used in ice cream and milkshakes. Gwar does not use syrups or stage blood because they dry solid and can damage the band's costumes. In concert, Gwar has been known occasionally to perform their encore without costumes.\n\nAnother trademark of Gwar's live show is their lampooning of celebrities and figures in current events. Targets of Gwar's humor have included O. J. Simpson, John Kerry, Mike Tyson, as well as every President since Ronald Reagan, Jerry Garcia, Osama Bin Laden, Michael Jackson, Steve Wilkos, Al Gore, John McCain, Hillary Clinton, Paris Hilton, Arnold Schwarzenegger, Adolf Hitler, Bernard Madoff, Jerry Springer and many others. The band also makes frequent references to political and historical figures, fantasy literature, and mythology. For instance, the song &quot;Whargoul&quot; makes reference to Minas Morgul as well as the eternal warrior of Michael Moorcock. Gwar also has many references to H. P. Lovecraft themes (Antarctica, Yig, Giant Penguins, Fleshy Insanities, etc.). In addition, the title of their fifth album Ragnarok comes from Norse mythology. They were nominated for two Grammys, one for Best Metal Performance &quot;S.F.W.&quot; and one for Best Long Form Music Video &quot;Phallus in Wonderland&quot;. The band also performed fire dancing until the character &quot;Slymenstra Hymen&quot; left the band.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:be4a9e28058cb12a5d7c92c44a90468a414dd176","amp;dn":"Gwar+-+Let+Us+Slay++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be4a9e28058cb12a5d7c92c44a90468a414dd176","infoHashBuffer":{"type":"Buffer","data":[190,74,158,40,5,140,177,42,93,124,146,196,74,144,70,138,65,77,209,118]},"announce":[],"urlList":[]}}