{"title":"Personality research TELL-ALL  (Michael Rizzo Chessman)","uid":6100514,"size":268800,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be6a20ba2cc8499b71e9a5d5626be423c119d010&amp;dn=Personality+research+TELL-ALL++%28Michael+Rizzo+Chessman%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1294947486,"description":"Have you ever considered that all it is that we think and do has long\nbeen researched by experts such as Dr Nowland of Texas and placed in \npublications that were long out of reach of most people for reasons of cost\nand serendipity?\n\nWhy do some people like third world cultures as equal to European? Why do some\npeople always nag - seeming to want to drive someone insane? Why are some people\nalways hateful? Why do politicians bosses and others seem to never accept a \ncompetent suggestion to really improve things? Why does your husband never seem to\nwant to protect you like in the old days - even when you know he should? Does\nhe think you should carry weights and now even hold open doors for his buddies\ntoo perhaps! Why does a child never seem to get a caring hug and be allowed to\ngrow up generously spirited as we once saw human wisdom as?\n\nAll this is answered in an e-book which will shock you in its effects upon\nthe earth soon, as all come to terms with its truth. You'll have yourself\nfigured out in only a few minutes reading the data and you'll be able to tell \nwhere everyone else is in the picture too!\n\nRead this short manual and you'll never again accept the wicked theory of\naffirmative action, multicultural bigotry or any other forms of unfairness - as \nthis theory that's been published indicates precisely what makes such minds tick as\nwould want to let OJ simpson off since they get to keep the rules and consider what to them is &quot;fair enough&quot; while teaching us how to live to &quot;con-serve their\nenvironment&quot; equally\n\nMichael Rizzo Chessman\n","torrent":{"xt":"urn:btih:be6a20ba2cc8499b71e9a5d5626be423c119d010","amp;dn":"Personality+research+TELL-ALL++%28Michael+Rizzo+Chessman%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be6a20ba2cc8499b71e9a5d5626be423c119d010","infoHashBuffer":{"type":"Buffer","data":[190,106,32,186,44,200,73,155,113,233,165,213,98,107,228,35,193,25,208,16]},"announce":[],"urlList":[]}}