{"title":"The Iliad - Richmond Lattimore (Audio Connoisseur/Audible)","uid":11231008,"size":319851624,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:becf15306bfc6176678de3414a29ddf8545dd435&amp;dn=The+Iliad+-+Richmond+Lattimore+%28Audio+Connoisseur%2FAudible%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Mousebelt","files":-1,"time":1413531139,"description":"The Iliad\nWritten by: Homer, Richmond Lattimore (translator)\nNarrated by: Charlton Griffin\nLength: 22 hrs and 11 mins \nUnabridged Audiobook\nRelease Date:01-15-09\nPublisher: Audio Connoisseur\n\nPublisher's Summary\n\nThe Iliad is one of the most enduring creations of Western Civilization and was originally written to be recited or chanted to the accompaniment of various instruments. Properly performed, this work today is just as meaningful, just as powerful and just as entertaining as it was in the ninth century B.C.,and it casts its spell upon modern listeners with the same raw intensity as it did upon the people of ancient times.\nAs you listen to this great work, you feel yourself to be in the presence of a grandeur that suffuses the very air. There is no question that the poet, whether his name was Homer or not, was one of the supreme artists of all time and all civilizations. But thiswonderful piece of poetry is not merely a catalog of events of the Trojan War. Specifically, the poem deals with the bitter dispute between Achilles and Agamemnon, and how the Greeks were almost destroyed by their hubris. Hovering about, the Olympian gods watch the unfolding events with keen interest, sometimes lending help and encouragement on one hand, or spreading fear and hatred on the other.\nThe Iliad is ultimately about the free will of man and his ability or failure to make rational choices in the face of conflict and chaos. Unlike the gods, menmust face death, which gives their decisions a spiritual meaning which is absent on Olympus. The great legacy of The Iliad is its shattering revelation of what it means to be human in the face of life's uncertainty and fleeting mortality.\n\n(P)2008 Audio Connoisseur","torrent":{"xt":"urn:btih:becf15306bfc6176678de3414a29ddf8545dd435","amp;dn":"The+Iliad+-+Richmond+Lattimore+%28Audio+Connoisseur%2FAudible%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"becf15306bfc6176678de3414a29ddf8545dd435","infoHashBuffer":{"type":"Buffer","data":[190,207,21,48,107,252,97,118,103,141,227,65,74,41,221,248,84,93,212,53]},"announce":[],"urlList":[]}}