{"title":"Venom - DVDR PAL (multisubs)","uid":7990050,"size":7596056576,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bf61dc100561eabd68c4c279b90e18a7066648ae&amp;dn=Venom+-+DVDR+PAL+%28multisubs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gunnsalius","files":-1,"time":1357393163,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0428251/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0428251/&lt;/a&gt;\n\n Eric and his Yankee teenage mates travel South by motorbike to a swampy backwater town in Louisiana, where Sean's father Ray lived, the local tow truck driver, who abandoned the then baby-boy and his mother. Ray recently died, while trying to rescue a voodoo witch and at her urging her trunk, which got opened and released the poisonous serpents possessed by the souls of truly evil sinners she trapped in them. Ray was bitten and possessed as the car sunk, and shortly after it's dragged out rises as an 'undead' zombie, who murders without provocation and is immune to lethal weapons. He soon finds the teens' trace and proves his indiscriminately evil blood-thirst by charging his only offspring equally lethally. However they were warned by Eden's friend Cece, the witch's granddaughter, who explained the situation in her home and assures them when the zombie attacks it's safe thanks to a 'blessed' spell preventing evil from entering; alas the chain- and crowbar-waving undead finds a way round that: drag them out of it and make it fall apart. After the boys prove too brave and loyal for their own good, only Eden escapes alive, and the battle-site is moved to the tomb where the voodoo evil resides in a sarcophagus for their fight to the (un)death while she sort of learns enough voodoo by trial and error...\n\nAudio: English, France, Dutch, Spanish.\nSubs.: English, Icelandic, France, Dutch, Spanish, Norwegian, Danish, Swedish, \n       Finnish, Portuguese, Belgian, Slovenian, Turkish, Arabic, Latvian, Lithuanian,\n       Estonian.\n\nPlease seed after downloading...","torrent":{"xt":"urn:btih:bf61dc100561eabd68c4c279b90e18a7066648ae","amp;dn":"Venom+-+DVDR+PAL+%28multisubs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf61dc100561eabd68c4c279b90e18a7066648ae","infoHashBuffer":{"type":"Buffer","data":[191,97,220,16,5,97,234,189,104,196,194,121,185,14,24,167,6,102,72,174]},"announce":[],"urlList":[]}}