{"title":"Industrial Applications of Batteries {BBS}","uid":6720544,"size":103121661,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf754b2beb37e1d6be817f7cb4465b55f468b596&amp;dn=Industrial+Applications+of+Batteries+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317775619,"description":"Industrial Applications of Batteries looks at both the applications and the batteries and covers the relevant scientific and technological features. Presenting large batteries for stationary applications, e.g. energy storage, and also batteries for hybrid vehicles or different tools. The important aerospace field is covered both in connection with satellites and space missions. Examples of applications include, telecommunications, uninterruptible power supplies, systems for safety/alarms, car accessories, toll collection, asset tracking systems, medical equipment, and oil drilling.\nThe first chapter on applications deals with electric and hybrid vehicles. Four chapters are devoted to stationary applications, i.e. energy storage (from the electric grid or solar/wind energy), load levelling, telecommunications, uninterruptible power supplies, back-up for safety/alarms. Battery management by intelligent systems and prediction of battery life are dealt with in a dedicated chapter. The topic of used battery collection and recycling, with the description of specific treatments for the different systems, is also extensively treated in view of its environmental relevance. Finally, the world market of these batteries is presented, with detailed figures for the various applications.\n\n* Updated and full overview of the power sources for industries\n* Written by leading scientists in their fields\n* Well balanced in terms of scientific and technical information\nProduct Details\n\n    * Hardcover: 792 pages\n    * Publisher: Elsevier Science (April 10, 2007)\n    * Language: English\n    * ISBN-10: 0444521607\n    * ISBN-13: 978-0444521606","torrent":{"xt":"urn:btih:bf754b2beb37e1d6be817f7cb4465b55f468b596","amp;dn":"Industrial+Applications+of+Batteries+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf754b2beb37e1d6be817f7cb4465b55f468b596","infoHashBuffer":{"type":"Buffer","data":[191,117,75,43,235,55,225,214,190,129,127,124,180,70,91,85,244,104,181,150]},"announce":[],"urlList":[]}}