{"title":"White House Down (Cinavia removed","uid":10610973,"size":2098461073,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:bfdf62bfcad278dde4c31270022eece5cc43ac36&amp;dn=White+House+Down+%28Cinavia+removed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fantom87","files":-1,"time":1405990163,"description":"Originally uploaded by YIFY, I've taken the liberty of removing the Cinavia copy protection for all to enjoy how they please!\n\nA devoted father fights a ruthless paramilitary group that has seized control the White House in this high-stakes action thriller from director Roland Emmerich (2012) and writer James Vanderbilt (The Amazing Spider-Man). Dejected after being turned down for a position with the Secret Service but unable to break the news to his adoring daughter, Capitol policeman John Cale (Channing Tatum) is taking her on a tour of the White House when a powerful explosion rips through the building, sparking mass chaos. When the smoke clears, Cale learns that heavily armed rebels have taken both his daughter (Joey King) and the president (Jamie Foxx) hostage. As news of the attack creates mass panic and fear of total collapse, Cale realizes that the fate of his daughter, the Commander in Chief, and the entire nation rest in his willingness to fight back against the terrorists who have brought the most powerful nation on the planet to its knees. Maggie Gyllenhaal, Jason Clarke, Richard Jenkins, and James Woods co-star.\n\nResolution: 1920 x 802","torrent":{"xt":"urn:btih:bfdf62bfcad278dde4c31270022eece5cc43ac36","amp;dn":"White+House+Down+%28Cinavia+removed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfdf62bfcad278dde4c31270022eece5cc43ac36","infoHashBuffer":{"type":"Buffer","data":[191,223,98,191,202,210,120,221,228,195,18,112,2,46,236,229,204,67,172,54]},"announce":[],"urlList":[]}}