{"title":"[Ebook-Ita-Fantasy-Pdf]Christopher Paolini - Eldest[survivalofmi","uid":5152033,"size":2803347,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c06f94c5814ba7a0f0983ba741a4694e5fff5090&amp;dn=%5BEbook-Ita-Fantasy-Pdf%5DChristopher+Paolini+-+Eldest%5Bsurvivalofmi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1257617317,"description":"\n\nProsegue il viaggio di Eragon e del suo drago Saphira, dopo aver salvato la cittÃƒÂ  dei Varden e dei nani, Tronjheim, dall'assalto dell' esercito di re Galbatorix. Ora Eragon deve mettersi in viaggio per raggiungere Ellesmera, la terra degli elfi, accompagnato dai fedeli amici Arya e Orik: solo cosÃƒÂ¬ proseguirÃƒÂ  l'apprendistato nell'arte della magia e della spada con Oromis e il suo drago Glaedr, ultimo cavaliere rimasto dopo la dipartita di Brom. Contemporaneamente a questo, Carvahall viene attaccata dai Ra'zac, che si accampano all'interno del piccolo villaggio. Roran, allora, guida gli abitanti di Carvahall contro i nemici. Vengono sconfitti, ma riescono a scappare e, dopo un lungo viaggio, riescono ad imbarcarsi su una nave, che li porta nell'accampamento dei Varden.\nA EllesmÃƒÂ¨ra, invece, Eragon scopre che Arya, di cui si innamora, ÃƒÂ¨ figlia della regina elfica Islanzadi. Dopo un lungo periodo di duro lavoro con Oromis, parte per andare in guerra ad aiutare i ribelli contro l'esercito di Galbatorix. Durante la battaglia ritrova l'amico Murtagh, precedentemente rapito ed ora anch'egli cavaliere, col suo drago rosso Castigo, fedele a Galbatorix; Eragon scopre di essere figlio del malvagio Morzan (il cavaliere che tradÃƒÂ¬ la sua stirpe) e fratello minore dello stesso Murtagh (detto perciÃƒÂ² Eldest in inglese, il primogenito). Alla fine di Eldest, Murtagh prenderÃƒÂ  Zar'roc da Eragon, dicendo che la spada di Morzan spetta al suo Eldest e non al figlio minore. A battaglia conclusa Eragon reincontra il cugino Roran, che nel frattempo ÃƒÂ¨ fuggito dai Ra'zac lasciando la cittÃƒÂ  natale Carvahall per cercare di salvare gli abitanti del villaggio dalle atroci\nsofferenze che avrebbero subito.\n","torrent":{"xt":"urn:btih:c06f94c5814ba7a0f0983ba741a4694e5fff5090","amp;dn":"%5BEbook-Ita-Fantasy-Pdf%5DChristopher+Paolini+-+Eldest%5Bsurvivalofmi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c06f94c5814ba7a0f0983ba741a4694e5fff5090","infoHashBuffer":{"type":"Buffer","data":[192,111,148,197,129,75,167,160,240,152,59,167,65,164,105,78,95,255,80,144]},"announce":[],"urlList":[]}}