{"title":"La masculinidad toxica - Sergio Sinay","uid":6933541,"size":7217814,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0aafa480e976995352e250446121bf81c6b1a1e&amp;dn=La+masculinidad+toxica+-+Sergio+Sinay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"galaxist","files":-1,"time":1325748477,"description":"La Masculinidad Toxica - Sergio Sinay\nUn paradigma que enferma a la sociedad y amenaza a las personas\n\nISBN: 9871222637\nIdioma: EspaÃƒÂ±ol\n\n[PDF, FullOCR &amp; Bookmarked]\n\nSinopsis\n\nÃ‚Â¿QuÃƒÂ© tienen en comÃƒÂºn la guerra, el desencuentro afectivo entre hombres y mujeres, la depredaciÃƒÂ³n del medio ambiente, la violencia en el deporte, la ausencia de una paternidad nutricia y orientadora, la corrupciÃƒÂ³n en la polÃƒÂ­tica, la economÃƒÂ­a deshumanizada, la epidemia de muertes en accidentes, la prostituciÃƒÂ³n y los negocios de ÃƒÂ©tica?\n\nTodos estos elementos que identifican al mundo en que vivimos son producto de un modelo masculino, que estÃƒÂ¡ plenamente vigente y es hegemÃƒÂ³nico, aunque algunas voces optimistas se apresuren a darlo por superado. Ese modelo se basa en la agresividad, el rendimiento, la fuerza y la anestesia emocional. En este trabajo, Sergio Sinay se propone demostrar de quÃƒÂ© manera ese paradigma actÃƒÂºa, se reproduce y afecta a las vidas de los hombres y de las mujeres en todos lo planos y mÃƒÂ¡s alla de lo imaginado.\n\nEl autor sostiene que es impostergable denunciar y transformar ese modelo, toma partido de un modo firme inflexible frente a una masculinidad que es tÃƒÂ³xica para todos y que perjudica nuestros vÃƒÂ­nculos, nuestros corazones y nuestras vidas y, por fin, hace un llamamiento urgente a los hombres para salir de ella antes de que sea tarde.\n\nEsta obra es el manifiesto personal de un especialista en la cuestiÃƒÂ³n masculina que, con un lenguaje claro y vibrante, con informaciÃƒÂ³n esclarecedora y con ejemplos incuestionables y cotidianos, propone un cambio necesario e impostergable.\n\n\nBiografÃƒÂ­a\n\nSergio Sinay naciÃƒÂ³ en Buenos Aires en 1947. Es un reconocido especialista y consultor en vÃƒÂ­nculos humanos. Sus ÃƒÂ¡reas de exploraciÃƒÂ³n incluyen las relaciones de pareja, la psicologÃƒÂ­a del varÃƒÂ³n, los lazos entre padres e hijos y las relaciones interpersonales en sus mÃƒÂºltiples formas y alcances. Tras una destacada trayectoria como periodista, en la que creÃƒÂ³ y dirigiÃƒÂ³ importantes medios en la Argentina y en el exterior, tuvo una intensa formaciÃƒÂ³n y prÃƒÂ¡ctica en Gestalt y autoasistencia psicolÃƒÂ³gica. Sus seminarios y conferencias son habituales en el paÃƒÂ­s, en MÃƒÂ©xico, Chile, Uruguay y EspaÃƒÂ±a, donde colabora con diversos e importantes medios e instituciones.\n\nFue ganador del Premio de Ensayo del diario La NaciÃƒÂ³n con su trabajo El varÃƒÂ³n contemporÃƒÂ¡neo ante el fin de siglo. Entre sus obras mÃƒÂ¡s destacadas figuran Vivir de a dos, Misterios masculinos que las mujeres no comprenden, Las condiciones del Buen Amor, Ser padre es cosa de hombres, Hombres en la dulce espera (hacia una paternidad creativa), El amor a los 40, GuÃƒÂ­a del hombre divorciado y Gestalt para principiantes.\nComo novelista ha descollado por sus novelas Ni un dÃƒÂ³lar partido por la mitad, Sombras de Broadway, Dale campeÃƒÂ³n y Es peligroso escribir de noche.\nSus obras se han traducido al inglÃƒÂ©s, francÃƒÂ©s, italiano y portuguÃƒÂ©s. ","torrent":{"xt":"urn:btih:c0aafa480e976995352e250446121bf81c6b1a1e","amp;dn":"La+masculinidad+toxica+-+Sergio+Sinay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0aafa480e976995352e250446121bf81c6b1a1e","infoHashBuffer":{"type":"Buffer","data":[192,170,250,72,14,151,105,149,53,46,37,4,70,18,27,248,28,107,26,30]},"announce":[],"urlList":[]}}