{"title":"Anders Jallai - Bilderbergmötet (Svensk Retail EPUB)","uid":12757791,"size":1983959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0c0d661118b3c579e5a86d527bd59ecff4de2db&amp;dn=Anders+Jallai+-+Bilderbergm%26ouml%3Btet+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1447472998,"description":"Författare: Anders Jallai\r\n       Titel: Bilderbergmötet (Anton Modin #4)\r\nUtgivningsår: 2013\r\n       Språk: Svenska\r\n        ISBN: 9789198131505\r\n\r\nEn internationell thriller som utspelar sig i det lilla fiskesamhället där konsekvenserna av händelserna under några dygn påverkar hela världen. Det är försommar i Stockholms skärgård. En svag bris drar in från havet. Det värmer efter en lång och kall vinter. Den f d operatören inom militära SSI, Anton Modin, har lagt av och dragit sig tillbaks för alltid - tror han - för att fiska eller bara ta det lugnt. Men något märkligt händer på hotellet i det lilla kustsamhället. Det fejas och fixas men ingen information slipper ut. Säpo syns på orten och även utländska säkerhetstjänster. Men det är först när Modin känner igen två israeliska säkerhetsagenter som han reagerar. Någonting mycket känsligt kommer äga rum på hotellet den här sommaren. Den hemlighetsfulla Bilderberggruppen håller ett toppmöte varje år. Det har fyra gånger tidigare hållits i Sverige. Förutom det spännande dramat får vi veta hur ett toppmöte med världens mäktigaste planeras och utförs i form av säkerhets-arrangemang, logistik och deltagare. Vad är det som planeras inom Bilderberggruppen som vi vanliga inte får ta del av? Bilderberggruppen som av många anses styra världen informellt. Är det en världsregering som skapas?\r\n\r\nBilderbergmötet är en fristående fortsättning på de tre tidigare böckerna om den före detta underrättelseoperatören Anton Modin","torrent":{"xt":"urn:btih:c0c0d661118b3c579e5a86d527bd59ecff4de2db","amp;dn":"Anders+Jallai+-+Bilderbergm%26ouml%3Btet+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c0d661118b3c579e5a86d527bd59ecff4de2db","infoHashBuffer":{"type":"Buffer","data":[192,192,214,97,17,139,60,87,158,90,134,213,39,189,89,236,255,77,226,219]},"announce":[],"urlList":[]}}