{"title":"DC.Seekers.of.the.Lost.Treasure.4of4.The.Great.Belzoni.XviD.AC3.","uid":6791460,"size":832347202,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c0f11577133d46148d62a014ea356b47f615529b&amp;dn=DC.Seekers.of.the.Lost.Treasure.4of4.The.Great.Belzoni.XviD.AC3.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DocFreak08","files":-1,"time":1320281382,"description":"Award-winning series following the stories of the world's greatest archaeological adventurers. This mini-series profiles the perils, struggles and triumphs of four of history's treasure seekers. In glass cases and dusty corners of great international museums of North America and Europe, thousands of their priceless relics &amp; treasures are displayed. All are fascinating in their own right for what they tell us of lost tribes, lost cultures, even lost civilizations. But the real stories are rarely told--the blood-stirring adventures of the travelers who braved swamp fever, cannibals, sandstorms &amp; other perils to capture the treasures. Michael Rockefeller; Lord Elgin; Giovanni Belzoni; and Edward Thompson were all men of guile &amp; daring in the tradition of Indiana Jones. They travelled to the ends of the Earth in search of archeological riches of ancient and exotic cultures. Includes staged re-enactments, interviews, personal journal accounts, original film footage and unpublished photography.\n\nNarrated by Jeremy Irons\nSeries Producer : Anthony Geffen\n\nProduced by Atlantic Productions for the Discovery Channel\n\nDiscovery Communications Inc. (1995)\n\n\n\nEpisode 4 : The Great Belzoni\n\nAt the time Napoleon began systematically stripping Egypt of its magnificent treasures, former Circus strongman Giovanni Belzoni found his purpose in life. Blessed with considerable engineering skills, the flamboyant showman was asked by the British consul in Cairo to outflank the French and secure what artifacts he could on behalf of England. With the aid of accomplished tomb robbers, he did so, becoming the first man ever to set eyes upon the extraordinary tomb of Sethi I in the Valley of the Kings and maneuver the labyrinths of the second exploits, which scholars had attempted to do for generations. He succeeded in lifting the seven-ton head of Ramses II onto a raft.\n\n\n\nTechnical Specs\n----------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2076 kbps\nVideo Resolution: 608x368\nVideo Aspect Ratio: 1.652:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 50:05.880\nNumber Of Parts: 4\nPart Size: 815 MB\nRipped by: DocFreak08\t","torrent":{"xt":"urn:btih:c0f11577133d46148d62a014ea356b47f615529b","amp;dn":"DC.Seekers.of.the.Lost.Treasure.4of4.The.Great.Belzoni.XviD.AC3.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0f11577133d46148d62a014ea356b47f615529b","infoHashBuffer":{"type":"Buffer","data":[192,241,21,119,19,61,70,20,141,98,160,20,234,53,107,71,246,21,82,155]},"announce":[],"urlList":[]}}