{"title":"Ashley Alban – She Will Own Your Wallet: Part 1 Ful","uid":15807270,"size":736416603,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c167cb90167f429c8a7554bc4868e58a4fa6f379&amp;dn=Ashley+Alban+%26ndash%3B+She+Will+Own+Your+Wallet%3A+Part+1+Ful&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"nItroxxx2","files":1,"time":1473570470,"description":"\n\r\n\r\nYoure feeling horny so you decide to try to find an escort. You find an ad for a girl that is really attractive and exchange a few emails with her. She agrees to come over your house. You know she wrote that she wasnt going to have sex during the initial meeting, but you feel like you can persuade her. When she arrives, you two chat and then she asks you what you would like to do. You tell her that you ideally want to fuck her. She laughs. You tell her that you can make it worth her while, and you offer extra money as an incentive. She just laughs again. She asks you if you really think that is a lot of money. No, she tells you, you will have to earn her by emptying your bank account.\r\n\r\nYou sit looking astounded. She tells you not to be surprised. Youre the one that contacted her to pay for sex. Obviously you cant fuck girls (at least not attractive ones) normally. Youre clearly a fucking loser. If youre going to pay for it, she is going to make sure you really pay for it. She tells you to send her money through the way she indicated in her emails. You transfer her some money. She laughs when she sees it. She asks if you know what that bought you. She flashes you one nipple for two seconds. Come on, dont you want to actually see her breasts? Pay your princess then.\r\n\r\nNOTE: This video is only Part 1. In the second 6 minute portion of the video, Ashley actually shows off her breasts and gives jack off instructions. If you want to cum, you have to buy Part 2.\r\n\r\nCategories: TEASE &amp; DENIAL, HUMILIATION, LAUGHING, BRAT GIRLS, ashley alban, findom, tease, femdom, domination, brat.\r\n\r\nFormat: mp4\r\nResolution: 1920 x 1080\r\nDuration: 00:07:15\r\nSize: 702 Mb","torrent":{"xt":"urn:btih:c167cb90167f429c8a7554bc4868e58a4fa6f379","amp;dn":"Ashley+Alban+%26ndash%3B+She+Will+Own+Your+Wallet%3A+Part+1+Ful","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c167cb90167f429c8a7554bc4868e58a4fa6f379","infoHashBuffer":{"type":"Buffer","data":[193,103,203,144,22,127,66,156,138,117,84,188,72,104,229,138,79,166,243,121]},"announce":[],"urlList":[]}}