{"title":"Hacking Exposed Web Applications, 3rd Edition {BBS}","uid":6698783,"size":7285080,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1ae164d3ae4a4876e47b631a76ca1bcf4c67340&amp;dn=Hacking+Exposed+Web+Applications%2C+3rd+Edition+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316880752,"description":"The latest Web app attacks and countermeasures from world-renowned practitioners\n\nProtect your Web applications from malicious attacks by mastering the weapons and thought processes of today's hacker. Written by recognized security practitioners and thought leaders, Hacking Exposed Web Applications, Third Edition is fully updated to cover new infiltration methods and countermeasures. Find out how to reinforce authentication and authorization, plug holes in Firefox and IE, reinforce against injection attacks, and secure Web 2.0 features. Integrating security into the Web development lifecycle (SDL) and into the broader enterprise information security program is also covered in this comprehensive resource.\n\n    * Get full details on the hacker's footprinting, scanning, and profiling tools, including SHODAN, Maltego, and OWASP DirBuster\n    * See new exploits of popular platforms like Sun Java System Web Server and Oracle WebLogic in operation\n    * Understand how attackers defeat commonly used Web authentication technologies\n    * See how real-world session attacks leak sensitive data and how to fortify your applications\n    * Learn the most devastating methods used in today's hacks, including SQL injection, XSS, XSRF, phishing, and XML injection techniques\n    * Find and fix vulnerabilities in ASP.NET, PHP, and J2EE execution environments\n    * Safety deploy XML, social networking, cloud computing, and Web 2.0 services\n    * Defend against RIA, Ajax, UGC, and browser-based, client-side exploits\n    * Implement scalable threat modeling, code review, application scanning, fuzzing, and security testing procedures\n\nAbout the Author\nJoel Scambray, CISSP, is co-founder and CEO of Consciere, provider of strategic security advisory services. He has worked in Internet security assessment and defense for nearly 15 years at Microsoft, Foundstone, Ernst &amp; Young, and other organizations. Joel is an internationally renowned speaker and author of multiple security books, including 12 editions in the Hacking Exposed series.\n\nVincent Liu, CISSP, is a managing partner at Stach &amp; Liu. He previously led the Attack &amp; Penetration and Reverse Engineering teams at Honeywell's Global Security group, was a consultant with the Ernst &amp; Young Advanced Security Centers, and was an analyst at the National Security Agency. Vincent speaks at industry conferences, including Black Hat, ToorCon, and Microsoft's BlueHat.\n\nCaleb Sima is CEO of Armorize Technologies, provider of integrated Web application security solutions. He founded SPI Dynamics, a Web security technology company, and was an early innovator at Internet Security Systems/IBM's elite X-Force team. Caleb presents at key industry conferences, such as RSA and Black Hat.\nProduct Details\n\n    * Paperback: 482 pages\n    * Publisher: McGraw-Hill Osborne Media; 3 edition (October 15, 2010)\n    * Language: English\n    * ISBN-10: 0071740643\n    * ISBN-13: 978-0071740647","torrent":{"xt":"urn:btih:c1ae164d3ae4a4876e47b631a76ca1bcf4c67340","amp;dn":"Hacking+Exposed+Web+Applications%2C+3rd+Edition+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1ae164d3ae4a4876e47b631a76ca1bcf4c67340","infoHashBuffer":{"type":"Buffer","data":[193,174,22,77,58,228,164,135,110,71,182,49,167,108,161,188,244,198,115,64]},"announce":[],"urlList":[]}}