{"title":"Hellblazer Vertigo","uid":13049122,"size":3572746004,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c1d02f5ba68ebacfb1057b66803cd6a3fce83c64&amp;dn=Hellblazer+Vertigo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jesusmystogan","files":219,"time":1450604511,"description":"COMIC EN ESPAÑOL\r\nHellblazer, también conocido como John Constantine: Hellblazer, era una serie de comic-books de terror para adultos, publicados originariamente en 1988 en Estados Unidos por la editorial DC Comics.\r\n\r\nHellblazer es una serie de estética gótica, oscura y opresiva. Su personaje principal y protagonista, John Constantine, es retratado como un hombre con conocimientos ocultistas que sobrevive en un mundo moderno, donde los conflictos entre la realidad, lo mágico, y lo sobrenatural, lo mantienen en tensión.\r\n\r\nLa serie mantenía una línea de expresión netamente británica, tanto en su humor como en sus problemáticas, por la cual se expresaban tópicos políticos y sociales tales como el racismo imperante en Reino Unido, o los problemas acaecidos con el auge del conservadurismo de Margaret Thatcher y otros gobernantes.\r\n\r\nJohn Constantine fue creado por el aclamado autor británico Alan Moore, apareciendo por primera vez como personaje secundario en la serie de cómics Swamp Thing, siendo ilustrado por Steve Bissette, John Totleben y Rick Veitch a mediados de la década de 1980. Para desarrollar el modelo inicial del personaje, Moore visualizó a Constantine con un look similar al del cantante y compositor inglés Sting.\r\n\r\nEn 1987, Alan Moore cedió a la petición de otros autores para crear una serie sobre el personaje y, con el título John Constantine: Hellblazer, se publica la primera historia sobre este &quot;detective de lo oculto&quot;. La primera etapa del cómic fue realizada por Jamie Delano como guionista, John Ridgway como dibujante y Dave McKean encargado de las portadas.\r\n\r\nAsimismo, además de Delano trabajaron en la serie escritores como Garth Ennis, Paul Jenkins, Warren Ellis, Darko Macan, Brian Azzarello, John Smith, Mike Carey y Denise Mina; y artistas como Mark Buckingham, Tim Bradstreet, Steve Dillon, Marcelo Frusin, Leonardo Manco y Sean Phillips.\r\n\r\nLa serie se publicó inicialmente como una serie regular de DC Comics pero a partir del número 63 (marzo de 1993) pasó a formar parte del sello Vertigo","torrent":{"xt":"urn:btih:c1d02f5ba68ebacfb1057b66803cd6a3fce83c64","amp;dn":"Hellblazer+Vertigo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1d02f5ba68ebacfb1057b66803cd6a3fce83c64","infoHashBuffer":{"type":"Buffer","data":[193,208,47,91,166,142,186,207,177,5,123,102,128,60,214,163,252,232,60,100]},"announce":[],"urlList":[]}}