{"title":"Aquaman v4 (001 - 057) (2003 - 2007)","uid":11005728,"size":714374768,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c1fe8b8e25c047ff26555f5d450730e8d6e9541a&amp;dn=Aquaman+v4+%28001+-+057%29+%282003+-+2007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"nemesis43","files":57,"time":1410230349,"description":"Aquaman v4 (001 - 057) (2003 - 2007)\n\n\nIn the aftermath of the JLA arc The Obsidian Age, Aquaman is hated by his former subjects and exiled from the life-giving ocean he once called home. But that doesn't mean his quest to protect the oceans of the world at any cost is over any time soon!This volume is very interesting. The Lady of the Lake is a central character for the first 12 issues. Other new characters are the sorcerer Hagen, Man-of-War, Sweeney and Mccaferety. Aquaman goes back to spending time at a Lighthouse. The Thirst is introduced as a villain in issue 5 and is known as the dark side to the Water Bearer. Issues 13 and 14 are stand alone issues. Both are very good, but issue 14 is awe inspiring and stands along with Aquaman 13 of the 2nd series as one of the very best Aquaman stories of all time. Issue 15 brings a new writer, Will Pfeifer and a new Storyline, SubDiego. The end of this run sees Atlantis destroyed by the Spectre (with an Infinite Crisis tie in). Mera is back in Aquaman's life, just as he is developing a relationship with a surface woman. Lorena Marquez becomes the new Aquagirl around issue 20 and Koryak is no longer exiled from Atlantis.","torrent":{"xt":"urn:btih:c1fe8b8e25c047ff26555f5d450730e8d6e9541a","amp;dn":"Aquaman+v4+%28001+-+057%29+%282003+-+2007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1fe8b8e25c047ff26555f5d450730e8d6e9541a","infoHashBuffer":{"type":"Buffer","data":[193,254,139,142,37,192,71,255,38,85,95,93,69,7,48,232,214,233,84,26]},"announce":[],"urlList":[]}}