{"title":"Right Said Fred - I'm Too Sexy  (2nafish)","uid":5672742,"size":105062404,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c2a7f1172cf49fb0fcd9a555e4afc8ed16114d84&amp;dn=Right+Said+Fred+-+I%5C%27m+Too+Sexy++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1278415807,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;I'm Too Sexy&quot; is a song by English trio Right Said Fred from their album Up. The single topped the American charts for three weeks in early 1992, after having peaked at number two inless than six months earlier.\n\nIn the UK, the song set a new record for the most weeks at number two without ever topping the chart, staying at number two for six weeks in a row while being famously held off the summit by Bryan Adams' &quot;(Everything I Do) I Do It For You&quot;, beating the previous record set by Ultravox's 1981 release &quot;Vienna&quot;, which stayed at number two for four weeks.\n\n&quot;I'm Too Sexy&quot; is sung from the point of view of a self-satisfied fashion model. The song's lyrics express (over)confidence that his personal level of sexiness makes him too sexy for numerous things, most notably his shirt. The song's instrumental break is based on the guitar riff in the Jimi Hendrix song &quot;Third Stone from the Sun&quot;.\n\nA new version of the song called &quot;I'm Too Sexy 2007&quot;, produced by the Tastemakers, was released in April 2007. Besides being an updated production it differs from the original version by no longer using &quot;Third Stone from the Sun&quot; in its instrumental break. A new video was released as well although there is also a version where the original song from 1992 is used with the updated video.\n\nThe re-release of the song was prompted by a &quot;Cleaner Close&quot; advertising campaign for Daz detergent. This featured both Fairbrass brothers and included a self-parody of the song called &quot;I'm too sexy for my whites&quot;. For this occasion they renamed the band &quot;White Said Fred&quot;.\n\nThe original song itself was rated #49 on &quot;It's the 50 Worst Songs Ever! Watch, Listen and Cringe!&quot; by Blender.\n\nThe band is considered a one-hit wonder in the United States, its only other charting U.S. single peaking at #76. However, &quot;I'm Too Sexy&quot; was just the act's first of several hits on thecharts, including the No. 1 single &quot;Deeply Dippy.&quot;\n\nRight Said Fred are an English pop  band, formed in 1989 by brothers Richard Fairbrass and Fred Fairbrass, later joined by their friend Rob Manzoli, all from East Grinstead. The group is named after a song of the same name which was a hit for Bernard Cribbins in 1962.\n\nUp is the debut album ofpop group Right Said Fred, released in 1992. The album contains the group's only United States Top 40 hit, &quot;I'm Too Sexy&quot;, which hit #1 on the Billboard Hot 100 for 3 weeks in February 1992. The album is Produced by TommyD\n\nCurrently, as of 2007, Up is the band's only U.S. album release. It reached #1 on the UK Albums Chart and is their only album to chart on the U.S. Billboard 200, peaking at a modest #46.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c2a7f1172cf49fb0fcd9a555e4afc8ed16114d84","amp;dn":"Right+Said+Fred+-+I%5C%27m+Too+Sexy++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a7f1172cf49fb0fcd9a555e4afc8ed16114d84","infoHashBuffer":{"type":"Buffer","data":[194,167,241,23,44,244,159,176,252,217,165,85,228,175,200,237,22,17,77,132]},"announce":[],"urlList":[]}}