{"title":"To Kill a Mockingbird (Mulligan, 1962) [DivX 3.11]","uid":4337438,"size":737626112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2a7e8963ccac606c245a9935caa271ec69166b0&amp;dn=To+Kill+a+Mockingbird+%28Mulligan%2C+1962%29+%5BDivX+3.11%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mesothorax","files":1,"time":1218397878,"description":"To Kill a Mockingbird\n\nis a 1962 drama film directed by Robert Mulligan and based on the novel of the same name by Harper Lee. The film stars Gregory Peck in the role of Atticus Finch. In 2007, it was ranked twenty-fifth on the American Film Institute&amp;#039;s 10th anniversary list of the greatest American movies of all time. Today, the film is in the public domain in the United States because of missing copyright indication.\n\nPlot\n\nThrough the eyes of &quot;Scout&quot; (Mary Badham), a feisty six-year-old tomboy, the story carries us on an odyssey through the fires of prejudice and injustice in 1932 Alabama. Presenting her tale first as a sweetly lulling reminiscence of events from her childhood, the narrator draws us near with stories of daring neighborhood exploits by Scout, her brother &quot;Jem&quot; (Phillip Alford), and their friend &quot;Dill&quot; (John Megna). Peopled with a cast of eccentrics, Maycomb finds itself the venue of the trial of Tom Robinson (Brock Peters), a young black man falsely accused of raping an ignorant white woman. Atticus Finch (Gregory Peck), Scout and Jem&amp;#039;s widower father and a deeply principled man, is appointed to defend Tom for whom a guilty verdict from an all-white jury is a foregone conclusion. Juxtaposed against the story of the trial is the children&amp;#039;s hit and run relationship with Boo Radley (Robert Duvall), a shut-in whom the children and Dill&amp;#039;s Aunt Stephanie suspect of insanity and whom no one has seen in recent history. Cigar-box treasures, found in the knot hole of a tree near the ramshackle Radley house, temper the children&amp;#039;s judgment of Boo. &quot;You never know someone,&quot; Atticus tells Scout, &quot;until you step inside their skin and walk around a little.&quot; But fear keeps them at a distance until one night, in streetlight and shadows, the children confront an evil born of ignorance and blind hatred and must somehow find their way home.","torrent":{"xt":"urn:btih:c2a7e8963ccac606c245a9935caa271ec69166b0","amp;dn":"To+Kill+a+Mockingbird+%28Mulligan%2C+1962%29+%5BDivX+3.11%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a7e8963ccac606c245a9935caa271ec69166b0","infoHashBuffer":{"type":"Buffer","data":[194,167,232,150,60,202,198,6,194,69,169,147,92,170,39,30,198,145,102,176]},"announce":[],"urlList":[]}}