{"title":"Charleys War","uid":4843811,"size":668643519,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c30cc649999aeb7aeca6924957af386a58d0bb73&amp;dn=Charleys+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Noobfish","files":20,"time":1239604876,"description":"&quot;Charley's War was British comic strip written by Pat Mills and drawn by Joe Colquhoun. It was originally published in Battle Picture Weekly from January 1979 to October 1985\n\nDescribed by Andrew Harrison as &quot;the greatest British comic strip ever created&quot;, Charley's War tells the story of an underage British soldier called Charley Bourne. Charley joins the British Army during World War I at the age of 16 (having lied about his age; the recruiting officers conveniently overlook the fact that Charley gives his date of birth on his application form as 1900), and is quickly thrust into the Battle of the Somme.\nThe strip follows Charley's life in the trenches and his experiences during the war. Colquhoun put a meticulous level of research in to the already well-researched scripts which Mills provided. The strip rarely flinched from providing an extremely frank portrayal of the horrors of war, so much so that in some later reprintings some of the artwork was censored. Mills added a political slant in the strip not seen in British war comics and avoided the standard heroics common in war comics generally.&quot;","torrent":{"xt":"urn:btih:c30cc649999aeb7aeca6924957af386a58d0bb73","amp;dn":"Charleys+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c30cc649999aeb7aeca6924957af386a58d0bb73","infoHashBuffer":{"type":"Buffer","data":[195,12,198,73,153,154,235,122,236,166,146,73,87,175,56,106,88,208,187,115]},"announce":[],"urlList":[]}}