{"title":"New Marvel I Like 4-18-12","uid":7196449,"size":118259963,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c332d11262cb6afdc2191bcae74558a2e73ec6e8&amp;dn=New+Marvel+I+Like+4-18-12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":8,"time":1334795033,"description":"These are the Marvel comics I got from the week beginning 4/18/2012.  These are not a complete list of what Marvel put out this week.  There are other torrents for that. There are 7 titles in this week's offering. All comics are either in CBR or CBZ format and are labelled individually.  Please do not share my descriptions or torrent ads with anyone without messaging me first.  If this torrent has no seeds please msg me privately.  I will be glad to reup anything that has no seeds.\n\n\nAmazing Spider-Man #684 (CBR 04/18/12)\n\nSpider-Man's globetrotting adventure against the Sinister Six moves to the Middle East for a face off against . . . the Sandman! In the past, Spidey's fought Sandman on beaches, in quarries, but never like this--how can web-head hope to defeat Sandman when he's controlling the Sahara Desert?! Special Guest Stars: Black Widow and Silver Sable.\n\nAvengers #25 (CBR 04/18/12)\n\nCaptain America has declared war on the X-Men. The shocking final storyline in the Brian Michael Bendis Avengers saga! \n\nAvengers vs. X-Men #2 (of 12) (CBR 04/18/12)\n\nAs the opening shot is fired, the Avengers storm the beach of Utopia, and the Phoenix draws ever nearer to Earth! But which side will Wolverine fight on? And what choice will Hope make that will change the direction and scope of the conflict dramatically?\n\nDefenders #5 (CBR 04/18/12)\n\nWho are the Nereid, and what secret are they keeping? How does Namor's history intertwine with . . . Captain Nemo? The mystery of the concordance engine grows!\n \nInvincible Iron Man #515 (CBR 04/18/12)\n\nA hero falls! Don't miss out on the stunning action in this very important issue!\n \nThunderbolts #173 (CBR 04/18/12)\n\nIt had to happen--Thunderbolts v. Thunderbolts! Years ago, in the wake of the world's battle with onslaught, the Thunderbolts were formed to protect a planet devoid of heroes--but they were villains in disguise!  Now, the 'Bolts of the modern day come crashing into their earliest days--and will make a decision that may destroy the Marvel U--or save it! Part 2 of 3! \n\nX-Men #27 (CBR 04/18/12)\n\nConcluding open contract, the story of the forgiven. The Marvel U's deadliest assassins have been sent after the forgiven . . . and are trying to kill Jubilee! Guest-starring Lady Bullseye, the Assassin's Guild, and Lord Deathstrike. \n\n","torrent":{"xt":"urn:btih:c332d11262cb6afdc2191bcae74558a2e73ec6e8","amp;dn":"New+Marvel+I+Like+4-18-12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c332d11262cb6afdc2191bcae74558a2e73ec6e8","infoHashBuffer":{"type":"Buffer","data":[195,50,209,18,98,203,106,253,194,25,27,202,231,69,88,162,231,62,198,232]},"announce":[],"urlList":[]}}