{"title":"MTCDC-NMC 41 DC from Spe-Stq (Minar) (joshua13","uid":6744356,"size":15001219429,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c421b2a5bfb6d039bc9503497d80566ef0a4b80b&amp;dn=MTCDC-NMC+41+DC+from+Spe-Stq+%28Minar%29+%28joshua13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"joshua13","files":-1,"time":1318626320,"description":"The More than Complete DC-Now More Completerer!\n\nThis fortieth alphabetical installment is: DC from Spe-Stq (Minus Star)\n\nWhat's This?\n     It's a project to upload everything that's been scanned that DC ever published or distributed, whatever name was on the cover. That's DC, Vertigo (ugghh!)Ã‚Â®, Wildstorm, Helix, Milestone, Minx, Paradox, Piranha, Tangent, America's Best Comics, Cliffhanger, CMX, Homage, Humanoids, and MC.Gaines among others.\n       Plus, for characters and titles DC picked up from other companies, as much of those &quot;Pre-DC&quot; comics as I can find. This includes many major and minor DC superheroes, war comics, romance comics and various licensed characters such as Tarzan, Star Trek, Loony Toons, Scooby-Doo etc. A few of the heros include Shazam!, Blue Beetle, Plastic Man, Gen13, The Web, The Shield, Phantom Lady, Captain Atom and many more. There may be a lot of things you didn't know started with a different company. There will some &quot;Post DC&quot; comics of characters like Fallen Angel that have moved on. But that will be arbitrarily selective on my part. Assorted related material will be included. It's going to be c.875-885gb in total. It will take as long as it takes. I've already done a 600+gb subset of this in an earlier project (MTCDC). So clearly, I'm insane, which is what you look for in a guy promising this. So here we go again, but bigger.\n\n=================================\n\nI have decided on the makeup the rest of the torrents - small changes are possible. I plan on 14 more. Most are 13-18gb. The Superman torrent will be around 35-38gb. The big Batman one was popular so I'll do the same with Superman.\n\n42 Star*\n43 Str-Supera\n44 Superb-Supq (Minus Superman(Space or Dash) - #44 WILL include titles that start with Superman's\n45 Superman\n46 Supr-Td\n47 Te-Tn\n48 To-Unk\n49 Unl-Waq\n50 War-Wn\n51 Wonder*\n52 World*\n53 Wo-Z (Minus Wonder, World)\n54 Fill Torent A-D\n55 Fill Tor\n\n=================================\n\nToday's offering:  DC from Spe-Stq (Minus Star)\n\nEnjoy!\n\nSpecial War Series 004-Judomaster (Charlton\n\nSpectre, The\n     The Spectre Chronology.txt\n     The Spectre v1 01-10 (1967-1969)\n     The Spectre v2 01-31 (1987-1989)\n     The Spectre v2 Annual 001-Deadman (1988)\n     The Spectre v3 000 (10-1994)\n     The Spectre v3 01-62 (1992-1998)\n     The Spectre v3 Annual 01-Year One (1995)\n     The Spectre v4 01-27 (2001-2003)\n\nSpeed Demon (Amalgam(04-1996)\nSpeed Force-Flash (1997)\n\nI find it a bit amazing that the original manga of this has not been scanned, at least not in english. Go Speed Racer, Go! Never watched it, never read it, never even knew it was a manga until recently.\n\nSpeed Racer (WS\n     Speed Racer 01-03 (WS(1999)\n\nSpeed Racer (Non DC\n     Speed Racer Mach Go Go Go v01-02 (Digital Manga Pub(2007)\n\nIDW\n     Speed Racer 01-04 (2007-2008)\n     Speed Racer-The Next Generation 01-02 (2009)\n\nNow\n     Speed Racer Special Edition 001 (09-1988)\n     Speed Racer v1 01-37 (1987-1990)\n     Speed Racer v2 003 (02-1994)\n     The New Adventures of Speed Racer 000 (Now(11-1993)\n\nSpelljammer 01-15 (1990-1991)\nSpider-Boy (Amalgam(04-1996)\nSpider-Boy Team-Up (Amalgam(06-1997)\nSpider-Man and Batman-Disordered Minds 51p\nSpiral Zone 01-04 (1987)\n\nThis is a real oddity. - But DC was behind it.  There were no more issues. You've probably never heard of it, my friends and I like it better than pop-magazines. We're way cooler  than you. You can tell I'm lying because I said I have friends\n\nSpirit World 001 (Hampshire Distributors(1971)\n\nThe Spirit is amazingly famous among &quot;comics folk&quot; but not so much in the world outside.  Will Eisner for whom the comics &quot;oscar&quot; was named (Eisner Award) drew this guy originally. Many newspapers used us to carry a special section of comics - the &quot;Spirit Section&quot;, many of which are included here, either in reprints or original newspaper scans. There is considerable overlap in the newspaper strip scans because I didn't want to spend the time to sort it all out and remove the duplicate strips. Then too, some of the reprints come with extras such as notes from the author.\n\nSpirit, The\n     The Spirit (DC\n     The Spirit Archive (R) color  23 of 26 volumes mostly remixes. This is reprints of the Spirt Section, so most are scanned without scanning these reprint volumes\n     The Spirit Special 001 (2009)\n     The Spirit v1 01-32 (2007-2009)\n     The Spirit v2 01-17 (2010-2011)\n\nThe Spirit (Non DC\n\nArticles about The Spirit\n     Captain George's Comic World 027 (1970)\n     Comic Geek Speak Best of the Spirit (Dennis Kitchen(2007-03-28).mp3\n     Comic Media 010\n\n     Great Classic Newspaper Comic Strips 004-Spirit 41-10-27 to 12-07\n     Heavy Metal v07 008-Has a Spirit Story (11-1983)\n     Help! v2 001-Eisner-Spirit Feature (02-1962)\n     Spirit Bag 01-04-Spirit Section Reprints (1972-1973)\n     The Daily Spirit 01-04 (Real Free Press(1975-1976)\n     The Spirit (Fiction House(1952-1953)\n\nFunny Paper Bookstore 01-04 (1977-1980)\n\nKitchen Sink\n     Outer Space Spirit TPB (1952)\n     Spirit E-H 'The Criminal' 'Spirit Interview' 'Ebony Interview' 'The Last Straw' (1973)\n     Spirit I 'The Capistrano Jewels' (1973)\n     Spirit Jam 48p (1998)\n     Spirit N 'Cerebus vs The Spirit' (1984)\n     The Spirit 3D Classics (1985)\n     The Spirit Magazine 16-41 (after Warren Spirit 16 (1977-1983)\n     The Spirit v2 01-82 (1983-1991)\n     The Spirit-The New Adventures 01-08 (1998)\n\nKitchen Sink 'Underground' Comics\n     The Christmas Spirit 01-02 (1994)\n     The Spirit 01-02-new material(1973)\n\nVital(1945)\n     The Spirit 002 (R)(1945)\n     The Spirit 003 (R)(1945)\n\nWarren\n     Comix International 005 (Warren(1977)\n     The Spirit Magazine 01-16 (Warren(1974-1976)\n     The Spirit Special ctc (Warren(1975)\n\nThe Spirit 01-02 (Harvey(1966)\nThe Spirit 01-02 (Real Adventures(1952)\nThe Spirit 01-22(i) (Quality(1946-1950\nThe Spirit 012 36p ctc (Super(1964)\nThe Spirit Covers\nThe Spirit Section-Newspaper scans\n\nThe Spirit checklist.rtf\nSpirit Checklist, The by Cat Yronwode (2001).pdf\nSpirit Stories.txt\nThe Spirit Check List 2009-01-08.xls\nThe Spirit-Comicology 003 (TwoMorrows(2000)\nWitzend 004-Dutch Edition (in english)Interview With Will Eisner(1972)\nreadme-spirit-project.txt\n\nSpitfire Comics 001-Fly-Man only (Canadian(1941)\nSpy Smasher 01-11 (Quality(1941-1943)\nMini Comics Spy Smasher 011 (1942)\nSpyboy &amp; Young Justice 01-03 (2002)\nStalker 01-04 (1975-1976)\n\nStanley and His Monster v1 109-112 v1 (After Fox and Crow 108\nStanley and His Monster v2 01-04 v2 (1993)\nStatic 01-45 (DC-Milestone\n\nStatic Shock (MIlestone,DC\n     Static Shock Special 001 (08-2011)\n     Static Shock v1 001 22p (2011)-web\n     Static Shock v1 001 24p (2011)-scan\n     Static Shock-Rebirth of the Cool v1 01-04 (DC-Milestone(2001)\n     Static Shock-Wednesday Afternoon-9-11 Tribute story (2002)\n\nSteampunk (WS-Cliffhanger\n     SteamPunk Idiosincratica-Ashcan (Cliffhanger(1999)\n     Steampunk 00-12 (2000-2002)\n     Steampunk-Catechism Prologue (01-2000)\n     Steampunk-Drama Obscura TPB (02-2003)\n     Steampunk-Manimatron TPB (03-2001)\n\nSteampunk Extras\n     Steampunk Alice In Wonderland.jpg\n \nNot a comic, don't know if it's any good, but if you like steam punk, give it a whirl, give it a try, a look-see, a chance, a once-over, a glance, send it up the flag pole and see if you salute, Or not.\n     Steampunk Tales 001.pdf  - \n\nYou probably don't need to like Steam Punk to like this item, but it would help if you like girls, Victorian or otherwise.  If there are any surviving Victorian ladies they are over 111 years old and that's counting babies born the day of her death. So I'll stick with the &quot;otherwise&quot; Meanwhile in japan apparently there is a growing interest in &quot;elder porn&quot;, No word on wether there is &quot;elderly octopus  porn&quot; or &quot;elderly schoolgirl porn&quot; (for the uninitiated - the regular schoolgirl pics are young-looking women dressed in school uniforms, not actual schoolgirls, though that surely exists in Japan too.) The octopi &amp; squid pics unfortunately are all too real. I try to be broadminded about such things, but the tentacle-porn (and related stuff) is one of the preferences I can't begin to understand and shudder to think of. Rule 34 is all very well and all that, but rule 34B adds &quot;You do NOT want to test this by looking&quot; \n\nI wonder if it is coincidence that Japan is an island heavily dependent on sea-food, or that they make octopus ice cream in Japan? \n\nWash those thought out with this, guys. You gals can find your own mind-wash, sorry. \n     Victorian Secret Girls of Steampunk 001 ctc (Antarctic Press(2011)\n\n======================\nNo one says gals anymore, and I wonder if this is in any way related to other gender related english word changes of the last 50 years or so. I really don't think so, since &quot;guys&quot; survived and became inclusive of females, whereas new terms were created for postman, garbage man, fireman etc. So I had to look up the origin of guy and gal. because I'm a bit of a word nerd, I've heard.  Seems gall is nothing more than an altered pronunciation of girl. Whereas guy derives of all things from &quot;Guy Fawkes&quot; -  the failed  political bomber/assassin/conspirator from a 1605 plot to kill the king of England. You may know of Guy Fawkes Day/Night . Originally a celebration of the King's escape from death, later just a party with some political overtones (or not), featuring burning of an effigy, originally the Pope, sometimes current political figures. Later the effigy was called a &quot;guy&quot;. I was deeply disappointed to learn that &quot;effigy&quot; did not come from the phrase &quot;eh, f***ing guy&quot;.\n\tGF himself shifted from villain to a bit of a buffoon (the plotters did fail, after all), to even an action hero in kids books. So at some point the British made  the verb &quot;to guy&quot; meaning &quot;make fun of, to ridicule&quot;. Somewhere in all there people started calling man a guy sometimes. Probably not a compliment. So now Im not sure I'll ever feel the same about being called a &quot;guy&quot; after this. I'm a MAN golly ding it! I demand more respect!\n\tWhy are the people at work making a sort of scarecrow that looks kind of like me? Hey! put down that match!\n======================\n\nSteel\nJust Steel. Pure Iron you know, is not as strong as Steel, so take that &quot;Iron Man&quot;!   Cast Iron as in &quot;Cast Iron Skillet&quot;, famed weapon of choice for angry wives in days gone by, is  actually carbon-steel with more carbon than usual. So maybe if he was &quot;Cast Iron Man&quot; he'd seem like less of a wimp.\n\nNow &quot;wrought iron&quot; has too little carbon to be called steel, so you might say &quot;Steel is over wrought&quot; but I wouldn't He's a bit sensitive on the subject.\n\n     Steel 000 (10-1994)\n     Steel v1 01-52 (1994-1998)\n     Steel v1 Annual 01-02 (1994-1995)\n     Steel v2 001-Reign of Doomsday-2 covers ctc (2011)\n     Steel-Official Comic Adaptation of the Movie (1997)\n     Steel-The Indestructible Man 01-05 (1978) (this folder name is misspelled in the torrent, but i already made the torrent file, and that's the way it shall be.)\n\nSteel Fist Riku v1 (2006)\n\nCovers only. Could not find. I found what might be a Korean language scan of this, but I don't know enough Korean to be sure.  I'd have to know more than none at all.\nStolen Hearts (Toraware Gokko) by Miku Sakamoto\n\nStorming Paradise 01-06 (WS(2009)\n\nSounds a lot like a weather team, or fans of the X-Men character. You can tell I've never read it. Why aren't they X-People or somethings. What is this, September 1963? As for me I like to watch storms and found Halle Berry quite pleasing to watch as Storm. She has such nice &quot;lightning bolts&quot;. nudge nudge, wink wink know what I mean?\n\nStormwatch (Image,WS,DC\n     StormWatch - Reading Order.txt\n     StormWatch 023 1/2-Wizard Supplement (WS-Image(1995)\n     Stormwatch PHD 01-24 (WS(2007-2010)\n     Stormwatch Sourcebook v1 001 (WS-Image(1994)\n     Stormwatch v1 00-50 (WS-Image(1993-1997)\n     Stormwatch v1 Special 01-02 (WS-Image(1993,1995)\n     Stormwatch v2 01-11 (WS-Image(1997-1998)\n     Stormwatch v2 Preview (WS-Image\n     Stormwatch v3 01-xx (DC(2011-20xx)\n     Stormwatch-A Finer World TPB (WS(2000)\n     Stormwatch-PHD Armageddon 001 (WS(2007)\n     Stormwatch-Team Achilles 01-23 (WS(2002-2004)\n\n\nThis is a children's book. I wouldn't include it but the list I use as  a reference for what's scanned of DC contains it. I decided when I began the original MTCDC that if it was in the list in was in this series. I didn't feel the need to include every cereal box someone scanned with Batman on it or the like. so I just let the list choose what of that kind of thing would be in. Of course anything I deem MTCDC worthy comes in wether this list has it or not.The list giveth, but the list doesn't taketh away.\n\nStory of Superman, The (Random House(1980)\n\n\n=====================================================================\n\nFeel free to post this to other sites if you know how and are so inclined\n\n========================================================================\n\nPlease Seed! Lots of people will start on the series months\nor even a year or two from now. You are their only hope to complete\ntheir downloads.\n\n=========================================================================\nThanks to the Scanners and editors, and thanks to the seeders, the\nanonymous folk that make the work of the scanners and uploaders multiply!\n=========================================================================\nUntil we once again don't actually meet,\n\nCordially,\n\n13\n\nYou can see my other torrents at \n\nd-e-m-o-n-o-id.me/files/?uid=1213225&amp;seeded=2\n\nor\n-h-3-3-t.com-/userdetails.php?id=72866\n\nor &lt;a href=&quot;\nhttp://thepiratebay.se/user/joshua13/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/joshua13/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c421b2a5bfb6d039bc9503497d80566ef0a4b80b","amp;dn":"MTCDC-NMC+41+DC+from+Spe-Stq+%28Minar%29+%28joshua13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c421b2a5bfb6d039bc9503497d80566ef0a4b80b","infoHashBuffer":{"type":"Buffer","data":[196,33,178,165,191,182,208,57,188,149,3,73,125,128,86,110,240,164,184,11]},"announce":[],"urlList":[]}}