{"title":"A.B. Gayle - Rosso e grigio [Pdf Epub - Ita]","uid":12771612,"size":3240378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5444bf758c61907656c6b6afd80e6aac09fad98&amp;dn=A.B.+Gayle+-+Rosso+e+grigio+%5BPdf+Epub+-+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vitolanz","files":2,"time":1447682854,"description":"A.B. Gayle - Rosso e grigio, [Pdf Epub - Ita][TNTVillage]\r\n-----------------------------------------------------------------------------------\r\n.: Dettagli :.\r\n\r\nAutore: A.B. Gayle\r\nTitolo: Rosso e grigio\r\nAnno: 2014\r\nLingua: Italiana\r\nGenere: Romanzo\r\nDimensione del file: 2,20 MB (PDF), 908 KB (Epub)\r\nFormato del file: PDF + Epub\r\n-----------------------------------------------------------------------------------\r\n\r\n.: Trama :.\r\n\r\nAppena arrivato dai boschi del Minnesota, lo studente di scienze attuariali Ben Dutoit è entusiasta di aver ottenuto uno stage alla Sydney Sutherland Family Insurance, una delle poche aziende a offrire assicurazioni sulla vita per le categorie ad alto rischio di salute. Il fatto che l’ufficio si trovi a Gay central, ovvero San Francisco, è solo la ciliegina sulla torta, una torta dai colori dell’arcobaleno. Ben ha solo tre obiettivi da raggiungere: essere se stesso senza mai nascondersi e partecipare orgogliosamente al Gay Pride della città, conoscere tanta gente interessante nei vari locali e, forse, se è fortunato, innamorarsi.\r\nMa gli uomini che Ben incontra sono tutto il contrario di lui: galanti, sofisticati, sicuri e sexy. Al contrario di Ben, rozzo provinciale, loro appartengono a famiglie ricche e benestanti, nobili e conservatrici, e portano sulle spalle tutte le responsabilità che derivano dalle loro posizioni.\r\nMentre Ben ancora si chiede se uno come lui potrà mai appartenere al loro mondo, inizia a scoprire i rischi di ciò che questo mondo sofisticato potrebbe comportare. L’economia globale è in crisi e il lavoro che tanto desiderava è sul filo del rasoio. Tutti i suoi sogni sono in pericolo, specialmente quello più grande: l’amore.\r\n-----------------------------------------------------------------------------------\r\n\r\n.: Biografia dell'autore :.\r\n\r\nA differenza di molti autori, non ho scritto storie per tutta la vita. Invece ho vissuto la vita.\r\nI miei viaggi mi hanno portato dai fiordi della Norvegia fino alla punta meridionale della Nuova Zelanda. Nel mezzo, ho lavorato in tante città diverse che ho perso il conto. Ho spalato merda in cantieri di mucca, pecora radunato, stato educato ai clienti, scambiato insulti con i politici. A volte ho bisogno di essere perdonato come mi confondo per chi ha bisogno di cosa dove.\r\nOra vive a Sydney, in Australia, ho finalmente avuto il tempo per permettere ai miei reali esperienze di vita a morph con la mia immaginazione fertile per creare finzione che Spero che i miei lettori potranno godere.\r\nFaccio un feedback sul valore mia scrittura, sia negative che positive.Attenzione però, se si è scortese o non costruttiva, chi lo sa, si può solo finire come un personaggio in uno dei miei libri","torrent":{"xt":"urn:btih:c5444bf758c61907656c6b6afd80e6aac09fad98","amp;dn":"A.B.+Gayle+-+Rosso+e+grigio+%5BPdf+Epub+-+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5444bf758c61907656c6b6afd80e6aac09fad98","infoHashBuffer":{"type":"Buffer","data":[197,68,75,247,88,198,25,7,101,108,107,106,253,128,230,170,192,159,173,152]},"announce":[],"urlList":[]}}