{"title":"Moon Shot - The Apollo Story [1994] VHS RIP","uid":4120866,"size":1967787924,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c584f9f059f6a078240539c3774a68ff7c09d000&amp;dn=Moon+Shot+-+The+Apollo+Story+%5B1994%5D+VHS+RIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cray1000","files":2,"time":1207538179,"description":"After looking all over the net for this, I finally caved and bought it.  Its only available on VHS so i had to do a VHS rip, but the quality is descent.  I wanted to return the favor of other people who share their rare stuff by giving this out.  I am a huge fan of the space program and going back to the moon, so i want everyone to see this. Here is a great review i took from IMDB:\n\n1994 and 1995 became bumper seasons for American retrospectives about having gone to the moon, both in print and on film. When the story first broke in 1993 that Apollo astronaut Jim Lovell was writing the story of his own dramatic yet uplifting Apollo 13 mission, and it was being made into a Hollywood film; -well, you can bet that his old friend Al Shepard would want to match that.\n\nThe good news is that he did.\n\nAlan Shepard and Deke Slayton co-wrote Moon Shot, published also in 1994, and it was turned into a Turner Broadcasting System (TBS) production of 8x1/2-hr installments rolled into one 192min video, Moon Shot (1994). Moon Shot is an astronaut-narrated documentary, the type I always wanted to see. Science journalist Andrew Chaikin&amp;#039;s decade-long project to tell the same story, which first resulted in his highly respected book A Man on the Moon, published also in 1994, later becoming the basis for Tom Hanks&amp;#039;\n\nFrom the Earth to the Moon (1998), has ended up with a wider perspective. Of course, we need that, too. But for shee entertainment value, you cannot go past Moon Shot. It has the added advantage of fitting onto one tape, rather than six. It&amp;#039;s a much more emotionally immediate (addictive) and economical way to tell the same story. The acted-out recreations of FETTM usually just make me cry, and I find myself needing to psyche up even to choose which tape to watch. Moon Shot&amp;#039;s relative brevity and immediacy are powerful incentives.\n\nWe see and hear the original astronauts in footage from the &amp;#039;60s, sometimes in opinionated fashion. These are not re-enactments. The beginning is instantly engaging: Kennedy&amp;#039;s speech instigating the programme &quot;gave everyone moon fever. The whole country went to work on the moon shot. We practically had a big sign chiselled there up in the sky that said &amp;#039;Waste anything but time&amp;#039;&quot;.\n\nMoon Shot consist of the private memories of the people involved. Remember John Glenn&amp;#039;s &quot;fireflies&quot;? It is in Moon Shot that we finally discover that they were from the Constellation Urion (urine).\n\nWe hear interviews with all the major players some 30 years later. Most of them are still alive (Al died 1998, Deke 1994, Gus 1967). The astronauts remaining by 1994 become friends to the viewer as well, because we hear them talking about so many things, and each other, on a first name basis. I now can recognize Alan and Wally and Jim (etc) just by their voice alone: I can turn my back and know who&amp;#039;s talking. This video really compels us to honor them, warts and all.\n\nWe find out that all the astronauts were incredibly competitive, admittedly to the point even of foolishness. They resented the chimps (shock/ horror). They were basically fighter jocks with egos the size of planets (How many fighter jocks does it take to change a light bulb? Just one- he holds the bulb and the world revolves around him), and Coco Beach became their playground, where they got up to all the same hijinks that felled Kennedy&amp;#039;s reputation.\n\nYet no-one dared contradict them much. Gunther Wendt tried that with Alan Shepard, and got an ashtray thrown at his head for his trouble. So I think it took the distance of time, plus the humility imposed by the majesty of space where they really have gone before and come back from, to mellow the surviving astronauts into something resembling Everyman again.\n\nThe 1960s were heady, very, very political times (the Apollo programme was largely funded by the CIA, although I don&amp;#039;t think that&amp;#039;s revealed in this video). Near the beginning of Moon Shot, we see original interviews of people on the street feeling the ego-bruising effects of Sputnik, and exhorting(!) American leaders to overtake the Russians. People thought the way they were taught to think (ie not as informed as they might have been), and they were frightened. Those were different times. Apollo was always going to be a political football. So perhaps to play against all the propaganda, The Bill Dana Show around 1964 featured a hilarious skit featuring Dana&amp;#039;s creation &quot;Jose Jimenez, Astronaut&quot;. It is included in the first episode on Moon Shot. The comic (actually Hungarian comic writer William Szathmary) impersonated a frightened astronaut fully suited up but holding his helmet, with Gary Crosby as his straight man. The routine goes as follows: Gary Crosby: (pointing to the astronaut&amp;#039;s helmet) Is that the crash helmet? Astronaut: Oh I hope not. Gary Crosby: Ah, after you leave the moon, sir, when you come back to Earth, where will you be landing? Astronaut: I will be landing in Nebatha. Jes, de state of Nebatha. Gary Crosby: Then you&amp;#039;re convinced they will get you back to Earth? Astronaut: Jes, just how far into it, that&amp;#039;s what I&amp;#039;m not convinced about. Gary Crosby: Well, surely they&amp;#039;ve provided something to break your fall? Astronaut: Oh jes. De State of Nebatha.\n\nBut the two most touching, heartrending stories from the Gemini and Apollo programmes both concern Gus Grissom. I now love Gus. He died on Pad 34. Go Fever, the insane round-the-clock schedule they all kept, ensured that no-one re-examined the decisions made to solve the &quot;5-20 insurmountable problems a day&quot;. So the highly pressurized oxygen atmosphere, combined with combustible materials within the capsule were allowed to stay in the design from Gemini. Until a short sparked one exhausting 1967 Friday during the last ground test on Pad 34. And just like that, Gus was gone. But the astronaut&amp;#039;s perspective on Moon Shot explains: &quot;If one of us didn&amp;#039;t make it, there&amp;#039;d be six of us left. And don&amp;#039;t kid yourself. As soon as the funeral was over, we&amp;#039;d be lining up to take the next ride. That was the test business.&quot; Gus would have said the same.\n\nThanks guys, for having gone where other people will someday go again. Into that photographically irreproducible blackness of true space. Live long and prosper. 10/10.","torrent":{"xt":"urn:btih:c584f9f059f6a078240539c3774a68ff7c09d000","amp;dn":"Moon+Shot+-+The+Apollo+Story+%5B1994%5D+VHS+RIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c584f9f059f6a078240539c3774a68ff7c09d000","infoHashBuffer":{"type":"Buffer","data":[197,132,249,240,89,246,160,120,36,5,57,195,119,74,104,255,124,9,208,0]},"announce":[],"urlList":[]}}