{"title":"Phantasy_Star_Portable_2_USA_PSP-pSyPSP","uid":7405853,"size":856211079,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:c5c665ea3c2df6c446c889f27cd8df57acc148f0&amp;dn=Phantasy_Star_Portable_2_USA_PSP-pSyPSP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Totenkruez","files":-1,"time":1341241766,"description":"Phantasy Star Portable 2 (c) SEGA\n\nsupplier ..... Us\npublisher ... sega\nstore date ... 14/09/10\ndeveloper ... alfa system\nrelease date . 15/09/10\nfiles ....... 57x15\n\nR E L E A S E   N O T E S : &lt;a href=&quot;\nhttp://psp.ign.com/objects/023/023354.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://psp.ign.com/objects/023/023354.html&lt;/a&gt;\n\nPhantasy Star Portable 2 is a video game for the PlayStation Portable, produced by Alfa System and published by Sega. It is the sequel to Phantasy Star Portable and was released for the PlayStation Portable in Japan on December 3, 2009. The North American version was released on September 14, 2010 while the European version was released on September 17, 2010.\n\nPhantasy Star Portable 2 takes place three years after the events of Phantasy Star Universe, all four races defeated and sealed off the SEED. However, a new issue takes the center stage, the resources in Gurhal are quickly diminishing. Due to this, a Sub-space sailing theory was set in place, where Gurhalians migrate to outer space. The player will participate in a private mercenary group known as Little Wing on Clad 6, a space colony resort.\n\nThe player starts by designing and customizing his or her own character by choosing facial features, gender, body and vocal features. Though much of the gameplay features will be similar to its predecessor, there will be some notable differences. Photon Points are no longer attached to weapons, but characters instead. Photon Charges have also been removed from the game.\n\nPlayers will be able to transfer over their character from Phantasy Star Portable to the game. However, not all data will be carried over. Data that will be transferred over includes the character's name and parts of the character's original appearance. However, the character's level and items will not be transferred over. As a bonus for having done so, however, players acquire a photon saber that is named &quot;Exam&quot;, as well as one of four armor units depending on the class that they have chosen. Furthermore, NPCs will mention at times that the player is a former GUARDIAN. Unlike Phantasy Star Portable, Phantasy Star Portable 2 features an infrastructure play mode allowing players to form a party with other users through an internet connection, similar to Phantasy Star Online, Phantasy Star Zero, and Phantasy Star Universe. This service does not require a monthly subscription, as many other titles in the series do.","torrent":{"xt":"urn:btih:c5c665ea3c2df6c446c889f27cd8df57acc148f0","amp;dn":"Phantasy_Star_Portable_2_USA_PSP-pSyPSP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5c665ea3c2df6c446c889f27cd8df57acc148f0","infoHashBuffer":{"type":"Buffer","data":[197,198,101,234,60,45,246,196,70,200,137,242,124,216,223,87,172,193,72,240]},"announce":[],"urlList":[]}}