{"title":"The Dorito Effect - 2nd Edition (2015).epub Gooner","uid":12765222,"size":1626660,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c60703dbd5646bac9a034e95448e6cdd1651864a&amp;dn=The+Dorito+Effect+-+2nd+Edition+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1447592663,"description":"The Dorito Effect - The Surprising New Truth About Food and Flavor - 2nd Edition (2015).epub Gooner\r\n\r\nPublisher: Simon &amp; Schuster; Second edition (May 5, 2015)\r\nLanguage: English\r\nISBN-10: 1476724210\r\nISBN-13: 978-1476724218\r\n\r\nA lively and important argument from an award-winning journalist proving that the key to reversing America’s health crisis lies in the overlooked link between nutrition and flavor.\r\n\r\nIn The Dorito Effect, Mark Schatzker shows us how our approach to the nation’s number one public health crisis has gotten it wrong. The epidemics of obesity, heart disease, and diabetes are not tied to the overabundance of fat or carbs or any other specific nutrient. Instead, we have been led astray by the growing divide between flavor—the tastes we crave—and the underlying nutrition. \r\n\r\nSince the late 1940s, we have been slowly leeching flavor out of the food we grow. Those perfectly round, red tomatoes that grace our supermarket aisles today are mostly water, and the big breasted chickens on our dinner plates grow three times faster than they used to, leaving them dry and tasteless. Simultaneously, we have taken great leaps forward in technology, allowing us to produce in the lab the very flavors that are being lost on the farm. Thanks to this largely invisible epidemic, seemingly healthy food is becoming more like junk food: highly craveable but nutritionally empty. We have unknowingly interfered with an ancient chemical language—flavor—that evolved to guide our nutrition, not destroy it.\r\n\r\nWith in-depth historical and scientific research, The Dorito Effect casts the food crisis in a fascinating new light, weaving an enthralling tale of how we got to this point and where we are headed. We’ve been telling ourselves that our addiction to flavor is the problem, but it is actually the solution. We are on the cusp of a new revolution in agriculture that will allow us to eat healthier and live longer by enjoying flavor the way nature intended","torrent":{"xt":"urn:btih:c60703dbd5646bac9a034e95448e6cdd1651864a","amp;dn":"The+Dorito+Effect+-+2nd+Edition+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c60703dbd5646bac9a034e95448e6cdd1651864a","infoHashBuffer":{"type":"Buffer","data":[198,7,3,219,213,100,107,172,154,3,78,149,68,142,108,221,22,81,134,74]},"announce":[],"urlList":[]}}