{"title":"Armada.2526.SuperNova-SKIDROW","uid":6316576,"size":1012120501,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c680b688f153cf6731a070342f34990df9f99016&amp;dn=Armada.2526.SuperNova-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MAFIAA.","files":-1,"time":1302725730,"description":"                          S  K  I  D  R  O  W\n\n                          .the leading force.\n\n\n\n                           proudly presents\n\n                 Armada 2526 SuperNova (c) Ntronium Games\n\n\n\n\n\n  13-04-2011........Release Date &lt;-&gt; Protection.............Nothing\n\n  Strategy.............Game Type &lt;-&gt; Disk(s)..................1 DVD\n\n\n\n\n\n  RELEASE NOTES\n\n\n\n\n\nArmada 2526 SuperNova gives you 4X more. More to explore, more to\n\nexploit, more to exterminate and expands you re gaming horizons by\n\nletting you challenge your friends via LAN or PBEM play.\n\n\n\nThere are new star and planet types to discover, and more than 30\n\nspecial features to make each star system distinctive. You may\n\nencounter tachyon storms, psychic plants, primitives or find abandoned\n\nalien technology that advances your own research. Two new races, with\n\ntheir own ships and special characteristics, await your discovery,\n\nbefriend them, play as them, or exterminate them as you wish.\n\n\n\nA new trade system lets you construct networks to trade valuable\n\ncommodities between the stars, both between your own worlds, and with\n\nother players. Alien relics, rare minerals, tourists, or even natural\n\nanti-matter, your freighters carry them all. Choke an enemy with trade\n\nembargoes, or blockade their planets with stealth ships operating\n\nbehind the lines. But trade and tourism bring less welcome visitors\n\ntoo. The new espionage system lets you plant spies to gather\n\ninformation or steal technological secrets, or drop special forces that\n\ncan sabotage defenses before an attack.\n\n\n\nFifty new technologies open up new strategies and tactics. Confound\n\nyour enemies with hard to detect stealth ships, jam their missiles with\n\nelectronic warfare, build fighter stations to defend your planets, and\n\nblitz defenses with storm troopers. Research Gaia to make everyone\n\nhappy, or grind them under your heel with a variety of more powerful\n\nwarships and upgraded weapons.\n\n\n\nExperience the game in a completely new way by taking on human\n\nopponents. Armada s simultaneous order system makes it ideal game for\n\nmulti-player action. Now you can crush your friends playing over LAN\n\n( local area networks) or PBEM (play by email).\n\n\n\n\n\n  INSTALL NOTES\n\n\n\n\n\n1. Unpack the release\n\n2. Mount or burn image\n\n3. Install (This version does not require the orginal Armada 2526)\n\n4. Play the game\n\n5. Support the companies, which software you actually enjoy!\n\n\n\n\n\n  GREETINGS\n\n\n\n\n\nUnleashed - TiNYiSO - MRN - RADIKAL - POSTMORTEM - GENESIS - Fairlight\n\n    SHOCK - CRUDE - ReUnion - VACE - OUTLAWS - BACKLASH - Titan\n\n\n\n\n\n                               ascii art by the\n\n                              godlike &amp; terrific duo\n\n                                  malodix + irokos\n\n                                   titan artdivision","torrent":{"xt":"urn:btih:c680b688f153cf6731a070342f34990df9f99016","amp;dn":"Armada.2526.SuperNova-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c680b688f153cf6731a070342f34990df9f99016","infoHashBuffer":{"type":"Buffer","data":[198,128,182,136,241,83,207,103,49,160,112,52,47,52,153,13,249,249,144,22]},"announce":[],"urlList":[]}}