{"title":"Aesop Rock - None Shall Pass VO","uid":3857702,"size":89356127,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c6853979e1327d7f3b7c95f13155fd31f97dbb66&amp;dn=Aesop+Rock+-+None+Shall+Pass+VO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shdwwarlord","files":14,"time":1193297211,"description":"From AllMusic:\n&quot;Aesop Rock has been impressing the backpacker crowd with his intricate lyrics and dark, dirty, melodic production ever since he self-released Music for Earthworms back in 1997, helping to define the East Coast underground scene and validate the presence of white rappers. And even though he moved to San Francisco in 2005, prompting some outcry from New York purists, all thoughts of bright, funky West Coast beats and lyrics can be put to rest, because None Shall Pass, the album being heralded as the true follow-up to the seminal Labor Days, is as powerful as anything the MC has ever created. Once again Blockhead takes responsibility for most of the production here, though he&amp;#039;s helped out both by Rock himself (who showed off his skills, as well as those of his guitar-playing wife, on the Nike/iTunes-commissioned Original Run series back in February 2007) and Def Jux labelhead and near-legend El-P, who also adds vocals to &quot;39 Thieves,&quot; one of the few tracks on the record that has a fairly comprehensible message (&quot;Money is cool, I&amp;#039;m only human/But they use it as a tool to make the workers feel excluded/Like the shinier the jewel the more exclusive the troop is/Bullets don&amp;#039;t take bribes, stupid, they shoot shit,&quot; he rhymes in the breakdown). Because despite, or perhaps more accurately, due to, Aesop Rock&amp;#039;s verbal talent and his ability to combine complicated internal rhyme with innovative phrasing and metaphors, a lot of his couplets, and even entire stories, are fairly cryptic. &quot;None Shall Pass,&quot; with its great keyboard sample and helium-voiced chorus, is vaguely about society having to pay for its sins, the fantastic &quot;The Harbor Is Yours&quot; tells the tale of a &quot;pirate,&quot; and features some great vocal stuttering (&quot;And you should tell them where you situate the gold/That is unless you&amp;#039;d like a vacation with Davy J-J-J-Jones&quot;), and &quot;Bring Back Pluto&quot; is more than an appeal to astronomers, though to who else it applies to is a little unclear. This doesn&amp;#039;t mean that there are a lot of empty phrases here ? Aesop Rock is clearly a careful, deliberate writer ? but he can tend toward the experimental school of rhyme, which can be a little alienating. Still, his cadence, sharp and accentuated, and his bitonal flow are strangely warm and inviting, and it&amp;#039;s hard not to get sucked into at least trying to understand what he&amp;#039;s saying, trying to make sense of it all. Plus, the talent, both of Rock and his guests (which, besides El-P, also include Ron Sonic, John Darnielle from the Mountain Goats, Breezly Brewin&amp;#039;, and Cage) is impressive, and makes None Shall Pass an album that deserves a lot of attention, both inside and outside the hip-hop world. &quot;\n\nThese are torrents I have rescued from OiNK before it died. I give them to you as part of my duty to the community until an OiNK replacement can be found. Enjoy.","torrent":{"xt":"urn:btih:c6853979e1327d7f3b7c95f13155fd31f97dbb66","amp;dn":"Aesop+Rock+-+None+Shall+Pass+VO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6853979e1327d7f3b7c95f13155fd31f97dbb66","infoHashBuffer":{"type":"Buffer","data":[198,133,57,121,225,50,125,127,59,124,149,241,49,85,253,49,249,125,187,102]},"announce":[],"urlList":[]}}