{"title":"Ascent of Women by Sally Armstrong [retail EPUB] (MOBI AZW3 PDF)","uid":10843685,"size":5703596,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c817c73a8cd23e783a7f7f2bed494c12eb605355&amp;dn=Ascent+of+Women+by+Sally+Armstrong+%5Bretail+EPUB%5D+%28MOBI+AZW3+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1408754890,"description":"This book is about the final frontier for women: having control over your own body, whether in zones of conflict, in rural villages, on university campuses or in your own kitchen. Recent studies by economists such as Jeffrey Sachs and social scientists such as Isobel Coleman claim that women who gain such control--who are not oppressed--are the key to economic justice and the end to violence in developing countries around the world.\n     Daughters of the Revolution will describe the perilous journey that brought women to this point. It will tell the dramatic and empowering stories of change-makers and examine the stunning courage, tenacity and wit they are using to alter the status quo. It is the story of a dawning of a new revolution, whose chapters are being written in mud-brick houses in Afghanistan and on Tehrir Square in Cairo; in the forests of the Congo where women still hide from their attackers; and in a shelter in northern Kenya where 160 girls between 3 and 17 are pursuing a historic court case against a government who did not protect them from rape. \n     Women revolutionaries in Toronto and Nairobi, in Kabul and Caracas, in New York City and Lahore are making history. Women the world over are marching to protest honour killing, polygamy, stoning and a dozen other religiously or culturally sanctified acts of violence. Sally Armstrong will bring us these voices from the barricades, inspiring and brave.","torrent":{"xt":"urn:btih:c817c73a8cd23e783a7f7f2bed494c12eb605355","amp;dn":"Ascent+of+Women+by+Sally+Armstrong+%5Bretail+EPUB%5D+%28MOBI+AZW3+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c817c73a8cd23e783a7f7f2bed494c12eb605355","infoHashBuffer":{"type":"Buffer","data":[200,23,199,58,140,210,62,120,58,127,127,43,237,73,76,18,235,96,83,85]},"announce":[],"urlList":[]}}