{"title":"Beauty And The Beast-  Beauty And The Beast Enchanted Christmas ","uid":6061862,"size":2149014461,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c89c66c20f3e521f5fa47c6355413c5f8e4bad52&amp;dn=Beauty+And+The+Beast-++Beauty+And+The+Beast+Enchanted+Christmas+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alanwatson","files":-1,"time":1293164287,"description":"Beauty And The Beast: When an arrogant prince is cursed to become a Beast, the only way to break the spell is to love and be loved in return. But who could ever learn to love a Beast? After he imprisons Belle, a bookworm who dreams of life outside her provincial village, he sees her as difficult and stubborn while she views him as a monster. But the two soon taste the bitter-sweetness of finding you can change and learning you were wrong.\n\nBeauty And The Beast: Enchanted Christmas: All the enchantment of Disney's Academy Award Winning film, Beauty and the Beast, continues as this classic adventure casts its song-filled spell. This magical tale reveals a Christmas past when Belle vows to warm the Beast's castle with the sprit and hope of the season - despite the Beast's misgivings about Christmas. She asks all the enchanted Objects to chip in, including reluctant Angelique - a beautiful tree ornament who was once the castle decorator. But Belle, Cogsworth, Lumiere and a host of new, enchanting friends must first undo the plans of Forte - an evil, plotting pipe organ - who gets wind of their plan. He will pull out all the stops to keep the Beast away from Belle's special gift of hope.\n\nFrom the rich detail of the Beast's castle to the astounding computer-generated imagery of the villain, Forte, this beautiful tale overflows with spectacular songs, spellbinding visuals and the same state-of-the-art effects that brought Disney's original masterpiece to the screen. Now be our guest for a perfectly enchanting untold chapter in a tale as old as time.\n","torrent":{"xt":"urn:btih:c89c66c20f3e521f5fa47c6355413c5f8e4bad52","amp;dn":"Beauty+And+The+Beast-++Beauty+And+The+Beast+Enchanted+Christmas+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c89c66c20f3e521f5fa47c6355413c5f8e4bad52","infoHashBuffer":{"type":"Buffer","data":[200,156,102,194,15,62,82,31,95,164,124,99,85,65,60,95,142,75,173,82]},"announce":[],"urlList":[]}}