{"title":"Seeing Me Naked - Liza Palmer","uid":10358050,"size":553628,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8ccfadf60ab4a7d57a60045470bbe375e6acffb&amp;dn=Seeing+Me+Naked+-+Liza+Palmer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1402770438,"description":"Elisabeth Page is the daughter of Ben Page, yes, that's right, THE world famous novelist. And yes, she's also the sister of Rascal Page, world famous novelist in his own right. So what does Elisabeth do? Much to her family's disappointment, Elisabeth is a pastry chef. And a pretty damn good one, at Beverly, the hottest restaurant in LA. \nThe last relationship Elisabeth had was with Will, a man she grew up with and whose family ran in the same social circles as her family. But Will's constant jaunts around the world have left her lonely and brokenhearted in L.A. \nThat is until Daniel Sullivan bids on one of Elisabeth's pastry tutorials at a charity auction. Daniel is everything her family is not: a basketball coach, a non-intellectual, his family doesn't summer on Martha's Vineyard, and the only metaphors he uses are about passing the ball and being a team player. But somehow they fit. \nBetween her family, Will, and the new cooking show that Elisabeth is recruited to star in, Elisabeth's life is suddenly incredibly new and different--the question is, can she embrace being happy or has her family conditioned her to think she's just not good enough?\nLiza Palmer expertly depicts a woman trying to come to terms with professional success, personal success, and finally dealing with a family that might love her from the bottom of their heart but doesn't necessarily have her best interest always at heart.\n\n**\n\nFrom Publishers Weekly\n\nPalmer follows up her mirthful debut, Conversations with the Fat Girl, with a subtly sophisticated romance that outclasses most of the genre's other offerings. Elisabeth Page is a 30-year-old pastry chef at L.A.'s restaurant du jour whose perpetually knotted stomach has roots in any number of sources: her father, Ben, a two-time Pulitzer-winning novelist and the kind of cultural icon that doesn't exist anymore, with whom every conversation is a chess game; childhood sweetheart Will Houghton, whose globe-trotting as a journalist has stunted their ill-defined relationship; the head chef from hell at her all-consuming job; and her patrician family's way of bonding through blood sport. But relief begins to filter in as Elisabeth's dalliance with beer-drinking, salt-of-the-earth basketball coach Daniel Sullivan turns into a fulfilling relationship and her culinary career takes an unexpected turn. If it sounds chick litty, it is, but consider it haute chick lit; Palmer's prose is sharp, her characters are solid and her narrative is laced with moments of graceful sentiment. (Jan.) \nCopyright Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.\n\nReview\n\n&quot;Slick and highly readable&quot; -- Elle  'A subtly sophisticated romance that outclasses most of the genre's other offerings... If it sounds chick litty, it is, but consider it haute chick lit. Palmer's prose is sharp, her characters are solid and her narrative is laced with moments of graceful sentiment' -- Publisher's Weekly  PRAISE FOR CONVERSATIONS WITH THE FAT GIRL:'Engaging and poignant and heartbreakingly real, Liza Palmer's tale of best friends, true love and just what size happily-ever-after wears is a winning conversation' -- Jennifer Weiner, bestselling author of GOOD IN BED  'Pardon the pun, but CONVERSATIONS WITH THE FAT GIRL is far from lightweight. Its message about self image and the power of attitude in making positive change is delivered in a snappy fashion. In a word: genuine.' -- Herald Sun  'Palmer's likable characters and snappy dialogue make this novel stand out from the crowd, and it's sure to attract fans of Jennifer Weiner...' -- Booklist 20080401 'Smart, funny and heartbreakingly honest.' -- Johanna Edwards, bestselling author of THE NEXT BEST THING","torrent":{"xt":"urn:btih:c8ccfadf60ab4a7d57a60045470bbe375e6acffb","amp;dn":"Seeing+Me+Naked+-+Liza+Palmer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8ccfadf60ab4a7d57a60045470bbe375e6acffb","infoHashBuffer":{"type":"Buffer","data":[200,204,250,223,96,171,74,125,87,166,0,69,71,11,190,55,94,106,207,251]},"announce":[],"urlList":[]}}