{"title":"X-Men Setup PC [Hyperdrive25].exe","uid":6492701,"size":1327362,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c8de7f4c91abe48c60944954b494d5a444a88175&amp;dn=X-Men+Setup+PC+%5BHyperdrive25%5D.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hyperdrive25","files":-1,"time":1308943500,"description":"                         X-MEN PC SETUP\n                         ==============  \nBased on the Marvel comic book series, X-Men pits everyone's favorite team of superheroic mutants against the villainy of Magneto. From his base on Asteroid M, Magneto has developed a computer virus for use in infecting the X-Men's training facility, the Danger Room. This cleverly designed virus has turned the once holographic perils of the Danger Room into reality. Once again, the X-Men are called upon to save the day.\n\nWolverine, Cyclops, Gambit and Nightcrawler (with a little help from Rogue, Archangel, Iceman, Storm and Jean Grey) must fight through six levels and stop Magneto, who has enlisted help from such X-Men foes as Juggernaut, Sabretooth, Mojo, Deathbird, Apocolypse and Ahab.\n\nOnce in action, each X-Man has his own methods of getting the job done. Wolverine slices through anything and everything with his razor-sharp adamantium claws, Cyclops uses his powerful optic blasts, Gambit throws energy-charged cards and Nightcrawler teleports through walls (taking out enemies in the process). When needed, other X-Men are on call to lend a hand, each with special powers of his or her own.\n\nCollectively, the six levels of play are called Combat Zones. Individually, they are: the Savage Land, the Shi'ar Empire, Excalibur's Lighthouse, Ahab's Future World, Mojo's Crunch and Asteroid M. Missions within these levels include a battle with a tribe of leopardmen while escaping giant bees, the hijacking of a space shuttle, escaping from a house of horrors and much more. Obstacles (such as flames and toxic ooze), puzzles (such as using keys to turn off devices) and enemies abound.\n\n[Installation]\nDouble-click X-Men Setup PC [Hyperdrive25] to begin install\n___________________________________________________________________________________\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!*********************************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n","torrent":{"xt":"urn:btih:c8de7f4c91abe48c60944954b494d5a444a88175","amp;dn":"X-Men+Setup+PC+%5BHyperdrive25%5D.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8de7f4c91abe48c60944954b494d5a444a88175","infoHashBuffer":{"type":"Buffer","data":[200,222,127,76,145,171,228,140,96,148,73,84,180,148,213,164,68,168,129,117]},"announce":[],"urlList":[]}}