{"title":"LiveLessons - Introduction to the FreeBSD OS","uid":12372005,"size":5451380709,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:c91da43d63d6a04b817457b9051989f2899686ae&amp;dn=LiveLessons+-+Introduction+to+the+FreeBSD+OS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bey0nd","files":53,"time":1441665560,"description":"Description\n\n    This ten-hour video starts with an introduction to the FreeBSD community and explains how it differs from the Linux ecosystem. The video then goes on to provide a firm background in the FreeBSD kernel. The POSIX kernel interfaces are used as examples where they are defined. Where they are not defined, the FreeBSD interfaces are described. The video covers basic kernel services, locking, process structure, scheduling, signal handling, jails, and virtual and physical memory management. The kernel I/O structure is described showing how I/O is multiplexed and the virtual filesystem interface is used to support multiple filesystems. Devices are described showing disk management and their auto-configuration. Next the organization and implementation of the fast filesystem is described, concluding with a discussion of how to maintain consistency in the face of hardware or software failures. The video includes an overview of the ZFS filesystem. The video also covers the socket-based network architecture and layering along with a discussion of routing issues. \n\n\nWhat You Will Learn\n\n    The video starts with an introduction to the FreeBSD community and explains how it differs from the Linux ecosystem. The video then goes on to provide a firm background in the FreeBSD kernel. The POSIX kernel interfaces are used as examples where they are defined. Where they are not defined, the FreeBSD interfaces are described.\n    The video covers basic kernel services, locking, process structure, scheduling, signal handling, jails, and virtual and physical memory management.\n    The kernel I/O structure is described showing how I/O is multiplexed and the virtual filesystem interface is used to support multiple filesystems.\n    Devices are described showing disk management and their auto-configuration.\n    The organization and implementation of the fast filesystem is described concluding with a discussion of how to maintain consistency in the face of hardware or software failures.\n    The video includes an overview of the ZFS filesystem and covers the socket-based network architecture, layering and routing issues.\n    The presentations emphasize code organization, data structure navigation, and algorithms.\n\nWho Should Take This Course\n\n    Applications developers, to learn how to effectively and efficiently interface with the system\n    Systems programmers without direct experience with the FreeBSD kernel, to learn how to maintain, tune, and interface with such systems\n    Those involved in technical and sales support, to learn the capabilities and limitations of the system\n    Enterprise and mobile (Android) communities needing to understand the intricacies of FreeBSD and use its advanced features\n\nCourse Requirements\n\nThis video is directed to users who have had at least a year of experience using a UNIX-like system. They should have an understanding of fundamental algorithms (searching, sorting, and hashing) and data structures (lists, queues, and arrays).\n\n\nTable of Contents\n\n1 - Introduction to the FreeBSD Community\n2 - Introduction to the Kernel\n3 - Processes\n4 - Virtual Memory\n5 - I/O System Overview\n6 - Devices\n7 - The Fast Filesystem\n8 - The ZFS Filesystem\n9 - Networking and Interprocess Communication","torrent":{"xt":"urn:btih:c91da43d63d6a04b817457b9051989f2899686ae","amp;dn":"LiveLessons+-+Introduction+to+the+FreeBSD+OS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c91da43d63d6a04b817457b9051989f2899686ae","infoHashBuffer":{"type":"Buffer","data":[201,29,164,61,99,214,160,75,129,116,87,185,5,25,137,242,137,150,134,174]},"announce":[],"urlList":[]}}