{"title":"Steve Young - Rock salt and nails (1969) MP3@320kbps","uid":9622044,"size":91233123,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c936a2f319e70c92b8da446642518a62c1975d09&amp;dn=Steve+Young+-+Rock+salt+and+nails+%281969%29+MP3%40320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AaronVincent","files":12,"time":1392517068,"description":"Steve Young was born and raised in the south, having lived in Georgia, Alabama and Texas throughout his childhood. By the 60s he had absorbed the musical heritage of his surroundings, performing music that blended country, folk, blues and gospel influences. He spent time as part of New York's Greenwich Village folk scene before moving to California in 1964. He was briefly with a band called Stone Country, before he decided to pursue a solo career. He was signed to A&amp;M Records, and his debut album came out in 1969.\n\nRock, Salt &amp; Nails was turned out to be a brilliant record, rootsy and soulful, and is often considered an early classic of the country-rock and outlaw country genres. A lot of the songs werere covers, including the title track by Utah Phillips, Hank WilliamsÎ“Ã‡Ã– Î“Ã‡Â£My Sweet Love AinÎ“Ã‡Ã–t AroundÎ“Ã‡Â¥, Roosevelt Jamison's &quot;That's How Strong My Love Is&quot;, Johnny Horton's &quot;I'm A One-Woman Man&quot; and John Lee HookerÎ“Ã‡Ã–s Î“Ã‡Â£HoboinÎ“Ã‡Ã–Î“Ã‡Â¥, but among the originals was Î“Ã‡Â£Seven Bridges RoadÎ“Ã‡Â¥, which he would later re-record for his second album of the same name. ItÎ“Ã‡Ã–s his best known song, and has been covered by loads of artists, including Joan Baez, Ian Matthews and The Eagles. Young played acoustic rhythm guitar, and among the assorted musicians backing him on the album was guitarist James Burton, bassist Chris Ethridge, fiddler Richard Greene, drummer Hal BlaineÎ“Ã‡Âª It even had brief appearances from Gene Clark on harmonica and Gram Parsons on organ. But it's his stunning voice that stole the show from start to finish. Sadly it didnn't get much recognition and had to remain an underground favourite, a fate that would shadow all his albums throughout his career.\n\nby Stuck In The Past!\t","torrent":{"xt":"urn:btih:c936a2f319e70c92b8da446642518a62c1975d09","amp;dn":"Steve+Young+-+Rock+salt+and+nails+%281969%29+MP3%40320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c936a2f319e70c92b8da446642518a62c1975d09","infoHashBuffer":{"type":"Buffer","data":[201,54,162,243,25,231,12,146,184,218,68,102,66,81,138,98,193,151,93,9]},"announce":[],"urlList":[]}}