{"title":"Jungle Effect - A Doctor Discovers the Healthiest Diets (mAnaV)","uid":4774690,"size":2429428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9636394e8ba9f0a5ff11b732cd59ba365ae89e4&amp;dn=Jungle+Effect+-+A+Doctor+Discovers+the+Healthiest+Diets+%28mAnaV%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"msbisht","files":-1,"time":1237168249,"description":"The Jungle Effect: A Doctor Discovers the Healthiest Diets from Around the World--Why They Work and How to Bring Them Home by Daphne, M.D. Miller \n\nPizza, pasta, hamburgers, sushi, tacos, and french fries . . . whether our ancestors were born in Madrid, Malaysia, or Mexico, chances are our daily food choices come from all around the globe. Unfortunately, we have taken some of the worst aspects of our varied ancestral menus to turn healthy cuisine into not-so-healthy junk food. Where did we go wrong?\n\nDr. Daphne Miller undertook a worldwide quest to find diets that are both delicious and healthy. Written in a style reminiscent of Michael Pollan and Barbara Kingsolver, this book is filled with inspiring stories from Dr. Miller's patients, quirky travel adventures, interviews with world-renowned food experts, delicious (yet authentic) indigenous recipes, and valuable diet secrets that will stick with you for a lifetime.\n\nWhether it's the heart-healthy Cretan diet, with its reliance on olive oil and fresh vegetables; the antidepression Icelandic diet and its extremely high levels of Omega 3s; the age-defying Okinawa diet and its emphasis on vegetables and fish; or the other diets explored herein, everyone who reads this book will come away with the secrets of a longer, healthier life and the recipes necessary to put those secrets into effect.\n\n\nPlz Seed...\n\nThnXX...\n\nmAnaV...\n\n\n","torrent":{"xt":"urn:btih:c9636394e8ba9f0a5ff11b732cd59ba365ae89e4","amp;dn":"Jungle+Effect+-+A+Doctor+Discovers+the+Healthiest+Diets+%28mAnaV%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9636394e8ba9f0a5ff11b732cd59ba365ae89e4","infoHashBuffer":{"type":"Buffer","data":[201,99,99,148,232,186,159,10,95,241,27,115,44,213,155,163,101,174,137,228]},"announce":[],"urlList":[]}}