{"title":"Derek Trucks - 'Joyful Noise' [320k MP3]","uid":4656158,"size":134738448,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c9bf32ebbc9994c111fd35a45fd28da3deaeef60&amp;dn=Derek+Trucks+-+%5C%27Joyful+Noise%5C%27+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smbdownload","files":-1,"time":1232210623,"description":"Joyful Noise is the third studio album by The Derek Trucks Band. Released on September 3, 2002, it features an eclectic mix of music, ranging from gospel, jazz fusion, Latin music, to East Indian music, featuring Trucks' talents with the Sarod. Many of the songs feature special guests, including Trucks' wife Susan Tedeschi and soul legend Solomon Burke. This album garnered critical praise and sold quite well, particularly for an album from a bandleader such as Trucks, who is often categorized as a blues artist alone. Unfortunately, blues musicians don't have the sensationalism and promotion of music videos of programs like MTV or Vh1, and often pass unnoticed from possible fans. This album, however, shows Trucks' band, which, compared to their last studio albums, has cemented Trucks as more than just a slide guitarist for The Allman Brothers Band.\n\nTrack listing [320k MP3]\n\n01. &quot;Joyful Noise&quot; \n02. &quot;So Close, So Far Away&quot; \n03. &quot;Home In Your Heart&quot; (feat. Solomon Burke) \n04. &quot;Maki Madni&quot;, (feat. Rahat Nusrat Fateh Ali Khan) \n05. &quot;Kam-ma-lay&quot;, (feat. RubÃƒÂ©n Blades) \n06. &quot;Like Anyone Else&quot;, (feat. Solomon Burke) (Kofi Burbridge) \n07. &quot;Every Good Boy&quot; (Kofi Burbridge) \n08. &quot;Baby, You're Right&quot;, (feat. Susan Tedeschi) \n09. &quot;Lookout 31&quot; (Kofi Burbridge) \n10. &quot;Frisell&quot; \n\n-----------------------------------------------------------------------------------\n\nTrucks' Band:\n\nThe Derek Trucks band, according to one All-Music reviewer, are a &quot;group of musicians that share a passion for improvisation and musical exploration&quot;. Trucks has described the various talents of the musicians in the band, and the vital role they have played in the making of this album.\n\nIn a 2002, posted on the band's official website, is a video where Trucks discusses the album, it's name, and the artists who worked together to create it. &quot;We realized that the music on this album was going to be coming from Pakistan, from Cuba, from the Latin scene, the jazz influence, the blues influence, so I thought one way to tie this all together was.. world gospel; so I thought &quot;Joyful Noise&quot; would be an appropriate title.&quot; \n\nJoyful Noise brings out the songwriting abilities of the band's keyboardist/flautist Kofi Burbridge. Burbridge is credited with being the sole composer for the tracks Like Anyone Else, Every Good Boy, and Lookout 31.\n\nSays Trucks, &quot;Kofi Burbridge has been with us maybe 2-3 years, and he's one of the few musical geniuses that I've had the chance to work with, he's totally insane&quot;... &quot;I'm really anxious to see in the next few years to see where he takes this, because he's definitely a huge part of what's going on right now.&quot;\n\nTodd Smallie has also been playing as with Trucks a very long time. A jazz and blues inspired bassist, he was the first member of the current band. When he began, Trucks was about 14 years old. Trucks has said he's &quot;kind of grown up with him.&quot; A year later, Yonrico Scott joined the band as their drummer and has been playing now with Trucks for about 10 years as of 2002. Trucks: &quot;We've developed a kind of musical ESP.. it's nice to have somebody that you don't have to look at, you didn't have to give any signs...he's just right there with you.&quot; Trucks feels pride in the rhythm section.\n\nThe last member of the band, has been Trucks himself. Having an interest in Pakistani and East Indian music, playing the sarod and then slide guitar and guitar in two bands, the four members of the band as of 2002 all have both differing and similar interests, which is what allows the music to mesh, and sound so unique.\n\n\n","torrent":{"xt":"urn:btih:c9bf32ebbc9994c111fd35a45fd28da3deaeef60","amp;dn":"Derek+Trucks+-+%5C%27Joyful+Noise%5C%27+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9bf32ebbc9994c111fd35a45fd28da3deaeef60","infoHashBuffer":{"type":"Buffer","data":[201,191,50,235,188,153,148,193,17,253,53,164,95,210,141,163,222,174,239,96]},"announce":[],"urlList":[]}}