{"title":"JavaScript Frameworks for Modern Web Dev - Tim Ambler","uid":12762661,"size":4327809,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:caeaf577c910c6c5d5fbe6d0215d142690aa1af4&amp;dn=JavaScript+Frameworks+for+Modern+Web+Dev+-+Tim+Ambler&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1447551301,"description":"JavaScript Frameworks for Modern Web Dev is your guide to the wild, vast, and untamed frontier that is JavaScript development.\r\n\r\nThe JavaScript tooling landscape has grown and matured drastically in the past several years. This book will serve as an introduction to both new and well established libraries, frameworks, and utilities that have gained popular traction and support from seasoned developers. It covers tools applicable to the entire development stack, both client- and server-side.\r\n\r\nWhile no single book can possibly cover every JavaScript library of value, JavaScript Frameworks for Modern Web Dev focuses on incredibly useful libraries and frameworks that production software uses. You will be treated to detailed analyses and sample code for tools that manage dependencies, structure code in a modular fashion, automate repetitive build tasks, create specialized servers, structure client side applications, facilitate horizontal scaling, and interacting with disparate data stores.\r\n\r\nThe libraries and frameworks covered include Bower, Grunt, Yeoman, PM2, RequireJS, Browserify, Knockout, AngularJS, Kraken, Mach, Mongoose, Knex, Bookshelf, Faye, Q, Async.js, Underscore, and Lodash.\r\n\r\nWritten from first-hand experience, you will benefit from the glorious victories and innumerable failures of two experienced professionals, gain quick insight into hurdles that aren't always explicitly mentioned in API documentation or Readmes, and quickly learn how to use JavaScript frameworks and libraries like a Pro","torrent":{"xt":"urn:btih:caeaf577c910c6c5d5fbe6d0215d142690aa1af4","amp;dn":"JavaScript+Frameworks+for+Modern+Web+Dev+-+Tim+Ambler","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caeaf577c910c6c5d5fbe6d0215d142690aa1af4","infoHashBuffer":{"type":"Buffer","data":[202,234,245,119,201,16,198,197,213,251,230,208,33,93,20,38,144,170,26,244]},"announce":[],"urlList":[]}}