{"title":"Corb Lund  Hair","uid":4513566,"size":109015300,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cbb6f322ad3c99e72dd4de8e811037fa881b1714&amp;dn=Corb+Lund++Hair+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KKELTIKK","files":13,"time":1226878548,"description":"&quot;Hair In My Eyes Like A Highland Steer&quot; was produced once again by Harry Stinson (Dead Reckoners, Steve Earle, Lyle Lovett) and recorded at Treasure Isle Recorders in Nashville, TN with engineer Peter Coleman (Joan Baez, Rodney Crowell). \n\n&quot;Hair In My Eyes Like A Highland Steer&quot; runs the gamut of roots music forms and flavours, from western swing to Waylon-esque country rock to ragtime to acoustic blues. The album continues in the vein of the band's previous release &quot;Five Dollar Bill&quot; by combining traditional western and acoustic stylings with incisive lyrics in an 'innovatively traditional' style. The album is in part upbeat and fun (&quot;Hurtin' Albertan&quot;, &quot;The Truck Got Stuck&quot;), wistful and moving (&quot;The Rodeo's Over&quot;, &quot;The Truth Comes Out&quot;) and outspokenly dissident (&quot;Counterfeiters' Blues&quot;). The lyrical content of his new work continues to reflect Lund's unique life experience, blending a Western upbringing with a decade on the indie rock scene with his previous group, the smalls.\n\nThe album features 13 songs written by Corb Lund and includes guest vocal performances by Western icon Ian Tyson and living folk legend Ramblin' Jack Elliott. The album also showcases performances by producer Harry Stinson, steel player Scotty Sanders (Kenny Chesney, Alan Jackson), guitarist Kenny Vaughn (Lucinda Williams, Marty Stuart), fiddlers Stuart Duncan (O Brother, Where Art Thou?) and Tammy Rogers (Dead Reckoners, Reba McEntire), Gordon Mote (Porter Wagoner) and master yodellers Ranger Doug and Too Slim. Also prominently featured on all tracks are the members of Lund's longtime touring band, &quot;The Hurtin' Albertans&quot; - Kurt Ciesla (bass), Brady Valgardson (drums) and Grant Siemens (guitars, etc).\n\nReleased on CD and VINYL. \n\n01 - Hair In My Eyes Like A Highland Steer\n02 - The Truck Got Stuck\n03 - Always Keep An Edge On Your Knife\n04 - The Rodeos Over (with Ian Tyson)\n05 - Hurtin Albertan\n06 - Big Butch Bass Bull Fiddle\n07 - All I Wanna Do Is Play Cards\n08 - The Truth Comes Out\n09 - Counterfeiters Blues\n10 - Good Copenhagen\n11 - Trouble In The Country\n12 - Little Foothills Heaven\n13 - The Truck Got Stuck Talkin Blues (featuring Ramblin Jack Elliott) \n\nWikked Canadian country and roots \n\nI will seed for one gig.\n","torrent":{"xt":"urn:btih:cbb6f322ad3c99e72dd4de8e811037fa881b1714","amp;dn":"Corb+Lund++Hair+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbb6f322ad3c99e72dd4de8e811037fa881b1714","infoHashBuffer":{"type":"Buffer","data":[203,182,243,34,173,60,153,231,45,212,222,142,129,16,55,250,136,27,23,20]},"announce":[],"urlList":[]}}