{"title":"Handbook of practical X-ray fluorescence analysis","uid":7837469,"size":566175467,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccfeb20a3584e17625a2b57c170b4fb5d9ead9d2&amp;dn=Handbook+of+practical+X-ray+fluorescence+analysis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"HomesickAlien","files":1,"time":1353239923,"description":"Had to make a screenshot of every page, so the file is large.\n\n\nHandbook of practical X-ray Fluorescence Analysis,\n\nBeckhoff, B.; KanngieÃŸer, B.; Langhoff, N.; Wedell, R.; Wolff, H. (Eds.)\n\nSpringer, 2006, XXIV, 878 p.\n\n\nX-Ray Fluorescence analysis (XRF) is a reliable multi-elemental and nondestructive analytical method widely used in research and industrial applications. This practical handbook provides self-contained modules featuring XRF instrumentation, quantification methods, and most of the current applications. The broad spectrum of topics is due to the efforts of a large number of authors from a variety of different types of institutions such as universities, research institutes, and companies.  The book gives a survey of the theoretical fundamentals, analytical instrumentation, software for data processing, various excitation regimes including gracing incidents and microfocus measurements, quantitative analysis, applications in routine and micro analysis, mineralogy, biology, medicine, criminal investigations, archeology, metallurgy, abrasion, microelectronics, environmental air and water analysis. It gives the basic knowledge on this technique, information on analytical equipment and guides the reader to the various applications. This practical handbook is intended as a resource for graduate students, research scientists, and industrial users.","torrent":{"xt":"urn:btih:ccfeb20a3584e17625a2b57c170b4fb5d9ead9d2","amp;dn":"Handbook+of+practical+X-ray+fluorescence+analysis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccfeb20a3584e17625a2b57c170b4fb5d9ead9d2","infoHashBuffer":{"type":"Buffer","data":[204,254,178,10,53,132,225,118,37,162,181,124,23,11,79,181,217,234,217,210]},"announce":[],"urlList":[]}}