{"title":"MS. TREE (1983-1993) 01-11 and much more (Eclipse, Renegade, DC)","uid":8017958,"size":1009005082,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cd64712640531b6462dbfc6e1ffabc5b6b24541d&amp;dn=MS.+TREE+%281983-1993%29+01-11+and+much+more+%28Eclipse%2C+Renegade%2C+DC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1358139297,"description":"This one's dedicated to the great LeonardTSpock (a.k.a. Mr. Kotter, lol) who uploaded Eclipse Magazine 01-08 several days ago.\n\nThis torrent contains:\n\nMs. Tree 01-11, 14-19, 22, 24, 29-35, 40-42, 44-47 (Various) (1983-1988)\nMs. Tree Quarterly 01-08 (DC Comics) (1990-1992)\nMs. Tree Special 09-10 (DC Comics) (1992-1993)\n\nPlus these odds and ends:\n\nA-V in 3-D 01 (Aaardvark-Vanaheim) (1984) - with the 3-D printing removed\nMs. Tree 3-D 01 (Renegade) (1985) - 2 versions, with and without 3-D\nThe P.I.'s 01-03 (First Comics) (1985)\nMs. Tree Rock and Roll Summer Special (Renegade) (1986)\n\nFor a total of 50 Ms. Tree comics.\n\n------\n\nFrom Wikipedia:\n\nMs. Tree was the best-known comic book creation of author Max Allan Collins prior to his graphic novel, Road to Perdition. Terry Beatty was the series' artist.\n\nThe title character is Michael Tree, a female private detective who takes over her husband's investigation business when he is murdered. In her first case, she captures the murderer and discovers his link to the Muerta organized crime family.\n\nMs. Tree's dead husband was named Michael Tree, the joke being that after the marriage they had the same name. Series creator/writer Max Allan Collins makes no secret of the fact that Ms. Tree was inspired by Velda, Mike Hammer's secretary, a stacked, gun carrying, six-foot tall brunette and Mike's lover, who was almost as tough as he was. The basic premise of Ms. Tree was, &quot;What if Velda and Mike Hammer eventually got married, and on their honeymoon he was murdered?&quot;\n\nThroughout the series, in addition to isolated cases, Ms. Tree's vendetta against the Muerta family is a major plot thread. Her methods often include deadly violence which she uses with little hesitation. In contrast to genre conventions, she faces serious consequences throughout the series for these violent actions including arrest, imprisonment, commitment to a mental hospital, and involuntary medication.\n\nIn another genre divergence, the male Michael Tree's son, Mike (of course), inadvertently falls in love with the daughter of the Muerta matron. The female Michael disapproves of this arrangement but respects her stepson's decision. To her shock, when their relationship grows enough to make marriage probable, the Muerta family decides Mike's stepmother is now family and initiates a reconciliation with her while going legit.\n\nIn addition, Michael is impregnated by an old flame who is manipulating her to kill his wife. She decides to keep the baby, creating a unique series of adventures of this homicidal PI fighting off criminals even while dealing with a full term pregnancy while the mob family she hates moves to protect her in their own way.\n\nAllusions\n\nOne of the series' conceits, often alluded to in the narrative but never acknowledged explicitly in the comic books, is that its title character is the daughter of Dragnet protagonist Joe Friday. In Deadly Beloved we finally see the character, pre-marriage, referred to as &quot;Miss Friday.&quot;\n\nProduction\n\nThe comic book was published by different companies including Eclipse Comics, Aardvark-Vanaheim, Renegade Press and finally, DC Comics.\n\nMs. Tree's introduction and first storyline appeared in the first six issues of Eclipse Magazine, a newsstand-magazine-sized, black-and-white anthology title. Almost all her other appearances were in standard-sized black-and-white comic books; most storylines were multi-issue affairs. A notable exception was DC Comics' Ms. Tree Quarterly (renamed Ms. Tree Special for its last two issues) which was comic-sized but much thicker than a typical comic book, with a much higher page count, and presented a full-color, complete Ms. Tree story in every issue.\n\nThe first three issues of the Eclipse Comics comic book were titled Ms. Tree's Thrilling Detective Stories. This was shortened to Ms. Tree with issue #4.\n\nMs. Tree had a one-issue 3-D comic, called Ms. Tree 3-D.\n\nFirst Comics published a three-issue limited series entitled The P.I.s, a cross-over story featuring Ms. Tree and Michael Mauser.\n","torrent":{"xt":"urn:btih:cd64712640531b6462dbfc6e1ffabc5b6b24541d","amp;dn":"MS.+TREE+%281983-1993%29+01-11+and+much+more+%28Eclipse%2C+Renegade%2C+DC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd64712640531b6462dbfc6e1ffabc5b6b24541d","infoHashBuffer":{"type":"Buffer","data":[205,100,113,38,64,83,27,100,98,219,252,110,31,250,188,91,107,36,84,29]},"announce":[],"urlList":[]}}