{"title":"Handbook of Nonprescription Drugs 16th Ed.pdf","uid":5861149,"size":266866450,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce54263a829e9db9555370a43d90e619a89cbe38&amp;dn=Handbook+of+Nonprescription+Drugs+16th+Ed.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmman","files":1,"time":1285974022,"description":"Review\nThe book is a useful additional resource for those offering advice to patients on treating minor ailments, and the algorithms are particularly helpful. --Laurence A. Goldberg Independent pharmaceutical consultant, Lancashire, EnglandThe Pharmaceutical Journal Online March 2009\n\nProduct Description\nThoroughly updated and revised, the Handbook of Nonprescription Drugs: An Interactive Approach to Self-Care, 16th edition, helps students and practitioners develop problem-solving skills needed to assess and triage a pharmacy patient s medical problems. It provides U.S. Food and Drug Administration-approved dosing information and evidence-based research on the efficacy and safety of over-the-counter and herbal medications.\nKey Features:\nContributors include more than 70 academics and practitioners from multiple health care fields with expertise in non-prescription medications and devices and other self-care options.\nUpdated information and references and new, improved anatomical drawings are included.\nAn enhanced complementary and alternative medicine section provides readers with a broad overview of different healing practices that patients may be using.\nNew information on emergency contraception is provided.\nDisease-oriented chapters contain new and revised case studies, treatment algorithms, comparisons of self-treatments, patient education boxes, product selection guidelines, and tables that list interactions as well as dosage and administration guidelines.\nThe Key Points section at the end of the chapters highlights important concepts.\nFree eBook download with purchase of the textbook makes the entire content fully searchable on your computer. Available on Pharmacy Library. \n\nProduct Details\n\n    * Hardcover: 1050 pages\n    * Publisher: American Pharmacists Association; 16 edition (March 30, 2009)\n    * Language: English\n    * ISBN-10: 1582121222\n    * ISBN-13: 978-1582121222","torrent":{"xt":"urn:btih:ce54263a829e9db9555370a43d90e619a89cbe38","amp;dn":"Handbook+of+Nonprescription+Drugs+16th+Ed.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce54263a829e9db9555370a43d90e619a89cbe38","infoHashBuffer":{"type":"Buffer","data":[206,84,38,58,130,158,157,185,85,83,112,164,61,144,230,25,168,156,190,56]},"announce":[],"urlList":[]}}