{"title":"IconCool Manager v6.20 build 121120 Incl Crack [TorDigger]","uid":7875108,"size":10955575,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ceafd5dcb790dfe9aeb56503654788f73260aa95&amp;dn=IconCool+Manager+v6.20+build+121120+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":3,"time":1354315823,"description":"IconCool Manager\n\nIconCool Manager is an ideal tool to manage, keep, modify, extract, convert, enlarge and contract icons. An icon library with dozens of sample entries is included and accessible through a tree-style organizational system, allowing you to categorize icons and create new classes and sublibraries within them. IconCool Manager includes 1300 sample icons which are free for registered users.\n\nA Powerful Icon Tool\n\nIconCool Manager contains hundreds Windows XP system icons for software development usage. IconCool Manager lets you easily search, extract, convert, create, manage, store, archive, enlarge, reduce and distribute icons. IconCool Manager can easily export icons to CUR, GIF, JPG, PNG, WBMP, EMF, TGA, WMF, TIF and ICL file formats. \n\nA Vista Icon Manager\n\nIconCool Manager has begun to support the next generation OS Window Vista from now on. You can manage Vista icons which include the compressed 256x256 images easily. Now IconCool Manager has been a powerful tool for batch conversions of Vista icons.\n\nAn Icon Library Manager\n\nUse IconCool Manager to sort icons into multiple sub-libraries, such as computer, office, people, animal, art, and so on, as required, to simplify subsequent retrieval. IconCool Manager can create single icon libraries (&quot;One by One&quot;) or sub-libraries (&quot;One in One&quot;), the options are limited only by the available space on your system. IconCool Manager can export a total icon library to a single ICL file. You can search within your icon library using keywords. IconCool makes adding or editing the keywords a simple task.\n\nA Full-Featured Icon Extracter\n\nView and extract all types of icon from within any file, then save them as icons or image files of various sizes. Add them easily to your IconCool libraries.\n\nAn Icon Converter and Creator\n\nYou can create icons by simply converting other graphic files. IconCool Manager can open images in the following formats: BMP; DIB; EMF; GIF; ICB; ICO; JPG; JPEG; PBM; PCD; PCX; PGM; PNG; PPM; PSD; PSP; RLE; SGI; TGA; TIF; TIFF; VDA; VST; WBMP and WMF. IconCool Manager can save images in the following formats: ICO; CUR; ICL; BMP; GIF; JPG; PNG and WBMP. IconCool Manager includes a smart capturing tool. You can capture images easily from your desktop or other software.\n\nA Directory of Icon Web Sites\n\nA third tab includes a large directory of 800 icon web sites, and lets you edit, delete, and add new sites.\n\nSupported OS:\n\nMicrosoft Windows 7, 8, Vista and XP.\n\nHomepage: http://www.iconcool.com/icon-library-manager.htm\n\nInstallation Instructions:\n\n1. Install program.\n2. Copy content from crack folder and paste into default installation directory.\n3. Done, Enjoy.\n","torrent":{"xt":"urn:btih:ceafd5dcb790dfe9aeb56503654788f73260aa95","amp;dn":"IconCool+Manager+v6.20+build+121120+Incl+Crack+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceafd5dcb790dfe9aeb56503654788f73260aa95","infoHashBuffer":{"type":"Buffer","data":[206,175,213,220,183,144,223,233,174,181,101,3,101,71,136,247,50,96,170,149]},"announce":[],"urlList":[]}}