{"title":"DMX/ It's Dark And Hell Is Hot (320kbps)","uid":7533857,"size":67609054,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cefa30e8ce555e40a2187b5758b21cedb7131ff4&amp;dn=DMX%2F+It%27s+Dark+And+Hell+Is+Hot+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"3yadi10","files":-1,"time":1345039887,"description":"It's Dark and Hell is Hot is the debut album of American rapper DMX, released May 19, 1998 on Ruff Ryders Entertainment and Def Jam Recordings.[1] The album featured four singles with music videos, &quot;Get at Me Dog&quot;, &quot;Stop Being Greedy&quot;, &quot;How's It Goin' Down&quot; and the &quot;Ruff Ryders Anthem&quot;. The album is widely considered classic by \nnumerous hip hop fans and critics.\n\nIt's Dark and Hell Is Hot is known for featuring very extreme lyrics about violence with songs like &quot;Intro&quot;,&quot;X Is Coming&quot;, and a lot more. The album is still known for DMX's painful past life when he was younger which is known on &quot;Look Thru My Eyes&quot; and &quot;Let Me Fly&quot;. More topics are included like love, rage, stories, and God. Unlike many hip hop albums DMX features prayers which are dialogues with him and God.\nRolling Stone critic, Miles Marshall Lewis, talked about the lyrics in &quot;X-Is Coming&quot; and he quoted these lines from the song: &quot;If you got a daughter older than fifteen, I'm a rape her/Take her on the living-room floor, right there in fronta you/Then ask you seriously, 'What you wanna do?'&quot;. In his response for his reaction to the extreme violent writing ability of DMX, he answered: &quot;Even within the context of a hardcore rap album, DMX goes beyond the pale&quot;.[3] Some of DMX's most-violent lyrics, inspired by horror, crime, and hardcore rap created a style that would dominate a portion of the rap industry. The earliest examples of these lyrics would be the unreleased songs &quot;Gotti Style&quot; (Featuring Ja Rule), &quot;Read About It&quot; (Featuring Ja Rule), many unreleased freestyles, and his verse on Mic Geronimo's 1995 song &quot;Time To Build&quot; with appearances by an early Jay-Z and Ja Rule.","torrent":{"xt":"urn:btih:cefa30e8ce555e40a2187b5758b21cedb7131ff4","amp;dn":"DMX%2F+It%27s+Dark+And+Hell+Is+Hot+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cefa30e8ce555e40a2187b5758b21cedb7131ff4","infoHashBuffer":{"type":"Buffer","data":[206,250,48,232,206,85,94,64,162,24,123,87,88,178,28,237,183,19,31,244]},"announce":[],"urlList":[]}}