{"title":"Hayek His Contribution to the Political and Economic Thought of","uid":6837541,"size":74045214,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cfff0e839953509da95a5675e4724a564a81ef8b&amp;dn=Hayek+His+Contribution+to+the+Political+and+Economic+Thought+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"softpilo","files":1,"time":1322058567,"description":"Hayek His Contribution to the Political and Economic Thought of Our Time (Unabridged)\n\n\nGenre................: Economics\nAudio Format.........: Advanced Audio Codec\nAudio Channels.......: Mono\nSample Rate..........: 44100 Hz\nBitrate..............: 32 kbps\nDuration.............: 4 hrs 52 min\nSize.................: 70 MB\n\n\nHAYEK by Eamonn Butler read by Jeff Riggenbach 4h51m57s unabridged \nNobel prize-winner F.A. Hayek is one of the great thinkers of the twentieth century, but up to now there has been no book for the non-specialist that describes his ideas and explains their significance. Eamonn Butler's clear, systematic, perceptive study fills this gap. Starting with a short survey of Hayek's life, Dr. Butler goes on to analyze all the main elements in his thought under six basic headings: Understanding How Society Works; The Market Process; Hayek's Critique of Socialism; Criticism of Social Justice; The Institutions of a Liberal Order; and The Constitution of a Liberal State.\n\nDR. EAMONN BUTLER is the director of the Influential UK think-tank, the Adam Smith Institute, where he has spent three decades privatizing state industries, reforming public administrations and instructing government leaders around the world on market economics. With degrees in Economics, Psychology and Philosophy from St Andrews University, Dr Butler is superbly qualified on the mechanics, mentality and morals of markets. His highly readable introductions to free-market thinkers including Adam Smith, Ludwig von Mises, and Nobel economists FA Hayek and Milton Friedman have won wide acclaim and been translated into many languages.\n\nRIGGENBACH, a radio announcer and longtime voiceover artist, has an engaging, authoritative voice. \n","torrent":{"xt":"urn:btih:cfff0e839953509da95a5675e4724a564a81ef8b","amp;dn":"Hayek+His+Contribution+to+the+Political+and+Economic+Thought+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfff0e839953509da95a5675e4724a564a81ef8b","infoHashBuffer":{"type":"Buffer","data":[207,255,14,131,153,83,80,157,169,90,86,117,228,114,74,86,74,129,239,139]},"announce":[],"urlList":[]}}