{"title":"Vray 2.00.24261 for Sketchup 2014","uid":11975453,"size":110453708,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d02449ed91bdc9ca4523e2610c691cb4856a7a87&amp;dn=Vray+2.00.24261+for+Sketchup+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"glaresc","files":2,"time":1432999324,"description":"New Features \n\n Added V-Ray Express installer. \n Made it possible to start an animation rendering at a given frame using the &quot;Frame start&quot; box in the Output panel. You can now render individual frames or ranges of frames. e.g.: 5,100-110, 200, 352. \n Now you can pack all the materials in the V-Ray material. editor by right clicking on the &quot;Scene Materials&quot;. \n Added &quot;GPU device select&quot; to the tools available in our start menu group. \n Modified Features \n\n Modified how users can update proxy paths. We have two options: 1. &quot;Update VRMesh Path&quot; will not alter the component at all, it just changes the path. 2. &quot;Import new VRMesh&quot; will import a new vrmesh and update all instances to use that instead of the existing one. \n Added 16:9 range of default output sizes. \n You can now remove materials from our material editor using the &quot;delete&quot; key. \n TIFF files will now be saved as 16-bit images by default. \n RT view updates are processed in real time to produce faster feedback. \n New VFB channels: \n DR Buckets \n VRayMtl Reflection Glossiness \n VRayMtl Reflection Highlight Glossiness \n VRayMtl Refraction Glossiness \n\n Modified how environment is calculated, this should not affect existing scenes. However the override per material GI is not working. Therefore the option is removed from the UI. \n Added checkbox to only render full material ( as opposed to selected layers ) in material preview. So now you can render the whole material even if you are in a material layer when preview it. \n\nBug Fixes \n\n Fixed issue where &quot;Use color texture alpha as transparency&quot; was not working. \n Fixed window the duplicate material dialog appears behind other window. \n Fixed issue where custom render channels were showing up incorrectly in our channel picker window. \n Fixed issue where material preview would crash during a product or RT render. \n Fixed issue that caused image sampler filter to not function as expected. \n Fixed issue where DR nodes would occasionally hang during animations - this fix requires updating DR spawners! \n Using ctrl+a to select all VFB Channels in our UI should now work as expected. \n Changing the path of a proxy's vrmesh file, no longer will regenerate the preview mesh, unless the vrmesh is different. \n Changing the path of a proxy will no longer alter the transform of the parent component instance. \n Fixed issue that could cause DR renders to hang when attempting to cancel, especially in scenes with proxies or displacement. \n Fixing issue that caused toon materials to crash or stall RT renders. \n Fixed issue where sun light was being disabled by default. \n Fixed issue where emissive layer color was not being properly gamma corrected in some cases. \n Fixed issue where an object without toon material get toon lines if they are camera intercepting the objects with toon material. \n Fixed the issue where enabling bump mapping without supplying a map affect the render and produce unacceptable result. \n Fixed issue where material custom channels could cause an RT crash when updated. \n Fixed issue that could cause crash when an RT render finishes if certain options were modified. \n Fixed issue where loading options during RT would cause VFB to get pixelated. \n We now install to a spot that will allow all OSX user to use Sketchup 14. \n Fixed issue with override materials and unicode material names. \n Fixed issue that would cause installations to non-standard paths of Sketchup ( anywhere but c:Program Files, etc ) to not install properly for Sketchup 2014. \n Fixed issue where incorrect tooltip was displayed for file browser controls. \n Added &quot;GPU device select&quot; to the tools available in our start menu group. \n Modified Lens effects to default to a glare type of &quot;from camera parameters&quot; rather than &quot;from image&quot;. \n Fixed issue where reflection maps were affecting other layers even if reflections were globally disabled. \n Added support for indexed tga files. \n Fixed issue where &quot;V-Ray material&quot; types were not possible to override with override material. \n Fixed issue where RT region render was not working. \n Altered how the Material ID and Node ID render channels work, they should have been integer channels instead of color. \n they should no longer be affected by transparency \n\n Reworked how we allowed environment repeat to work better - we now expose a separate texture transformation for UVWGenEnvironment. \n Fixed issue where reflection exit color was being used even if &quot;Enable exit color&quot; was turned off. \n Fixed issue where environment repeat was not working as expected. \n Fixed issue where RT CPU renders did not have Alpha channel set properly. \n Fixed issue where RT renders were being stopped even if the user did not specify &quot;Stop when render done&quot;. \n Fixed issue where the V-Ray channel had the wrong color mapping","torrent":{"xt":"urn:btih:d02449ed91bdc9ca4523e2610c691cb4856a7a87","amp;dn":"Vray+2.00.24261+for+Sketchup+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d02449ed91bdc9ca4523e2610c691cb4856a7a87","infoHashBuffer":{"type":"Buffer","data":[208,36,73,237,145,189,201,202,69,35,226,97,12,105,28,180,133,106,122,135]},"announce":[],"urlList":[]}}