{"title":"The Beatles - A Collection Of Beatles Oldies [320k MP3]","uid":7730723,"size":188970236,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d092c2b305059b4b7736a3e57938f83dfce057ef&amp;dn=The+Beatles+-+A+Collection+Of+Beatles+Oldies+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smbdownload","files":-1,"time":1350330773,"description":"A Collection of Beatles Oldies (subtitled But Goldies!) is a compilation album featuring a selection of songs by The Beatles recorded between 1963 and 1966. The album was released in the United Kingdom and Australia in both mono (catalogue number PMC 7016) and stereo (PCS 7016.)\n\nThe release of this album was the result of EMI not having any new material by the Beatles for the 1966 Christmas season in the manner of the previous three years.\n\nThe sole new track, a cover of Larry Williams' &quot;Bad Boy&quot;, had not yet appeared on a Beatles LP in the UK, but had already been released in the United States on the Capitol album Beatles VI.\n\nThe album only reached number 6 in the UK album chart,[2] perhaps because most fans already owned most of the tracks on other releases. However, the album continued to sell reasonably well, remained in print for many years, and was only deleted when the compact disc age approached (and made obsolete by the Past Masters compilations). It was also the longest album that the Beatles had released to that point, totaling almost 40 minutes of music.\n\nIt is noteworthy that six of the tracks on this LP (&quot;From Me to You&quot;, &quot;We Can Work It Out&quot;, &quot;I Feel Fine&quot;, &quot;Day Tripper&quot;, &quot;Paperback Writer&quot; and &quot;I Want to Hold Your Hand&quot;) make their debut here as both album tracks (they were previously issued only as singles) and with stereo mixes (some done so especially for this compilation). &quot;She Loves You&quot; also made its debut on a long-playing record here, but it was a re-processed stereo mix, as the multi-track tape had vanished and remains missing to this day. The song is complete on both the first pressing mono and stereo issues, the Fame budget label reissue from the 1980s, and the resequenced pre-recorded cassette.\n\nThe cover of this album contributed to the &quot;Paul is dead&quot; hoax as the road shown on the cover seems to lead into the head of the man sitting on the cover.\n\nBOTH STEREO AND MONO VERSIONS - Track Listing [320k MP3]\n\n    &quot;She Loves You&quot;\n    &quot;From Me to You&quot;\n    &quot;We Can Work It Out&quot;\n    &quot;Help!&quot;\n    &quot;Michelle&quot;\n    &quot;Yesterday&quot;\n    &quot;I Feel Fine&quot;\n    &quot;Yellow Submarine&quot;\n    &quot;Can't Buy Me Love&quot;\n    &quot;Bad Boy&quot; (Larry Williams)\n    &quot;Day Tripper&quot;\n    &quot;A Hard Day's Night&quot;\n    &quot;Ticket to Ride&quot;\n    &quot;Paperback Writer&quot;\n    &quot;Eleanor Rigby&quot;\n    &quot;I Want to Hold Your Hand&quot;\n","torrent":{"xt":"urn:btih:d092c2b305059b4b7736a3e57938f83dfce057ef","amp;dn":"The+Beatles+-+A+Collection+Of+Beatles+Oldies+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d092c2b305059b4b7736a3e57938f83dfce057ef","infoHashBuffer":{"type":"Buffer","data":[208,146,194,179,5,5,155,75,119,54,163,229,121,56,248,61,252,224,87,239]},"announce":[],"urlList":[]}}