{"title":"Oscar Brown Jr - Sin &amp; Soul...and then Some! - Rovhal_Knullare","uid":4427553,"size":68345317,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d0d6c84f716f8923addb4adef05a98128ef5eafd&amp;dn=Oscar+Brown+Jr+-+Sin+%26+Soul...and+then+Some%21+-+Rovhal_Knullare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rovhal_knullare","files":-1,"time":1223117156,"description":"** Oscar Brown Jr. ** \n** Sin &amp; Soul...And Then Some ** \n\n\nOscar Brown, Jr (October 10, 1926 - May 29, 2005) was a singer, \nsongwriter, playwright, poet, and civil rights activist. He ran for \noffice in the Illinois state legislature and U.S. Congress, both \nunsuccessfully.\n\nMr. Brown was most often described as a jazz singer, and he initially \nachieved fame by putting lyrics to well-known jazz instrumentals like \nMiles Davis's &quot;All Blues&quot; and Mongo Santamaria's &quot;Afro Blue,&quot; but \nefforts to categorize him usually failed. As a performer, he acted his \nsongs more than he sang them; as a songwriter, he drew as much from \ngospel, the blues and folk music as he did from jazz. He preferred to \ncall himself an entertainer, although even that broad term did not go \nfar enough: he saw his art as a way to celebrate African-American life \nand attack racism, and it was not always easy to tell where the \nentertainer ended and the activist began.\n\nHis song &quot;Brown Baby,&quot; recorded by Mahalia Jackson and others, was both \na lullaby for his infant son and an anthem of racial pride. Other songs, \nlike &quot;Signifying Monkey&quot; and &quot;The Snake,&quot; took their story lines from \nblack folklore. The album &quot;We Insist! Freedom Now Suite,&quot; for which Mr. \nBrown wrote lyrics to the drummer Max Roach's music, was one of the \nfirst jazz works to address the civil rights movement. \n\nHis commitment to art as a tool for change was most evident in the \nnumerous stage shows he wrote and directed in his native Chicago, which \naddressed social issues and often had poor black teenagers in their \ncasts. The most famous of these shows, &quot;Opportunity, Please Knock,&quot; was \ncreated in 1967 with members of the Blackstone Rangers, a street gang. \nHis most recent production was a 2002 revival of &quot;Great Nitty Gritty,&quot; a \nshow about gang violence that he had first staged 20 years earlier with \nyoung residents of the Cabrini Green housing project... \n\n\nTracks:\n     \n1. Work Song    \n2. But I Was Cool   \n3. Bid 'Em In   \n4. Signifyin' Monkey   \n5. Watermelon Man   \n6. Somebody Buy Me A Drink    \n7. Rags And Old Iron   \n8. Dat Dere    \n9. Brown Baby  \n10. Humdrum Blues  \n11. Sleepy  \n12. Afro-Blue  \n13. Mr. Knicks   \n14. Hazel's Hips \n15. World Of Grey  \n16. Forbidden Fruit  \n17. Straighten Up And Fly Right \n\nReview:\n\nOscar Brown, Jr. may not have been the first jazz singer-songwriter \n(Mose Allison, among others, precedes him), but he certainly helped to \nusher in the notion of the political/protest singer-songwriter, \npredating Bob Dylan with this 1960 debut album. Years before Sly Stone \nor Gil Scott-Heron detailed the travails of black life in white America, \nBrown was serving up such tunes as &quot;Bid 'Em In,&quot; where the narrator is \nan unrepentant slave auctioneer, and &quot;Work Song,&quot; which added a lyric \nabout the results of ghetto-ization to Nat Adderly's famous tune. \nBrown's worldview was far from bleak, though. SIN &amp; SOUL is also full of \nhumor-filled tunes that bring to mind the best work of Louis Jordan or \nSlim Gaillard. &quot;Dat Dere,&quot; delivered in a toddler's voice, parodies \nyoung children's ceaseless curiosity, while &quot;But I Was Cool&quot; is an \nuproarious account of a man on the verge of blowing his stack. Beyond \nboth humor and protest, Brown also wrote some straight-up jazz \nstandards, including the swinging &quot;Straighten Up and Fly Right&quot; and \n&quot;Afro Blue&quot; (a regal lyric added to the Coltrane tune), both of which \nwould be performed by countless jazz artists over the years.\n\nKeep seeding if you want to fly right.\n\nMore kickass torrents(I only post what I can't find them anyplace else):  &lt;a href=&quot;\nhttp://www.thepiratebay.se/user/rovhal_knullare&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thepiratebay.se/user/rovhal_knullare&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d0d6c84f716f8923addb4adef05a98128ef5eafd","amp;dn":"Oscar+Brown+Jr+-+Sin+%26+Soul...and+then+Some%21+-+Rovhal_Knullare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0d6c84f716f8923addb4adef05a98128ef5eafd","infoHashBuffer":{"type":"Buffer","data":[208,214,200,79,113,111,137,35,173,219,74,222,240,90,152,18,142,245,234,253]},"announce":[],"urlList":[]}}