{"title":"Lange Armstrong - Legends of the Tour de France, Road to Paris,","uid":3843360,"size":2559041486,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d11a5f5023c2bbc0e3cd0790f146adec746c8583&amp;dn=Lange+Armstrong+-+Legends+of+the+Tour+de+France%2C+Road+to+Paris%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"decibell","files":4,"time":1192480238,"description":"Lance Armstrong:\n\n1. Legends of the Tour de France (06/07/06)\nLance Armstrong. Tour de France winner 1999, 2000, 2001, 2002, 2003, 2004, 2005.\n\nNarrated by Phil Liggett, this sensational double DVD, captures one of sports most incredible achievements - Lance Armstrong&amp;#039;s seven Tour de France victories.\nIn 1996 he was diagnosed with testicular cancer that spread to all parts of his body and a cancer from which he was given as little as 3% chance of recovery.\nIt is an amazing story of utter dominance. Armstrong&amp;#039;s true comeback came in 1999, when he won his first Tour de France. His final lead times over his closest competitor have been over six minutes every year except for 2003 and 2005. In 2003, he finished 1:01 ahead of Jan Ullrich, following an unusual set of circumstances including a stomach illness at the onset of the race, and in 2005, he finished 4:40 ahead of Ivan Basso. In addition to his seven overall wins, he has won 22 individual stages, 11 time trials and his team has won the team time trial three times (2003-2005).\n\n2. Road to Paris + bonus\nThe 52-minute European version of the groundbreaking documentary covering Lance Armstrong and the 2001 U.S. Postal Team over 27 days in April as they prepare to win a third consecutive Tour de France. Never-before-seen footage takes you inside team meetings and along for the ride in the team car during some of cycling&amp;#039;s greatest races, including a down-to-the-wire Amstel Gold Race and the most hellish Paris-Roubaix in years. Unprecedented access to Lance allows us to follow him on reconnaissance rides in the Alps, on the very stages that would come to mark his dominating performance in July. Road to Paris also explores the strategic thinking of one of cycling&amp;#039;s top directeurs, Johan Bruyneel. For both the avid cyclist and the casual fan, this DVD provides a rare look into the world of professional cycling. The DVD also includes 47 minutes of bonus footage and profiles of the 2001 U.S. Postal Team riders. Approx. 100 minutes\n\n3. The Ride of a Lifetime (OLN 2005)\nOne hour long interview on the OLN Network.\n\n","torrent":{"xt":"urn:btih:d11a5f5023c2bbc0e3cd0790f146adec746c8583","amp;dn":"Lange+Armstrong+-+Legends+of+the+Tour+de+France%2C+Road+to+Paris%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d11a5f5023c2bbc0e3cd0790f146adec746c8583","infoHashBuffer":{"type":"Buffer","data":[209,26,95,80,35,194,187,192,227,205,7,144,241,70,173,236,116,108,133,131]},"announce":[],"urlList":[]}}