{"title":"Gnomon Master Classes 2011","uid":7159328,"size":11922030945,"categoryP":"video","categoryS":"3d","magnet":"?xt=urn:btih:d1ad1996602145799872afd76f78ca07f937665f&amp;dn=Gnomon+Master+Classes+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"CarloGVV","files":172,"time":1333558673,"description":"The Making of &quot;Dirge&quot;\n\nInstructor: Alex Alvarez\n\nIn this master class, Alex Alvarez will discuss the creation of Dirge, \nhis hellish new animated personal image. Created as an animated loop at \n2560x1600 for viewing on a 30&quot; framed display, Dirge was created using \nMaya, ZBrush, Photoshop, After Effects and Mental Ray. The entire \nworkflow will be explored, including character and environment design, \neffects, animation, lighting and compositing.\n\n\n\n\n\n\nCreating Realistic Skin with Mari\n\n\nInstructor: Gareth Jensen\n\nThis class will focus on painting high-resolution organic texture maps \nfor film industry production, utilizing the remarkably powerful and \nversatile texture painting software Mari. Gareth will demonstrate a \nrange of tricks and techniques that he often utilizes to create the \nvarious qualities of lifelike and believable skin.\n\nGareth will take a sculpted bust by character designer Scott Spencer \nfrom start to finished render. In addition to demonstrating the tools \nand his workflow, Gareth will be covering topics such as the importance \nof reference and the qualities of different regions of skin.\n\n\n\n\n3D Design for Production&quot;\n\n\nInstructor: Vitaly Bulgarov\n\nIn this lecture, Vitaly Bulgarov shows his process of creating a fully \nrendered 3D design for production-oriented pipelines. Using the example \nof an alien bust, Vitaly goes through the main steps of creating a \nsci-fi character design from scratch.\nHe\nbegins by making a quick bust sketch in ZBrush. He then creates a \ndetailed suit design in XSI using the block-out as a guideline for the \nproportions of the alien bust. By doing this, Vitaly shows the \ntechniques and tools he uses to create complicated surfaces like \nmulti-layered metal plates, rubber pads, tubes, and attachments. Solving\ndesign on the fly, without making any preliminary sketches, he builds a\nfully detailed mesh for the helmet and suit, explaining why certain \ndesign decisions are made.\nOnce the \nmodel is complete, Vitaly takes it into Keyshot for raytrace rendering \nand then brings the renders to Photoshop to finalize the design, push \nthe overall look and bring more personality to the character by adding \nfinal textures and detail enhancements.","torrent":{"xt":"urn:btih:d1ad1996602145799872afd76f78ca07f937665f","amp;dn":"Gnomon+Master+Classes+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1ad1996602145799872afd76f78ca07f937665f","infoHashBuffer":{"type":"Buffer","data":[209,173,25,150,96,33,69,121,152,114,175,215,111,120,202,7,249,55,102,95]},"announce":[],"urlList":[]}}