{"title":"Gram Parsons - Under Your Spell Again","uid":4626206,"size":266357864,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d2367c89ce445c14eb18f7d4aeee279e33d5ef6d&amp;dn=Gram+Parsons+-+Under+Your+Spell+Again&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bozo71","files":-1,"time":1231221341,"description":"Gram Parsons - Under Your Spell Again\n\nVBR Winamp Rip\n\n\nAll Music Guide\n\nDespite wildly inconsistent sound quality, and several performances of interest only to the hardest of hardcore fans, this two-disc bootleg is one of the few truly comprehensive portraits of the career of Gram Parsons, offering rare and often fascinating recordings from every stage of his career.  The set opens with a rough, splicey, but historically priceless tape of Parsons and his teenage band the Legends rocking out on Little Richard's &quot;Rip It Up&quot;; whoever is playing guitar offers up a killer solo, indicating Parsons had already learned the importance of surrounding himself with gifted musicians.  Next up is the International Submarine Band's rare 1967 single on Columbia; this was before the group dove head-first into country, and the excellent A-side, &quot;Sum Up Broke,&quot; sounds like a cross between 5D-era Byrds and early Moby Grape.  The flip, &quot;One Day Week,&quot; rocks pretty hard while suggesting Parsons' country western-tinged melodic sense was just about to emerge.  These cuts are followed by eight songs from a muddy audience tape of Parsons performing with the Byrds in London in 1968 (despite what the liner notes say, this wasn't Parson' last show with the band, although it was close to the end of the line); you're probably better off listening to Sweetheart of the Rodeo for most of this segment, though the final three songs, with Parsons on organ, give a much clearer picture of what his role in the band was originally intended to be.  Next up is a six-song set with the Flying Burrito Brothers from 1969's ~Seattle Pop Festival; the sound is OK (it sounds hi-fi compared to the Byrds cuts that precede it), while the performance is focused on covers, the highlight being a great rocked-up version of Roy Orbison's &quot;Sweet Dreams Baby.&quot; Disc one closes out with the Burritos playing for a less than attentive audience at Hollywood's home of country music, ~the Palomino Club; it must have been their appearance that put off the crowd, because the band sounds fine and the recording is clear and well-balanced, if a bit boomy.  Disc two leads off with a solo recording from Parsons' tenure with the Shilos; this is Parson in strict folky mode, and it's an adequate substitute for unreleased recordings from that group.  The next six tunes are the set's highlight; 1972 acoustic demos of songs that would later appear on G.P., and if the audio is only a few steps up from &quot;boom box in someone's living room,&quot; the performances are warm, heartfelt, and utterly priceless, especially on &quot;How Much I Lied&quot; and &quot;A Song for You.&quot; Next, Parsons, Emmylou Harris, and N.D.  Smart II stop by a Boston radio station to plug both G.P.  and an upcoming local gig while Parsons and Emmylou swap lovely harmonies on two covers and Smart cracks some funny jokes; the opening chat is quite amusing as Parsons discusses his problems with record companies and life on the road.  After a detour back to the Burritos era, with cuts from concerts in San Francisco (a place Parsons calls &quot;the jivest town in the world&quot; in a ~Crawdaddy interview reprinted in the liner notes) and North Hollywood (another night from the same stand at ~the Palomino), you're treated to some cuts from a Houston, TX, date on Parsons' final tour with the Fallen Angels that sound tighter a good bit more energetic than the set preserved on the Live 1973 album (especially &quot;Six Days on the Road&quot;), though the sound quality is only fair.  And finally, the set closes out with two alternate mixes of cuts from Grievous Angel rescued from lightly noisy but still listenable discs; neither is strikingly different, but they're still fine to hear.  The set's packaging is splendid by bootleg standards, with a handful of rare photos of Parsons on stage with his various bands in the accompanying booklet and a handsomely printed gatefold LP-style folder (with equally attractive printed inner sleeves).  Despite the breadth of Parsons' career and his continuing influence, no one has seen fit to compile a box set of his best material, or even release a reasonably complete single-disc sampler in the United States ( Rhino Records, are you listening?), so for fans, Under Your Spell Again is especially valuable; it not only preserves a number of worthy performances from country-rock's single most important artist, but offers a better perspective on the many facets of his career than any authorized set has done to date.\n\n- Mark Deming, All Music Guide\n\nTracklist\n\n1 \tRip It Up \t\n2 \tSum Up Broke \t\n3 \tOne Day Week \t\n4 \tHickory Wind \t\n5 \tSing Me Back Home \t\n6 \tThe Christian Life \t\n7 \tUnder Your Spell Again \t\n8 \tYou Don't Miss Your Water \t\n9 \tEight Miles High \t\n10 \tSpace Odyssey \t\n11 \tTribal Gathering \t\n12 \tSin City \t\n13 \tTake A Message To Mary \t\n14 \tShe Thinks I Still Care \t\n15 \tChristine's Tune \t\n16 \tSweet Dreams Baby \t\n17 \tWake Up Little Susie \t\n18 \tBuckaroo \t\n19 \tAnother Place,Another Time \t\n20 \tHigh On A Hilltop \t\n21 \tShe Once Lived Here \t\n22 \tHot Burrito No1 \t\n23 \tEveryone Loves A Winner \t\n24 \tRace With The Wind \t\n25 \tHow Much I Lied \t\n26 \tThe New Soft Shoe \t\n27 \tStill Feeling Blue \t\n28 \tA Song For You \t\n29 \tBig Mouth Blues \t\n30 \tKiss The Children \t\n31 \tFallen Angels \t\n32 \tWidowmaker \t\n33 \tLove Hurts \t\n34 \tSin City \t\n35 \tYour Still On My Mind \t\n36 \tUndo The right/Somebody's Back In Town \t\n37 \tLucille \t\n38 \tI Threw Away The Rose \t\n39 \tTrain Song \t\n40 \tSix Days On The Road \t\n41 \tClose Up The Honkytonks \t\n42 \tWe'll Sweep Out The Ashes In The Morning \t\n43 \tReturn Of The Grievous Angel \t\n44 \tHearts On Fire\n","torrent":{"xt":"urn:btih:d2367c89ce445c14eb18f7d4aeee279e33d5ef6d","amp;dn":"Gram+Parsons+-+Under+Your+Spell+Again","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2367c89ce445c14eb18f7d4aeee279e33d5ef6d","infoHashBuffer":{"type":"Buffer","data":[210,54,124,137,206,68,92,20,235,24,247,212,174,238,39,158,51,213,239,109]},"announce":[],"urlList":[]}}