{"title":"The Jackson 5-5 albums","uid":4697375,"size":510771507,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d341e51cd0f89e039b406c8bada5861ac713c5e8&amp;dn=The+Jackson+5-5+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1233602536,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nThe Jackson 5 (also spelled The Jackson Five or The Jackson 5ive, and later known as The Jacksons) was a two-time Grammy Award-nominated American popular music family group from Gary, Indiana. Founding group members Jackie, Tito, Jermaine, Marlon and Michael formed the group after performing in an early incarnation called The Jackson Brothers, which originally consisted of a trio of the three older brothers. Active from 1966 to 1990, the Jacksons played from a repertoire of R&amp;B, soul, pop and later disco. During their six-year Motown tenure, The Jackson 5 were one of the biggest pop-music phenomenons of the 1970s, and the band served as the launching pad for the solo careers of their lead singers Jermaine and Michael, the latter brother later exploiting his early Motown solo fame to greater success as an adult artist.\nThe Jackson 5 were the first act in recorded history to have their first four major label singles (&quot;I Want You Back&quot;, &quot;ABC&quot;, &quot;The Love You Save&quot;, and &quot;I'll Be There&quot;) reach the top of the American charts. Several later singles, among them &quot;Mama's Pearl&quot;, &quot;Never Can Say Goodbye&quot; and &quot;Dancing Machine&quot;, were Top 5 pop hits and number-one hits on the R&amp;B singles chart. Most of the early hits were written and produced by a specialized songwriting team known as &quot;The Corporation&quot;; later Jackson 5 hits were crafted chiefly by Hal Davis, while early Jacksons hits were compiled by the team of Gamble and Huff before The Jacksons began writing and producing themselves in the late-1970s.\nSignificantly, they were the first black teen idols to appeal equally to white audiences thanks partially to the successful promotional relations skills of Motown CEO Berry Gordy. Upon their departure from Motown for CBS in 1976, The Jacksons were forced to change their name and replace Jermaine (who remained at Motown) with younger brother Randy. After two years under the Philadelphia International Records label, they signed with Epic Records and asserted control of their songwriting, production, and image, and their success continued into the 1980s with hits such as &quot;Shake Your Body (Down to the Ground)&quot; and &quot;State of Shock&quot;. Their 1989 album 2300 Jackson Street was recorded without Michael and Marlon. Michael and Marlon did appear, however, on the title track. The disappointing sales of the album led to the group being dropped by their record label at the end of the year. The group has never formally broken up, but has been dormant since then, although all six brothers performed together at two Michael Jackson tribute concerts in September 2001\n\n","torrent":{"xt":"urn:btih:d341e51cd0f89e039b406c8bada5861ac713c5e8","amp;dn":"The+Jackson+5-5+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d341e51cd0f89e039b406c8bada5861ac713c5e8","infoHashBuffer":{"type":"Buffer","data":[211,65,229,28,208,248,158,3,155,64,108,139,173,165,134,26,199,19,197,232]},"announce":[],"urlList":[]}}