{"title":"Howe-Confessions of a Monopolist(1977)","uid":4615970,"size":404821,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d45e4f95871927ca2dacb2e9c038d695d5aa75a9&amp;dn=Howe-Confessions+of+a+Monopolist%281977%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1230840407,"description":"This is Frederic C. Howe's shocking book The Confessions of a Monopolist (1977) which presents a real-life fictional account of how to attain monopoly control by using politics to further one's aims in business. Howe (1867 - 1940) was a Progressive Reformer from Ohio who was active in Cleveland city politics and state politics as a senator. First published in 1906 it tells the story of a monopolist William B. Palmer from his start as a lazy and indolent student to his eventual role in controlling both political parties of his city and his intrigues on Wall Street. Howe writes that &quot;This is the story of something for nothing - of making the other fellow pay. This making the other fellow pay, of getting something for nothing, explains the lust for franchises, mining rights, tariff privileges, railway control, tax evasions. All these things mean monopoly, and all monopoly bottomed on legislation.&quot; The story shows how monopolists manipulate the system by making society work for them, by entering politics, and how the ultra-rich on Wall Street manipulate the stock market. The author notes that the goal is to &quot;get society to work for you&quot; and through this means attain a monopoly. Confessions of a Monopolist is the story of a man who stumbles upon the secret of power politics and the modus operandi of the financial elite. This rare book clearly shows how monopolists manipulate the system through politics. 170 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:d45e4f95871927ca2dacb2e9c038d695d5aa75a9","amp;dn":"Howe-Confessions+of+a+Monopolist%281977%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d45e4f95871927ca2dacb2e9c038d695d5aa75a9","infoHashBuffer":{"type":"Buffer","data":[212,94,79,149,135,25,39,202,45,172,178,233,192,56,214,149,213,170,117,169]},"announce":[],"urlList":[]}}