{"title":"Delta Farce (2007) Nl Subs RETAIL SAM TBS","uid":9028643,"size":4356572500,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d4f4411683cf48c3b9d03c214e912a6b3e2c5ae1&amp;dn=Delta+Farce+%282007%29+Nl+Subs+RETAIL+SAM+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sammynet","files":-1,"time":1381414471,"description":"Delta Farce (2007)\n\nDutch\nDrie reservisten worden door het leger gemobiliseerd en naar Irak gestuurd. Wanneer hun\ntransportvliegtuig in een zware storm terechtkomt, worden zij, samen met hun drilsergeant,\ngedropt boven Mexico. Terwijl zij denken in Irak te zijn geland, beginnen zij met hun militaire\nacties en als eerste zuiveren zij een Mexicaans dorpje van bandieten. Deze bandieten, die de\ndorpsbewoners terroriseren, behoren tot de bende van Carlos Santana. Nee, hij is niet de\nzanger, maar de grootste schurk van heel Mexico.\n\nEnglisch\nWhen a hard-luck blue-collar worker and his two best friends are mistaken for Army Reservists\nby a tough-talking Army sergeant, the plane set to fly them to the front lines of Iraq\nmistakenly drops them in the middle of Mexico to disastrous results in a freewheeling military\ncomedy starring Larry the Cable Guy, Bill Engvall, and D.J. Qualls. Larry (the Cable Guy) has\nlost his job and his woman in the short span of 24 hours. Convinced that some suds and target\nshooting are just the right remedies for a broken, jobless heart, Larry sets out with his\nnext-door neighbor Bill (Engvall) and their trigger-happy pal Everett (Qualls) in order to\nblast off some rounds and down some brews. Their relaxing weekend soon takes an unexpected\nturn, however, when hard-case Army sergeant Kilgrove (Keith David) mistakes the trio as\nslacking Army reservists and loads them in a plane bound for Fallujah. Subsequently\nair-dropped over Mexico due to pilot error, the clueless, wannabe war heroes become convinced\nthat they're actually in the Middle East and set out to save a rural village from what they\nassume to be an insurgent uprising. Though the thankful locals champion the noble but dimwitted\ntrio for their heroism, the celebration is short-lived as ruthless warlord Carlos Santana\n(Danny Trejo) pays a personal visit to the town with a plan to confront the fearless warriors\nwho dared to challenge his iron-fist rule\n\nSpot Information\nSource............: RETAIL\nFormaat...........: DVD5\nVideo.............: PAL / 16:9\nGenre.............: Action / Adventure / Comedy\njaar uitgave......: 2007\nCover &amp; label.....: Yes\nSubtitles.........: Dutch\nAudio.............: Englisch\nSpeelduur.........: 90 minutes\nSize..............: 4,5 GB\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0800003/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0800003/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/14320&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/14320&lt;/a&gt;\n\nSeeden wordt op prijs gesteld, om deze torrent in leven te houden\n\nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:d4f4411683cf48c3b9d03c214e912a6b3e2c5ae1","amp;dn":"Delta+Farce+%282007%29+Nl+Subs+RETAIL+SAM+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4f4411683cf48c3b9d03c214e912a6b3e2c5ae1","infoHashBuffer":{"type":"Buffer","data":[212,244,65,22,131,207,72,195,185,208,60,33,78,145,42,107,62,44,90,225]},"announce":[],"urlList":[]}}