{"title":"Michael Jackson - Give In To Me","uid":4981537,"size":194066436,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d5e1633c6ad4679f255b4180f4d316b874d70d11&amp;dn=Michael+Jackson+-+Give+In+To+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1246340224,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Give In to Me&quot; is the tenth track on Michael Jackson's 1991 studio album Dangerous. The single peaked at #1 in New Zealand for 4 consecutive weeks, and at #2 on the UK Singles Chart. It features former Guns N' Roses lead guitarist Slash. The single was never released in North America or Asia.\n\nThe single release is notable for its B-sides, which include the album versions of &quot;Dirty Diana&quot; and &quot;Beat It&quot;, two songs which also include guest appearances by rock guitarists (Steve Stevens and Eddie Van Halen, respectively).\n\nThe music video for &quot;Give In to Me&quot; features Michael Jackson performing the song on stage with former Guns N' Roses members Slash, Gilby Clarke and Guns N' Roses touring keyboardist Teddy Andreadis at an indoor rock concert. According to Jackson - when he was interviewed by Oprah - it was shot in just about 2 hours in Germany. The pyrotechnics appearing on the video are computer generated and were added later on.\n\nDangerous is the eighth album by Michael Jackson, released on November 26, 1991. It became his second to debut at #1 on the Billboard 200 album chart, where it spent the next four consecutive weeks. In the space of 17 years, the record has sold over 32 million copies worldwide, with 7 million shipments in the United States alone, making it a faster selling album than his previous record Bad. The album won one Grammy for Best Engineered Album - and is the most successful new jack swing album of all time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt; ","torrent":{"xt":"urn:btih:d5e1633c6ad4679f255b4180f4d316b874d70d11","amp;dn":"Michael+Jackson+-+Give+In+To+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5e1633c6ad4679f255b4180f4d316b874d70d11","infoHashBuffer":{"type":"Buffer","data":[213,225,99,60,106,212,103,159,37,91,65,128,244,211,22,184,116,215,13,17]},"announce":[],"urlList":[]}}