{"title":"Confidence Game: How Hedge Fund Manager Bill Ackman Called Wall","uid":9404709,"size":270081884,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d60717a9f60ad3356d3b8e1d2ca4b00c12b4158e&amp;dn=Confidence+Game%3A+How+Hedge+Fund+Manager+Bill+Ackman+Called+Wall+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"aksljdf","files":4,"time":1388135294,"description":"This is first 10.5 hours of the audiobook. I could not find the last 3 hours of the book. Please feel free to add Part 4 if you can find it. Enjoy!\n\n\nSummary:\nAn expose on the delusion, greed, and arrogance that led to America's credit crisis\nThe collapse of America's credit markets in 2008 is quite possibly the biggest financial disaster in U.S. history. Confidence Game: How a Hedge Fund Manager Called Wall Street's Bluff is the story of Bill Ackman's six-year campaign to warn that the $2.5 trillion bond insurance business was a catastrophe waiting to happen. Branded a fraud by the Wall Street Journal and New York Times, and investigated by Eliot Spitzer and the Securities and Exchange Commission, Ackman later made his investors more than $1 billion when bond insurers kicked off the collapse of the credit markets.\n\nUnravels the story of the credit crisis through an engaging and human drama\nDraws on unprecedented access to one of Wall Street's best-known investors\nShows how excessive leverage, dangerous financial models, and a blind reliance on triple-A credit ratings sent Wall Street careening toward disaster\nConfidence Game is a real world &quot;Emperor's New Clothes,&quot; a tale of widespread delusion, and one dissenting voice in the era leading up to the worst financial disaster since the Great Depression.","torrent":{"xt":"urn:btih:d60717a9f60ad3356d3b8e1d2ca4b00c12b4158e","amp;dn":"Confidence+Game%3A+How+Hedge+Fund+Manager+Bill+Ackman+Called+Wall+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d60717a9f60ad3356d3b8e1d2ca4b00c12b4158e","infoHashBuffer":{"type":"Buffer","data":[214,7,23,169,246,10,211,53,109,59,142,29,44,164,176,12,18,180,21,142]},"announce":[],"urlList":[]}}