{"title":"Scientists as Prophets: A Rhetorical Genealogy (2013) {=IMPAVIDU","uid":11118886,"size":1897569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d787ce5e25e38010e18abebeb99a45f590ba3c9e&amp;dn=Scientists+as+Prophets%3A+A+Rhetorical+Genealogy+%282013%29+%7B%3DIMPAVIDU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1411890097,"description":"Book Description:\n\nWhy did an atheist like Carl Sagan talk so much about God? Why does NASA climatologist James Hansen plead with us in his recent book not to waste &quot;Our Last Chance to Save Humanity&quot;? Because science advisors are our new prophets, Lynda Walsh argues in Scientists as Prophets: A Rhetorical Genealogy. She does not claim, as some scholars have, that these public scientists push scientism as a replacement for religion. Rather, she puts forth the provocative argument that prophetic ethos is a flexible type of charismatic authority whose function is to manufacture certainty. Scientists aren't our only prophets, Walsh contends, but science advisors predictably perform prophetic ethos whenever they need to persuade their publics to take action or fund basic research. \n\nWalsh first charts the genealogy of this hybrid scientific-prophetic ethos back to its roots in ancient oracles before exploring its flourishing in 17th century Europe. She then tracks its performances and mutations through several important late-modern events in America: Robert Oppenheimer's role in the opening of the atomic age; Rachel Carson's interventions in pesticide use; the mass-media polemics of science popularizers such as Carl Sagan, Stephen Hawking, and Stephen Jay Gould; and finally the UN's climate change panel and their role in Climategate. Along the way, Walsh highlights the special ethical and political defects embedded in the genealogy of the scientist-prophet, and she finishes by evaluating proposed remedies. She concludes that without a radical shift in our style of deliberative policy-making, there is little chance of remedying the dysfunctions in our current science-advising system. A cogent rhetorical analysis of over 1,000 archival documents from 10 historic cases, Scientists as Prophets engages scholars of scientific rhetoric, history, and literacy, but is also accessible to readers interested in the roots of current political debates about the environment, nuclear energy, and science education.\n\nProduct Details:\n\nPDF: 277 pages\nPublisher: Oxford University Press (July 15, 2013)\nLanguage: English\nISBN-10: 0199857091\nISBN-13: 978-0199857098\nAmazon Link:\n\n\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up\n------------------------------------------------","torrent":{"xt":"urn:btih:d787ce5e25e38010e18abebeb99a45f590ba3c9e","amp;dn":"Scientists+as+Prophets%3A+A+Rhetorical+Genealogy+%282013%29+%7B%3DIMPAVIDU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d787ce5e25e38010e18abebeb99a45f590ba3c9e","infoHashBuffer":{"type":"Buffer","data":[215,135,206,94,37,227,128,16,225,138,190,190,185,154,69,245,144,186,60,158]},"announce":[],"urlList":[]}}