{"title":"(YA) Gina Blaxill: Pretty Twisted - Kindle + ePub - Barbie1710","uid":7890718,"size":844262,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8a4cdb14233b30a10b2f6ca3d0cca82150eeeab&amp;dn=%28YA%29+Gina+Blaxill%3A+Pretty+Twisted+-+Kindle+%2B+ePub+-+Barbie1710&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Barbie1710","files":5,"time":1354717086,"description":"(YA) Gina Blaxill: Pretty Twisted - Mobi + ePub - Barbie1710\n\n\nRos has a secret crush on Jonathan. Jonathan is massively hung up on Freya (even after she dumps him). And Freya? Well, Freya is a beautiful enigma. Even more so when she goes missing without a trace . . . PRETTY TWISTED is narrated in alternating chapters by Jonathan (16) and Ros (14) who meet online at a time when things are going sour for Jonathan. His stunning girlfriend, Freya, is away at college and they are growing apart - consequently, he is struggling with his own sense of identity. Ros is also experiencing some problems - one of her friends is dating an older man whose strange behaviour gives Ros cause for concern. Meanwhile, the local news has been reporting some kidnappings of teenage girls. So when Freya dumps Jonathan, then seems to disappear off the face of the earth, he enlists Ros' (somewhat reluctant) help in tracking down the girl he still loves. With danger lurking around every corner, their stories become inextricably linked in a way nobody could have predicted . . .\n\n\nAbout the Author\n\nGina is 24 and lives in North London. She has an English degree from Cambridge University and now works in schools liaison, helping teenagers puzzle out the mysteries of higher education. Between the ages of 11 and 15 she wrote an epic 36 part story featuring over 1,000 characters - she still remembers most of their names!","torrent":{"xt":"urn:btih:d8a4cdb14233b30a10b2f6ca3d0cca82150eeeab","amp;dn":"%28YA%29+Gina+Blaxill%3A+Pretty+Twisted+-+Kindle+%2B+ePub+-+Barbie1710","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8a4cdb14233b30a10b2f6ca3d0cca82150eeeab","infoHashBuffer":{"type":"Buffer","data":[216,164,205,177,66,51,179,10,16,178,246,202,61,12,202,130,21,14,238,171]},"announce":[],"urlList":[]}}