{"title":"Chris Brown - F.A.M.E","uid":7012898,"size":133416108,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d925f1fb6938cf0eeac5bbfe70841fdc54f3ddc9&amp;dn=Chris+Brown+-+F.A.M.E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":null,"files":17,"time":1328536075,"description":"F.A.M.E. is the fourth studio album by American recording artist Chris Brown, first released on March 18, 2011 by Jive Records. Brown worked with several record producers and songwriters for the album, including Kevin McCall, Jean Baptiste, Brian Kennedy, DJ Frank E, The Underdogs and The Messengers, among others. The album featured several guest appearances, including McCall, Tyga, Lil Wayne, Busta Rhymes, Ludacris, Justin Bieber, Benny Benassi, Wiz Khalifa, Game, Timbaland and Big Sean.\nMusically, F.A.M.E. combines the musical genres of R&amp;B, pop, hip hop and euro. Upon its release, the album received mixed reviews from most music critics, who were ambivalent towards its songwriting and material. The album debuted at number one on the US Billboard 200 chart, with first-week sales of 270,000, Brown's first number-one album in the United States. It was certified gold by the Recording Industry Association of America (RIAA), for selling more than 500,000 copies.\nThe album spawned three hit singles, &quot;Yeah 3x&quot;, &quot;Look at Me Now&quot; and &quot;Beautiful People&quot;. &quot;Yeah 3x&quot; and &quot;Beautiful People&quot; were commercially successful in Oceania and some European regions. In the United States, &quot;Look at Me Now&quot; reached number one on the Hot R&amp;B/Hip-Hop Songs and Hot Rap Songs charts. To support the album, Brown embarked on his F.A.M.E. Tour in Australia and North America.","torrent":{"xt":"urn:btih:d925f1fb6938cf0eeac5bbfe70841fdc54f3ddc9","amp;dn":"Chris+Brown+-+F.A.M.E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d925f1fb6938cf0eeac5bbfe70841fdc54f3ddc9","infoHashBuffer":{"type":"Buffer","data":[217,37,241,251,105,56,207,14,234,197,187,254,112,132,31,220,84,243,221,201]},"announce":[],"urlList":[]}}