{"title":"Enemy at the Gates: The Battle for Stalingrad","uid":8139046,"size":4319235,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9dd065dd36b5d9cc4ce8c56c40099b3596ac799&amp;dn=Enemy+at+the+Gates%3A+The+Battle+for+Stalingrad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1360771227,"description":"Enemy at the Gates: The Battle for Stalingrad\nby William Craig\n\nDescription:\n The bloodiest battle in the history of warfare, Stalingrad was perhaps the single most important engagement of World War II. A major loss for the Axis powers, the battle for Stalingrad signaled the beginning of the end for the Third Reich of Adolf Hitler. \n\n During the five years William Craig spent researching the battle for Stalingrad, he traveled extensively on three continents, studying documents and interviewing hundreds of survivors, both military and civilian. This unique account is their story, and the stories of the nearly two million men and women who lost their lives.\n\nFrom Wikipedia:\nEnemy at the Gates: The Battle for Stalingrad is a book written by William Craig and published in 1974 by Penguin Publishing. It details the battle of Stalingrad, fought by opposing Soviet and Axis forces during the second world war. The book begins with the German advance across southern Russia in 1942 and culminates with the surrender and imprisonment of Axis forces several months later in 1943. A sub plot of the book has since been turned into a major motion picture &quot;Enemy at the gates&quot; starring Jude Law.\n\n","torrent":{"xt":"urn:btih:d9dd065dd36b5d9cc4ce8c56c40099b3596ac799","amp;dn":"Enemy+at+the+Gates%3A+The+Battle+for+Stalingrad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9dd065dd36b5d9cc4ce8c56c40099b3596ac799","infoHashBuffer":{"type":"Buffer","data":[217,221,6,93,211,107,93,156,196,206,140,86,196,0,153,179,89,106,199,153]},"announce":[],"urlList":[]}}