{"title":"Mac Office 2008 - Volume License (English)","uid":4061213,"size":583098368,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d9e5779af60dd44d5d6130351adfe150d2345e30&amp;dn=Mac+Office+2008+-+Volume+License+%28English%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SurferSD","files":1,"time":1204610401,"description":"A streamlined user interface, hundreds of new themes and templates, and better compatibility with your Windows-based colleagues--with Microsoft Office 2008 for Mac, you&amp;#039;ll simplify your work and achieve more with less effort.\n\nFive Great Reasons to Upgrade to Office 2008 for Mac:\n\nUniversal applications: Office 2008 runs natively on both Intel- and PowerPC-based Macs.\n\nEasier interface: You&amp;#039;ll quickly build professional, compatible and complex documents using the simplified user interface and new tools like Document Elements. With a visual gallery for selecting elements like cover pages, bibliographies, and citations, you&amp;#039;re one-click from finished.\n\nYour Mac, more compatible: Office 2008 for Mac and the Windows-based 2007 Office System share the Open XML file formats, the Office Art graphics engine, and many other features that result in compatibility and file fidelity. You&amp;#039;ll be confident when sharing ideas and documents with colleagues regardless of which platform they&amp;#039;re on.\n\nGreat documents: Professional design is within your power with hundreds of new customizable templates and suite-wide themes, SmartArt graphics, and the new Publishing Layout View in Word 2008.\n\nYour day, well managed: My Day keeps you connected to all of the day&amp;#039;s action. Command your calendar, tackle your tasks, and simplify your day with this easy to use but powerful little tool.\n\nWhich Version of Office 2008 is right for you? View this comparison chart.\n\nSimplify Your Work\nYour presentation will make an impact. Your documents will be professional. Your analysis will be insightful. And Office 2008 will be there.\nThe latest version of the industry standard for productivity software on the Macintosh platform, Microsoft Office 2008 for Mac is more powerful and easier to use. Office 2008 combines Microsoft Word for Mac, Microsoft PowerPoint for Mac, Microsoft Excel for Mac, Microsoft Entourage for Mac, and Microsoft Messenger for Mac and lets you easily create high-impact documents and seamlessly share your ideas with others, whether they are on the Mac or Windows platform.\n\nWhat&amp;#039;s New in Office for Mac?\n\n    * Universal versions of the most popular productivity applications on the Macintosh platform (Universal applications run natively on Intel- and PowerPC-based Macs.)\n    * Microsoft Office for Mac natively supports the Open XML file formats for compatibility with Windows-based 2007 Microsoft Office products.\n    * A redesigned user interface and powerful new tools for simplifying work, creating great looking documents, and exchanging ideas and information with others. \n\nHighlights of Office 2008 for Mac\n\n    * Office 2008 is a Universal Binary, was built by Mac users for Mac users, and includes many features which take advantage of underlying technologies of the Macintosh platform.\n    * Office 2008 uses Open XML file formats for compatibility with Windows-based 2007 Microsoft Office products. XML file formats help reduce the risk of lost information due to damaged or corrupted files and also result in smaller file sizes--up to 75 percent smaller than comparable binary documents. Office 2008 for Mac is backward-compatible with earlier file formats and users can continue to use the older .doc, .xls, and .ppt binary formats.\n    * Elements Gallery is the foundation of the new user interface, and gives easy access to the most commonly used tools and templates. With the new UI, you&amp;#039;ll harness the capabilities of Office for Mac more easily than ever before.\n    * Office 2008 includes OfficeArt, the powerful graphics engine also used in the Windows-based Office 2007 products. You get great cross-platform file fidelity and easy access to stunning visual and graphic effects.\n    * Your words will make an impact with the modern styling of SmartArt graphics, which makes transforming text and bulleted lists into professional diagrams and graphics one-click easy.\n    * A new Themes capability simplifies the process of applying a consistent look and feel across documents. Easily apply a complete set of colors, fonts, and effects to your Office 2008 documents, and change them as easily as changing your mind.\n    * Automator Actions for Workflows in Microsoft Office enables you to automate Office 2008 with more than 70 pre-defined actions built to simplify your work and extend your productivity. (Available in Office 2008 for Mac and Office 2008 for Mac Special Media Edition.) \n\nEntourage 2008, the hub of Office 2008, helps it to happen, one task at a time.\n\nEnjoy powerful new tools, over 100 designer templates, rich themes, and an intuitive user interface in Word 2008.\n\nEntourage 2008\nYour e-mails will spark ideas, you&amp;#039;ll schedule meetings where creativity abounds. Entourage 2008, the hub of Office 2008, helps it to happen, one task at a time.\n\n    * My Day keeps you connected to the action. Schedules, tasks, and priorities in one easy, standalone interface. Time will have no choice but to be well-managed.\n    * Use color-coded categories, status indicators, and flexible To-Do list management humble even the most hectic schedules.\n    * Office 2008 for Mac and Office 2008 Special Media Edition enable users to access their Microsoft Exchange server accounts with Entourage.\n    * Improved Junk E-Mail filtering capabilities and phishing protection tools help shield your inbox from the scourge of junk. Your inbox will breathe a sigh of relief.\n    * Projects submit to your superior management skills when you unleash the power of Project Center, With project details like e-mail messages, documents, schedules, and contacts in one convenient place, Project Center helps keep your information--and your stress--under control. \n\nWord 2008\nPowerful new tools, over 100 designer templates, rich themes, and an intuitive user interface in Word 2008 will help you to make your ideas look as good as they are.\n\n    * When you turn blah into brilliant, Publishing Layout View will elevate the way you think about Word 2008. This new specialized and customizable workspace lets users create incredibly rich documents such as newletters, flyers and brochures without a degree in design.\n    * Great looking document construction won&amp;#039;t require a hard hat. New Templates, Themes, and Document Elements like cover pages and bibliographies make creating professional-looking output a snap.\n    * Your words will make an impact with the modern styling of SmartArt, which makes transforming text into high-quality graphics and diagrams as easy as one click.\n    * Dynamic Guides will help you keep all of your words and graphics in line and on point.\n    * Mass mailings will have a personal touch and Word 2008 Mail Merge Manager will guide you step by easy step. \n\nInspire your audience&amp;#039;s imagination with compelling visuals and engaging layout in PowerPoint 2008.\n\nAnalyze, share, and manage your data, and easily create persuasive charts and thought-provoking graphs for powerful results with Excel 2008.\n\nPowerPoint 2008\nYour presentation is a story. PowerPoint 2008 will illustrate it. Inspire your audience&amp;#039;s imagination with compelling visuals and engaging layout.\n\n    * Great ideas will get their graphic due with SmartArt graphics in PowerPoint 2008. Start with a blank slide or a bulleted list, and, with a click of a button, you&amp;#039;ll have a stunning chart, table, map, or diagram.\n    * Designer Themes help you give your presentation a creative look, simply and quickly.\n    * The new Object Palette allows quick access to all your shapes, art, symbols, and pictures--including iPhoto files--in one easy-to-access space.\n    * Dynamic Guides will help you place and resize your graphic element to create professional-looking presentations in a snap.\n    * You&amp;#039;ll lay out custom designs to showcase your unique content with custom layout capabilities in PowerPoint 2008.\n    * PowerPoint 2008 integration with Apple Remote Control lets you concentrate on your words, not your keyboard. Now control your presentation and engage your audience unleashed from the podium.\n\n      Excel 2008\n      It&amp;#039;s a numbers game. With Excel 2008, analyze, share, and manage your data, and easily create persuasive charts and thought-provoking graphs for powerful results.\n          o Ledger Sheets in Excel 2008 make tracking finances, inventories, even invoices and portfolios easy with preformulated spreadsheets and automatic calculations.\n          o Charting improvements artfully convey the message your data is telling. You&amp;#039;ll see your numbers in a whole new way.\n          o The new prebuilt functions tackle the most common tasks and make creating error-free complex conditional formulas easier.\n          o Quick access to formulas makes functions more functional with Formula Builder in Excel 2008.\n          o Your data will know virtually no limits. Excel 2008 now supports over 16,000 columns and over 1 million rows.\n          o Whether you&amp;#039;re an Excel expert or a complete novice, Excel 2008 Formula AutoComplete simplifies your calculations by providing a dynamic pop-up menu so you can select and complete your formula. \n\n      Messenger for Mac\n      Convenience is the name of the game for Mac users who want to communicate instantly with family, friends and colleagues from one convenient place. Messenger for Mac is now a Universal application, and gives you more ways to share what&amp;#039;s on your mind or on your plate.\n\n      Use Messenger for Mac to instantly check the status of project team members, streamline workflow by sending documents directly from Word, or offer questions or comments on document changes instantly.\n          o Yahoo! Interoperability will allow personal users to connect and message with Yahoo! Messenger for Mac users.\n          o Your intentions will never again be in doubt when you create your own custom emoticons in Messenger for Mac.\n          o Spelling Checker is now included in Messenger for Mac.\n          o Let the world know your tastes when you display your iTunes selection with the new &quot;What I&amp;#039;m listening to now&quot; feature. \n\n\n      Product Description\n      Simplify your day at work. Achieve more with the power of reinvented Office for Mac. Easy-to-use, powerful tools make it easy to create fantastic looking documents--from dynamic presentations to stunning reports and engaging communications. Includes: Word, Excel, PowerPoint, Entourage, Microsoft Server Exchange Support, Automator Actions for Workflows in Microsoft Office. ","torrent":{"xt":"urn:btih:d9e5779af60dd44d5d6130351adfe150d2345e30","amp;dn":"Mac+Office+2008+-+Volume+License+%28English%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e5779af60dd44d5d6130351adfe150d2345e30","infoHashBuffer":{"type":"Buffer","data":[217,229,119,154,246,13,212,77,93,97,48,53,26,223,225,80,210,52,94,48]},"announce":[],"urlList":[]}}