{"title":"[SoM]Mulan[DvdRip-Xvid-Ita-Mp3]","uid":4934431,"size":855219620,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da1b09aeb08c1928bf874e0b622a53782a3a9744&amp;dn=%5BSoM%5DMulan%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1244188131,"description":"\n\n\nAttestatosi sul confine estremo del Paese, delimitato dalla grande muraglia, il feroce condottiero degli Unni, Shan-Yu, annuncia di voler invadere con una potente armata la Cina. L'imperatore dei cinesi, molto amato dal popolo, organizza subito la difesa, emana un proclama con cui chiede ad ogni famiglia di mandare un uomo a combattere nell'armata imperiale e invia il fedele Chi Fu ad eseguire l'ordine. Intanto, in un lontano villaggio, la giovane Mulan, unica figlia della famiglia Fa, si sta preparando all'incontro decisivo con la sensale del villaggio. Mulan ÃƒÂ¨ uno spirito libero ma vuole onorare la propria famiglia e le tradizioni che impongono alla donna il matrimonio. Le cose perÃƒÂ² si mettono male per l'inopportuno intervento di Cri-Cri, il grillo portafortuna della giovane. CosÃƒÂ¬ la sensale caccia via Mulan, che ÃƒÂ¨ ormai disonorata. Tornata a casa, la ragazza viene confortata dal padre e, mentre parlano, viene annunciato il proclama imperiale. L'uomo non esita a farsi avanti ma Mulan sa che il padre ÃƒÂ¨ malato e l'arruolamento significherÃƒÂ  morte sicura. Durante la notte prende la decisione di sostituirsi al padre: si taglia i capelli, indossa l'armatura e si unisce all'esercito. Ma questo gesto provoca la reazione degli antenati che si riuniscono e meditano di ripristinare l'onore familiare. Intanto Mulan, dopo i primi giorni d'incertezza, diventa un soldato come gli altri ed ÃƒÂ¨ pronta per la battaglia. Le truppe imperiali sono inferiori ma ÃƒÂ¨ proprio Mulan, con uno stratagemma, a far rovesciare le sorti della battaglia. Rimasta ferita, Mulan viene perÃƒÂ² scoperta nella sua vera identitÃƒÂ  ed espulsa dall'esercito. Tuttavia non si rassegna e, saputo che alcuni Unni superstiti stanno attaccando la CittÃƒÂ  Imperiale, escogita un piano e li ferma. Adesso puÃƒÂ² fare ritorno a casa, dove l'aspetta il padre orgoglioso e un ragazzo che la chiede in sposa.","torrent":{"xt":"urn:btih:da1b09aeb08c1928bf874e0b622a53782a3a9744","amp;dn":"%5BSoM%5DMulan%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da1b09aeb08c1928bf874e0b622a53782a3a9744","infoHashBuffer":{"type":"Buffer","data":[218,27,9,174,176,140,25,40,191,135,78,11,98,42,83,120,42,58,151,68]},"announce":[],"urlList":[]}}