{"title":"Erich Fromm - To Have or  (epub,mobi)","uid":5947941,"size":552183,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da4de036018b4d4ae6762aba216a19ed288a8b3f&amp;dn=Erich+Fromm+-+To+Have+or++%28epub%2Cmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"InvisibleLibrary","files":-1,"time":1289434246,"description":"From Wikipedia:\n\nIn this book, &quot;To have or to be&quot;, Erich Fromm has differentiated between having and being. The writer mentions how the modern society has become materialistic and prefers 'having' than 'being'. The author has mentioned about the great promise of unlimited happiness, freedom, material abundance, and domination of nature. These hopes got to their highs when the industrial age begun. One could feel that there would be unlimited production and hence unlimited consumption. The human beings including men and women have started dreaming about becoming the Gods of earth, but it wasn't really the case. The great promise failed due to the unachievable aims of life, i.e. maximum pleasure and fulfillment of every desire (radical hedonism), and the egotism, selfishness and greed of the people. In the industrial age, the development of this economic system was no longer determined by the question that what is good for man, rather what is good for the growth of the system. So, the economic system of society served people in such a way in which only their personal interests were intended to impart. The people having unlimited needs and desires like the Roman emperors, the English and French noblemen were the people who got the most out it.\n\nThe society nowadays has completely deviated from its actual path. The materialistic nature of people of 'having' has been more developed than 'being'. The modern industrialization has made great promises, but all these promises are developed to fulfill their interests and increase their possessions. In every mode of life, the people should ponder more on 'being' nature and not towards the 'having' nature. This is the truth which people deny and thus the people of modern world have completely lost their inner selves. The point of being is more important as everyone is mortal, and thus having of possessions will become useless after their death, because the possessions which are transferred to the life after death, will be what the person actually was inside.","torrent":{"xt":"urn:btih:da4de036018b4d4ae6762aba216a19ed288a8b3f","amp;dn":"Erich+Fromm+-+To+Have+or++%28epub%2Cmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da4de036018b4d4ae6762aba216a19ed288a8b3f","infoHashBuffer":{"type":"Buffer","data":[218,77,224,54,1,139,77,74,230,118,42,186,33,106,25,237,40,138,139,63]},"announce":[],"urlList":[]}}