{"title":"Etienne Gilson - Thomism, 6th ed. (improved pdf)","uid":8078115,"size":7300992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da9bd66d0b11bcd3f6f7d33c43dff0b2185db3df&amp;dn=Etienne+Gilson+-+Thomism%2C+6th+ed.+%28improved+pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":3,"time":1359429699,"description":"Thomism: The Philosophy of Thomas Aquinas by Etienne Gilson. Translated by Laurence K. Shook and Armand Maurer from the 6th French edition, published 1965. Pontifical Institute of Medieval Studies, 2002. 454 pages.\n\nGood quality clearscan pdf.\n\npublisher description:\n\nEtienne Gilson published six editions of his book devoted to the philosophy\nof Thomas Aquinas. The appearance of these editions, the first in\n1917 and the last in 1965, covers much of the scholarly life of their\nauthor. As he says in his Preface, the book was his lifelong companion.\nThe editions represent a sustained effort to set forth his developing views\non the philosophy of the man who, in Gilson's opinion, most profoundly\nsought out the heart of reality: being, understood as the act of existing\n(esse). Gilson presents his thoughts on this subject with new clarity and\nprecision in his revised sixth and final edition, which is here put into\nEnglish for the first time.\n\nWhile probing into Thomas' philosophy, Gilson measures it against the\nviews of his predecessors: notably Plato, Aristotle, Plotinus, and the\nPseudo-Dionysius among the Greeks, and Avicenna and Averroes in the\nIslamic world. Among the Latins, he pays particular attention to the\nviews of Augustine, Boethius, Anselm, and in his own century to those\nof Alexander of Hales and Bonaventure. Gilson sees Aquinas as retrieving\nmuch of the long tradition of philosophy in which he was schooled,\nbut surpassing it with his original insights and developments. Most important,\nin Gilson's opinion, is that Thomas goes beyond the essentialist\nontology bequeathed to the Middle Ages by Augustine, among others,\nand reaches a &quot;new ontology&quot; which is truly existential.\n\nWith this leitmotif, in Part I Gilson explores Thomas' notions of the\nexistence and nature of God and our access to them. Part II examines\nthe emanation of the world from God and the hierarchy of creatures,\nculminating in the human person. Part III contains Gilson's fullest\ntreatment of Thomas' moral doctrine, featuring the human act, its principles,\nand the personal, social, and religious life. While stressing the\nstrictly rational character of Thomistic philosophy in the way it reaches\nits conclusions, this edition, like its predecessors, emphasizes its development\nwithin Thomas' theology and the guidance it receives from the\nChristian faith.","torrent":{"xt":"urn:btih:da9bd66d0b11bcd3f6f7d33c43dff0b2185db3df","amp;dn":"Etienne+Gilson+-+Thomism%2C+6th+ed.+%28improved+pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da9bd66d0b11bcd3f6f7d33c43dff0b2185db3df","infoHashBuffer":{"type":"Buffer","data":[218,155,214,109,11,17,188,211,246,247,211,60,67,223,240,178,24,93,179,223]},"announce":[],"urlList":[]}}