{"title":"I Survived... - Season 3 - SD 480p","uid":11442973,"size":6335155695,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:daa535a7fc8e05d6fdd3048ce0612e24f5c1aaf4&amp;dn=I+Survived...+-+Season+3+-+SD+480p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"voltxrid","files":-1,"time":1415830731,"description":" &lt;a href=&quot;http://bayimg.com/EAEnpaaGB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/EAEnpaaGB&lt;/a&gt;\n\n\n==================================\n\nI Survived... - Season 3 - SD 480p\n\n==================================\n\n\nEpisode 1 - &quot;Mary / Brooke / Sharene&quot; - December 6, 2009\n\nA young runaway in Modesto, California has her arms cut off in a horrific assault. A pregnant woman and her father flee a deadly firestorm in Australia. A Fallbrook, California woman survives multiple stab wounds in a drug fuelled attack by her enraged boyfriend.\n\n\nEpisode 2 - &quot;Terry / Anne and Debi / Earleen&quot; - December 13, 2009\n\nA Terrell, Texas family suffers multiple tragedy in a deadly home invasion. A California mountain biker is mauled by a mountain lion, and a hotel receptionist in Columbus, Mississippi goes into fight mode to survive a brutal attack by a man posing as a guest.\n\n\nEpisode 3 - &quot;Maggie / Gary / Barbara&quot; - December 20, 2009\n\nA 15-year-old is snatched off the street in Galion, Ohio on an early morning run. A man goes head-to-head with a killer chimpanzee, and a woman working in a restaurant in Davie, Florida is shot and left for dead in a freezer with two slain co-workers.\n\n\nEpisode 4 - &quot;Jessyca / Derek / LaToya&quot; - January 3, 2010\n\nA pregnant woman is attacked in Memphis, Tennessee by her meth-addicted neighbor; an 14-year-old girl from Eau Claire, Wisconsin is kidnapped and held captive by her neighbor, who has sexually assaulted her numerous times before; a Washington state hiker crawls down a mountain after breaking his ankle.\n\n\nEpisode 5 - &quot;Ron and Jill / Randy / Julie&quot; - January 10, 2010\n\nA Fort Worth, Texas couple fight for their lives in a terrifying home invasion. A lineman is electrocuted while working alone up a 35 foot power pole in Rowley, Iowa. And Charlotte, North Carolina a woman makes a desperate dash for safety after being repeatedly stabbed by her ex-boyfriend.\n\n\nEpisode 6 - &quot;Rudrani / Tracey / Teresa&quot; - January 17, 2010\n\nA woman is left for dead when two terrorists storm the Mumbai hotel she is staying in. A 14-year-old saves her brother when their Long Island home is destroyed in a tragic house fire. A Redwater, Texas woman is left permanently scarred in a deadly domestic abuse incident.\n\n\nEpisode 7 - &quot;Verna / Theo / Debra&quot; - January 24, 2010\n\nA single mom living in Ball Ground, Georgia is attacked by an old classmate after spurning his affections. A gold prospector survives five days in the Australian Outback. And a woman is left for dead in the woods outside Fayetteville, North Carolina after being carjacked then shot several times at close range.\n\n\nEpisode 8 - &quot;Christine / Mike / Chris&quot; - Januray 31, 2010\n\nIn Fort Lauderdale, Florida A doctor's assistant is violently attacked at home by a former patient she spurned several years earlier. A Georgia man is attacked by a swarm of hornets on the roof of his holiday home and falls down a 100 foot bank. And, a man in Blue Springs, Missouri is shot and assaulted by his girlfriend when he tries to end their relationship.\n\n\nEpisode 9 - &quot;Franklin / Jeff and Frank / Connie&quot; - February 14, 2010\n\nA man and his wife survive a plane crash that killed 125 passengers and crew; a heroic rescue bid goes horribly wrong when 2 police officers are stranded on an iceburg with several other people on frigidly cold Lake Saint Clair; a woman is beaten and left for dead, after 2 men break into her remote East Texas farmhouse and kill her husband.\n\n\nEpisode 10 - &quot;Brandy / Steve / James&quot; - February 21, 2010\n\nIn Aurora, Colorado A 16-year-old girl and her deaf friend are abducted and assaulted by two gunmen; a Texas deer hunter drags himself up a dry creek bed after falling out of a tree and breaking both legs; a college student is used as a human shield by a gunman.\n\n\n=========\n\nI have scoured the Internet for episodes 11-26, but cannot find them available anywhere.  Furthermore, the shows that are currently marketed for streaming are either out of their original sequence or labeled differently by their video providers.  Not sure why this all is, but it's the reason the season is not complete here.  I still wanted to share what was available, though - in the correct order, too.  If I ever happen to locate the omitted episodes then I will surely add them at that time.\n\nAlso, if problems or inconsistencies with any of the content files are noticed, please let me know via the comments and I will attempt to upload some corrected replacements.  Thanks much and enjoy!  :-)","torrent":{"xt":"urn:btih:daa535a7fc8e05d6fdd3048ce0612e24f5c1aaf4","amp;dn":"I+Survived...+-+Season+3+-+SD+480p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daa535a7fc8e05d6fdd3048ce0612e24f5c1aaf4","infoHashBuffer":{"type":"Buffer","data":[218,165,53,167,252,142,5,214,253,211,4,140,224,97,46,36,245,193,170,244]},"announce":[],"urlList":[]}}