{"title":"Shotgun Gunfighting - Suarez","uid":4871715,"size":834997632,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:daa922af208da75006d3139f0d339f89d194f8f0&amp;dn=Shotgun+Gunfighting+-+Suarez&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DarkDex1984","files":-1,"time":1240869307,"description":"The shotgun, if used correctly inside its performance envelope is, potentially, the best CQB weapon in existence today. This dynamic DVD presents a reality based, aggressive, close quarters combative method of deploying the shotgun. We discuss the various generations of shotgun development, as well as common-sense accessories that the viewer will find useful.\n\nFilmed outside, in the Northern Arizona back country, we had the freedom to do as we pleased with regards to setting up shots and angles to capture every nuance of handling the weapon. There is some wind evident in some parts of the production, but it does not detract from the presentation of the information. All four generations of shotgun development are discussed and shown to include the double barrel, the pump action, the semi auto and the magazine-fed semi auto, as well as what each generation brings to the table. Most demonstrations are conducted with the Remington 870, the Remington 1100, or the Saiga 12.\n\nMost shotgun schools spend a great deal of time discussing modifications and additions to the shotgun, or try to convince the viewer to turn this CQB weapon into some sort of a rifle suitable only for range games, or gun school scores. That is happily not the case in SHOTGUN GUNFIGHTING! In this DVD you will learn what the shotgun is REALLY for, and perhaps as important, learn the weapon's limitations. After a brief overview of the fundamentals, we progress quickly to advanced reality-based drills such as Hostage Rescue Shooting, Ambidextrous Work, and Ammo Transitions. This is the Shotgun version of Close Range Gunfighting.\n\nIf you rely on a shotgun as a weapon, the material shown in this DVD is essential.\n\nApproximately 90 minutes\n\n\n\nTHE NEW REVOLUTION!!! LIVE FREE OR KILL!!! COPS ARE CROOKS!!!\n\n\n\n\n\n\nMP4 ENG\n\n\nDeal FASCISM a poke in the EYE; with BULLETS, BUCKSHOT and ROGUE S-C-I!!!!!\n\n\nLet FREEDOM ring!\n\n\nALL GUN CONTROL IS INFRINGEMENT... TAKE THE POWER BACK!!!\n","torrent":{"xt":"urn:btih:daa922af208da75006d3139f0d339f89d194f8f0","amp;dn":"Shotgun+Gunfighting+-+Suarez","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daa922af208da75006d3139f0d339f89d194f8f0","infoHashBuffer":{"type":"Buffer","data":[218,169,34,175,32,141,167,80,6,211,19,159,13,51,159,137,209,148,248,240]},"announce":[],"urlList":[]}}