{"title":"JavaScript and DHTML Cookbook 2nd [ Second ] Edition","uid":6095647,"size":4460910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db5c0c3fab68926ce93930516f292de9e480e0fc&amp;dn=JavaScript+and+DHTML+Cookbook+2nd+%5B+Second+%5D+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"typhoonDigital","files":-1,"time":1294762303,"description":"In today's Web 2.0 world, JavaScript and Dynamic HTML are at the center of the hot new approach to designing highly interactive pages on the client side. With this environment in mind, the new edition of this book offers bite-sized solutions to very specific scripting problems that web developers commonly face. Each recipe includes a focused piece of code that you can insert right into your application.\n\nWhy is JavaScript &amp; DHTML Cookbook so popular? After reading thousands of forum threads over the years, author and scripting pioneer Danny Goodman has compiled a list of problems that frequently vex scripters of various experience levels. For every problem he addresses, Goodman not only offers code, but a discussion of how and why the solution works. Recipes range from simple tasks, such as manipulating strings and validating dates in JavaScript, to entire libraries that demonstrate complex tasks, such as cross-browser positioning of HTML elements, sorting tables, and implementing Ajax features on the client.\n\nIdeal for novices as well as experienced scripters, this book contains more than 150 recipes for:\n\nWorking with interactive forms and style sheets\nPresenting user-friendly page navigation\nCreating dynamic content via Document Object Model scripting\nProducing visual effects for stationary content\nPositioning HTML elements\nWorking with XML data in the browser\nRecipes in this Cookbook are compatible with the latest W3C standards and browsers, including Internet Explorer 7, Firefox 2, Safari, and Opera 9. Several new recipes provide client-side Ajax solutions, and many recipes from the previous edition have been revised to help you build extensible user interfaces for Web 2.0 applications. If you want to write your own scripts and understand how they work, rather than rely on a commercial web development framework, the JavaScript &amp; DHTML Cookbook is a must.","torrent":{"xt":"urn:btih:db5c0c3fab68926ce93930516f292de9e480e0fc","amp;dn":"JavaScript+and+DHTML+Cookbook+2nd+%5B+Second+%5D+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db5c0c3fab68926ce93930516f292de9e480e0fc","infoHashBuffer":{"type":"Buffer","data":[219,92,12,63,171,104,146,108,233,57,48,81,111,41,45,233,228,128,224,252]},"announce":[],"urlList":[]}}