{"title":"GSA.Radio.Stream.Recorder.1.19.SER.INCLUDED-MKDEV.TEAM","uid":5681955,"size":4027552,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:db5f84f43a93c3c8913ade7d474bb41c643453e4&amp;dn=GSA.Radio.Stream.Recorder.1.19.SER.INCLUDED-MKDEV.TEAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ilefx","files":4,"time":1278855993,"description":"GSA.Radio.Stream.Recorder.1.19.SER.INCLUDED-MKDEV.TEAM\n\n\n\nINSTALL THE APP , USE THE SERIAL\n\n\nSEED/ENJOY\n\n\n\nGSA Radio Stream Recorder description\nSoftware to record internet radio station streams to MP3 , ACC or OGG format.\n\nUsing the GSA Radio Stream Recorder application you can record almost any music freely from the internet.\n\nMore than 8000 Radio Stations and over 100 genres to choose from\nThere are many so called internet radios who stream music. With our product you can now record that music directly to harddisk without any technical knowledge.\n\nYou don't even need to know the name or URL of such an internet radio to record. Simply search within the program for your favourite genre or artist and the program will try to deliver a matching radio station that you can chose to record.\n\nThere are a lot stations who play 24 hours all kind of music from a specific genre. So if you plan to record e.g. only Classic Rock, feel free to pick such a station and see what it gets you.\n\nYou can record not only one station but as many as you want (or your internet connection lets you).\n\nAdditional artist information (band history, images)\nUnlike any other program, we offer you not only this, but the ability to see details about the playing artist. See a band history and pictures. See on what album this song was first published. Go directly to the artist's website, buy the whole album or simply visit lastfm or myspace.\n\nListen while you record\nWhile recording songs, you can also listen to each radio stream and see if you like it or not. If you don't want a song or artist, simply put it to the filter so you never wast time again with something you don't like.\n\nHere are some key features of &quot;GSA Radio Stream Recorder&quot;:\n\nÂ· Records unlimited streams at one time\nÂ· Buy the full album of the music you are recording online\nÂ· Automatically complete ID3Tag information with genre, album name, track number and album year\nÂ· Get details about the band you are hearing (band history, pictures, etc.)\nÂ· Filter the mp3 downloads and skip unwanted artist\nÂ· Import your music collection to skip songs that you already have\nÂ· Lets you easily find new stations to record over the interface\nÂ· Listen to any station being recorded with a single mouse click\nÂ· Keeps a list of the radio stations you have recorded, allowing easy playback and re-recording\nÂ· Ignore songs under a certain size\nÂ· Over 100 music genres to choose from (Rock/Classic Rock, Gothic, Industrial, Dance/House, Pop, Rap, Techno, Metal, 80s, etc.).\nÂ· More than 8000 Internet radio stations to record worldwide\nÂ· Ability to filter music (no ads or jingles)\nÂ· No duplicate music tracks (better version will replace others)\nÂ· Control your recording according to disk space, time or number recorded songs\nÂ· Automatic parsing of Shoutcast, Icecast, Liveradio and others\nÂ· Localized interface (supports English, German, Dutch, Swedish, etc.)\n\nRequirements:\n\nÂ· Internet\n\nLimitations:\n\nÂ· 30 days trial\n\nWhat's New in This Release: [ read full changelog ]\n\nÂ· improved radio search engine\nÂ· fixed a bug after demo expired","torrent":{"xt":"urn:btih:db5f84f43a93c3c8913ade7d474bb41c643453e4","amp;dn":"GSA.Radio.Stream.Recorder.1.19.SER.INCLUDED-MKDEV.TEAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db5f84f43a93c3c8913ade7d474bb41c643453e4","infoHashBuffer":{"type":"Buffer","data":[219,95,132,244,58,147,195,200,145,58,222,125,71,75,180,28,100,52,83,228]},"announce":[],"urlList":[]}}