{"title":"Apocalypse.Man.HDTV.XviD-BiLDeRBeRG","uid":5293856,"size":361622096,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:db892a39a582d0d531fe7e93e473d0da436f3f4e&amp;dn=Apocalypse.Man.HDTV.XviD-BiLDeRBeRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"k3nd00d","files":3,"time":1263948406,"description":"Apocalypse Man\n\n\nVideo: Xvid 640x360 29.97fps 1016Kbps\nAudio: MPEG Audio Layer 3 44100Hz stereo 96Kbps\n\nDuration: 42mins 43secs\n\n\nDESCRIPTION\n===========\n\nGovernment authorities say it's &quot;not if... but when&quot;...a moment in the future when, just as it has in the past, some catastrophe sparks mass destruction, leaving humans challenged to find shelter, heat, food, water and defense. If that happens, would you know what to do? Survival expert Rudy Reyes journeys through abandoned buildings showing us some surprising survival techniques, including making fire from steel wool, finding safe houses and creating shortwave radio transmissions.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\nREVIEW\n======\n\nWell, as with many survival television shows, this show has many problems and is mostly entertainment and not 100% good advice.\n\nHere are a few things that concerned me when watching this program:\n\n1) Again like many shows, there is no clear description of the situation nor the goals.\n\n2) The basic premise of the show is a lone survivor who wants to get into a city to further his unclear goals. However, a city is typically not the place one should go unless they expect to run into people, a fight for resources and disease.\n\n3) Throughout this show the lone survivor is always on the move during the day while preaching that you should be stealthy. I think it is clear that in his situation, movement should largely be done at night.\n\n4) Dangerous activities. In situations like what is depicted in this show, one main and on-going goal every day is to remain healthy and uninjured. So, please do not try to cross open draw bridges with a rope, drop down elevator shafts on the cables, or scale building walls to break into a 2nd floor window.\n\n5) Amazingly, this lone survivor seeks out sewers to travel in. This is ridiculous because no matter how the system has flushed out, a sewer is a haven for disease. Additionally, it is a death trap. There is a chance of being trapped by debris or if there is anyone else down there, you either have to go back from where you came or through the opponent. Thus, limited escape routes.\n\n6) Another risky behavior and intentional limiting of escape route is shown and stated as a good thing. This would be the idea of traversing the city on rooftops. Despite what is said in the show, while a rooftop is good for a look-out position, one would have limited escape routes and does not provide an easy way to travel as not everyone can jump from roof to roof over 20 foot gaps.\n\n7) At one point a tape recorded message is rigged to play a looped message over a CB radio. Well, if there is a 30 minute per side tape in this recorder, how do you accomplish this feat? Do you record a full 30 minutes of your message or shorten the tape? How do you get it to repeat? There may be some tape recorders that auto rewind and play, but not many. Do digital recorders easily accomplish this?\n\n8) When our reckless survivor hotwires a vehicle, he gets into it by smashing the driver's side window. Wow! If you have to break a window to acquire a vehicle, you should probably break a window as far away from where the driver needs to sit as possible!\n\nIn the end, I find any survival type show interesting to watch. There are a few things that can be learned from any attempt to make a show like this. The problem with this show is the same thing that is wrong with Bear Grylls in &quot;Man vs. Wild&quot;. These guys are special forces and recon soldiers and they prove that these are not sufficient qualifications to automatically be able to properly instruct or demonstrate how to truly survive. While they may be able to help themselves in the situations they depict, they are highly reckless and if you emulate them in these situations, you will die!\n\nIn the end I'll say, if a guy does not know the difference between a pry bar and a tire iron, you may have to take what he is trying to teach you with a grain of salt and a degree of caution.\n","torrent":{"xt":"urn:btih:db892a39a582d0d531fe7e93e473d0da436f3f4e","amp;dn":"Apocalypse.Man.HDTV.XviD-BiLDeRBeRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db892a39a582d0d531fe7e93e473d0da436f3f4e","infoHashBuffer":{"type":"Buffer","data":[219,137,42,57,165,130,208,213,49,254,126,147,228,115,208,218,67,111,63,78]},"announce":[],"urlList":[]}}