{"title":"Endocrine Disrupting Chemicals in Food - Ian Shaw","uid":15154978,"size":5233013,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbea8771e09c94e6248da141e4231406eb223a01&amp;dn=Endocrine+Disrupting+Chemicals+in+Food+-+Ian+Shaw&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467290534,"description":"Endocrine Disrupting Chemicals in Food - Ian Shaw (WP, 2009).pdf\r\n\r\nISBN 978-1-84569-218-6\r\n\r\nThe rise in the incidence of health problems such as reproductive disorders and testicular and breast cancer has been linked by some to endocrine disrupting chemicals in the environment. The role of food in transmitting these chemicals is uncertain and a topic of considerable research. This important book addresses key topics in this area.\r\n\r\nThe first part of the book reviews the impacts of endocrine disrupting chemicals on health and behaviour, with chapters on the effect of dietary endocrine disruptors in such areas as the developing foetus, cancer and bone health. Parts two and three focus on the origin and analysis of endocrine disruptors in food products and risk assessment. Topics addressed include surveillance, analysis techniques such as biosensors, exposure assessment and the relevance of genetics, epigenetics and genomic technologies to the study of endocrine disrupting chemicals. Concluding chapters discuss examples of selected endocrine disrupting chemicals associated with food, such as dioxins, polychlorinated biphenyls and brominated flame retardants, bisphenol A and phytoestrogens and phytosterols.\r\n\r\nWith its distinguished editor and international team of contributors, Endocrine-disrupting chemicals in food is an essential reference for all those concerned with ensuring the safety of food.\r\n\r\nReviews the impacts of endocrine disrupting chemicals on health and behaviour including cancer and reproductive disorders\r\nAddresses the origin and analysis of endocrine disruptors with chapters on surveillance and analysis techniques\r\nExamines the relevance of genetics, epigenetics and genomic technologies to endocrine disrupting chemicals","torrent":{"xt":"urn:btih:dbea8771e09c94e6248da141e4231406eb223a01","amp;dn":"Endocrine+Disrupting+Chemicals+in+Food+-+Ian+Shaw","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbea8771e09c94e6248da141e4231406eb223a01","infoHashBuffer":{"type":"Buffer","data":[219,234,135,113,224,156,148,230,36,141,161,65,228,35,20,6,235,34,58,1]},"announce":[],"urlList":[]}}