{"title":"The Big Fat Surprise (2014) epub","uid":10221853,"size":2963560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc25f9e23677ed7b54875811b869053bbc3f9b69&amp;dn=The+Big+Fat+Surprise+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1401053845,"description":"The Big Fat Surprise: Why Butter, Meat and Cheese Belong in a Healthy Diet\n\n\nInteresting examination and critique of current dietary fatty acid recommendations. \n\n &quot;In The Big Fat Lie, Teicholz travels back to the beginnings of nutrition science to show how over-zealous researchers made basic scientific mistakes that became enshrined in dietary dogma. Teicholz has pored over the massive research literature, interviewed hundreds of leading experts, and traveled from Tuscany's oil groves to the seal-hunting coast of Greenland to unravel the distorted claims of nutrition studies. With a lively narrative style akin to Michael Pollan in The Omnivore's Dilemma and the scientific rigor of Gary Taubes in Good Calories, Bad Calories, Teicholz upends the conventional wisdom about all fats. She shows that reducing fat, especially of the saturated kind, has been disastrous for health, and that neither olive oil nor fish oils have convincingly been shown to prevent disease. Her groundbreaking claim that more dietary fat leads to better health, wellness, and fitness is sure to spark controversy and conversation everywhere.&quot;","torrent":{"xt":"urn:btih:dc25f9e23677ed7b54875811b869053bbc3f9b69","amp;dn":"The+Big+Fat+Surprise+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc25f9e23677ed7b54875811b869053bbc3f9b69","infoHashBuffer":{"type":"Buffer","data":[220,37,249,226,54,119,237,123,84,135,88,17,184,105,5,59,188,63,155,105]},"announce":[],"urlList":[]}}