{"title":"Mike Farris...Salvation In Lights(2007)[FLAC]","uid":7186973,"size":304828642,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dc647cf2451531f2684c5a712ec9f5e39b418ce4&amp;dn=Mike+Farris...Salvation+In+Lights%282007%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1334472639,"description":"1.\tSit Down Servant (3:57)\n2.\tStreets Of Galilee (3:00)\n3.\tOh, Mary Don't You Weep (4:45)\n4.\tPrecious Lord, Take My Hand (3:53)\n5.\tChange is Gonna Come (3:08)\n6.\tDevil Don't Sleep (4:31)\n7.\tCan't No Grave Hold My Body Down (4:31)\n8.\tSelah! Selah! (3:31)\n9. Take Me (I'll Take You There) (4:45)\n10. The Lonely Road (4:47)\n11. I'm Gonna Get There (4:35)\n\nAmazon.com\nThose who remember Mike Farris as the frontman for '90s hard rockers the Screamin' Cheetah Wheelies will do a double take when they hear this unexpectedly moving comeback. The singer has radically overhauled his image, shifting from gin-soaked frontman to gospel shouter on this roof-raising release. What hasn't changed is Farris's powerful voice, even more potent since he cleaned up from various excesses in 2004. While the appropriately titled Salvation in Lights is a drastic musical departure from his previous band's swaggering, boozy approach, it's also a logical use of his soulful vocals and candid personality. The singer delivers the goods on a handful of rearranged traditionals such as &quot;Oh Mary Don't You Weep,&quot; but when he rips into Sam Cooke's &quot;A Change Is Gonna Come,&quot; the song shimmers with a passion that nearly matches the original, and that's saying a lot. The oozing, swampy &quot;Devil Don't Sleep,&quot; the restrained funker &quot;Can't No Grave Hold My Body Down,&quot; and the Memphis-thumping &quot;Selah! Selah!&quot; add to the rousing, rootsy R&amp;B groove. Farris is unexpectedly convincing throughout and obviously inspired as he keeps the faith on this stirring but not preachy album. He's accompanied by horns and a tough yet restrained band with righteous female backing vocals that perfectly position these tunes between heaven and earth. He testifies on his Staples Singers cover that he wants to &quot;take you there,&quot; and by the time the album closes with &quot;I'm Gonna Get There,&quot; you'll gladly follow wherever he leads. --Hal Horowitz\n\n","torrent":{"xt":"urn:btih:dc647cf2451531f2684c5a712ec9f5e39b418ce4","amp;dn":"Mike+Farris...Salvation+In+Lights%282007%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc647cf2451531f2684c5a712ec9f5e39b418ce4","infoHashBuffer":{"type":"Buffer","data":[220,100,124,242,69,21,49,242,104,76,90,113,46,201,245,227,155,65,140,228]},"announce":[],"urlList":[]}}