{"title":"Rachel Pollack - 78 Degrees of Wisdom: A Book on the Tarot (pdf)","uid":8467491,"size":7779760,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd1e97b06e32401ff54b370eea33ca078c379d55&amp;dn=Rachel+Pollack+-+78+Degrees+of+Wisdom%3A+A+Book+on+the+Tarot+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1368395153,"description":"Rachel Pollack - Seventy-Eight Degrees of Wisdom: A Book of Tarot, Revised Edition (Element, 1997). 354 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate metadata and pagination, etc. Note: There's a low-quality scan of the first edition to be found on the web, but this upload is a scan of the revised edition.\n\n\nThis is pretty much the best introductory book on Tarot you're going to find.\n\n\ndescription:\n\nA top tarotist's secrets to personal growth, one card at a time. The two volumes of Seventy-Eight Degrees of Wisdom have inspired a whole generation of tarot students. It has often been described by readers, booksellers, and teachers as the &quot;Bible of tarot readers.&quot; It is also often cited as one of the landmark books in modern tarot, and it helped to launch the &quot;Tarot Renaissance&quot; of the 1980s. The two texts--one for The Major Arcana and one for The Minor Arcana--appear together in this volume, which is a reissue of the 1998 edition first published by Thorsons. Seventy-Eight Degrees of Wisdom draws on mythology and esoteric traditions and delves deeply into the symbolism and ideas of each card. It also gives the cards a modern psychological slant based on the pictures rather than a system of occult symbolism. This endlessly useful reference tool provides a concise history of tarot, introduces common spreads, and is a clear and readable book for both the beginning and advanced tarot student.","torrent":{"xt":"urn:btih:dd1e97b06e32401ff54b370eea33ca078c379d55","amp;dn":"Rachel+Pollack+-+78+Degrees+of+Wisdom%3A+A+Book+on+the+Tarot+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd1e97b06e32401ff54b370eea33ca078c379d55","infoHashBuffer":{"type":"Buffer","data":[221,30,151,176,110,50,64,31,245,75,55,14,234,51,202,7,140,55,157,85]},"announce":[],"urlList":[]}}