{"title":"EnigmaT Set Rips { Cuts } - September 5th, 2013","uid":8882726,"size":932140205,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ddb28a8fb76a6665aeebf7cc95604927278fb805&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+5th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":103,"time":1378373771,"description":"1Touch Pres. Lemon Shaker - Chavala (Cut From Eximinds Set)-enTc.mp3\nActive Sight - Never Ending (Bryan Kearney Remix) (Cut From Kearney Set)-enTc.mp3\nAdam Deane - Retribution (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nAirdraw - Soma's Cube (-Short- Cut From Tritonal Set)-enTc.mp3\nAlex Ender &amp; Alter Future - Egyptian Euphoria (Original Mix) (Cut From ReOrder Set)-enTc.mp3\nAlex Ender &amp; Alter Future - Egyptian Euphoria (Original Mix) (Cut From Suzy Set)-enTc.mp3\nAmir Afargan feat. Nicole McKenna - Shape The Invisible (The Madison Remix) (Cut From Minas Set)-enTc.mp3\nAndre Visior - Daylight (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nAndy Moor feat. Hysteria - Leave Your World Behind (HeatBeat Remix) (Cut From Sied Set)-enTc.mp3\nAnivia - When Hope Is Fading (Alexander Zhakulin Remix) (Cut From Eximinds Set)-enTc.mp3\nAraya - Sonar (Original Mix) (Cut From RandomX Set)-enTc.mp3\nArty - Gentle Touch (Eximinds Remix) (Cut From Eximinds Set)-enTc.mp3\nBen Stone - Timeless (Cold Rush Remix) (Cut From AEZ Set)-enTc.mp3\nBen Stone - Timeless (Mike Van Fabio Remix) (Cut From A&amp;F Set)-enTc.mp3\nBinary Finary - 1998 (Tonny Nesse Remix) (Cut From A&amp;F Set)-enTc.mp3\nBryan Kearney - Mexican Rave (Jordan Suckley Remix) (Cut From Kearney Set)-enTc.mp3\nD-Mad - XLNT (Original Mix) (Cut From Shiver Set)-enTc.mp3\nDallonte - Hearts Keeper (Autumn Colors Mix) (Cut From Shah Set)-enTc.mp3\nDavid Broaders - Curracloe (Vintage &amp; Morelli Remix) (Cut From Ronde Set)-enTc.mp3\nDavid Broaders - Curracloe (Vintage Morelli Remix) (ABGT 043 Rip)-enTc.mp3\nDiablik &amp; Oyaebu - It's Noise (Original Mix) (Cut From Liquid Vision Set)-enTc.mp3\nDJ Feel feat. Jan Johnston - Illuminate (Cut From Criado Set)-enTc.mp3\nDriftmoon - ID (Intro &amp; Original Mix) (Cut From Pizz@dox Set)-enTc.mp3\nEaston - Lake District (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nEddie D - Reeshing (Festival Edit) (Cut From Peterson Set)-enTc.mp3\nEnviado Vida - Prior Tenement (Blood Groove &amp; Kikis Remix) (Cut From Ronde Set)-enTc.mp3\nEximinds - ID (Cut From Eximinds Set)-enTc.mp3\nFrancesco Rossi - Paper Aeroplane (Clock Place Remix) (ABGT 043 Rip)-enTc.mp3\nFrench Skies - Shine (Outer Space Remix) (Cut From A&amp;F Set)-enTc.mp3\nFuntom Cruisers - Boarding (Mindset's Summershine Remix) (Cut From Ronde Set)-enTc.mp3\nFuntom Cruisers - Boarding (Original Mix) (Cut From Sheperd Set)-enTc.mp3\nFuturistic Polars - Blackout (Cut From Jules Set)-enTc.mp3\nGai Barone - Sophie Marceu (Cut From MIKE Set)-enTc.mp3\nGiddy &amp; Jaimy K - Veritas (Cut From Shiver Set)-enTc.mp3\nGordey Tsukanov &amp; Andrey Mirutenko - Breath Of Fire (Original Mix) (Cut From Tucandeo Set)-enTc.mp3\nGronroos &amp; Bravo - Speed (Original Mix) (Cut From Shiver Set)-enTc.mp3\nHolliday &amp; Valker - Amnesia (Original Mix) (Cut From AEZ Set)-enTc.mp3\nIllumia - I See U (Original Mix) (Cut From Eximinds Set)-enTc.mp3\nIlya Vig - Heartbeat (Skyward Music) (Cut From GO Set)-enTc.mp3\nIndecent Noise - Razor (James Dymond Remix) (Cut From Ind Noise Set)-enTc.mp3\nJase Thirlwall - Thunderflash (Indecent Noise Remix) (Cut From Ind Noise Set)-enTc.mp3\nKaimo K - Machette (Cut From Pizz@dox Set)-enTc.mp3\nKiholm &amp; Kris O'Neil feat. Roberta Harrison - Nothing Remains (Lope &amp; Kantola Remix) (Cut From O'Neil Set)-enTc.mp3\nKlauss Goulart - RipOff (Original Mix) (Cut From Bin Fin Set)-enTc.mp3\nKlauss Goulart - RipOff (Original Mix) (Cut From Burrows Set)-enTc.mp3\nLouis Tan - City of Lights (Original Mix) (Cut From Eximinds Set)-enTc.mp3\nM.I.K.E &amp; Fred Baker pres. Active Sight - Never Ending (Bryan Kearney Remix) (Cut From A&amp;F Set)-enTc.mp3\nM83 - Midnight City (Agent K &amp; Bella Remix) (Cut From Eximinds Set)-enTc.mp3\nMarco Lys &amp; Funkerman - Ya Mamma (Cut From Jules Set)-enTc.mp3\nMark Keyo - Power Chord (Original Mix) (Cut From Eximinds Set)-enTc.mp3\nMark Sadness - Ordinary Emotions (New World Remix) (Cut From Suzy Set)-enTc.mp3\nMatt Eray - Until You Fall Asleep (Original Mix) (Cut From MORPH Set)-enTc.mp3\nMatthew Peterson &amp; Andromedha - ID (Original Mix) (Cut From Peterson Set)-enTc.mp3\nMatthew Peterson &amp; TMX - ID (Original Mix) (Cut From Peterson Set)-enTc.mp3\nMatthew Peterson - ID (Original Mix) (Cut From Peterson Set)-enTc.mp3\nMaxi Valvona - Filtered Frequencies (Final Mix) (Cut From Eruvie Set)-enTc.mp3\nMike van Fabio - Tibetan Wind (Original Mix) (Cut From Angel Ace Set)-enTc.mp3\nMiroslav Vrlik - Palm Shadow (Set Rip)-enTc.mp3\nMiroslav Vrlik - Saturn's Rings (Set Rip)-enTc.mp3\nMitomi Tokoto - Hacienda (Original Mix) (Cut From Peterson Set)-enTc.mp3\nMostfa &amp; Mostfa pres. Craft Integrated - Orgasm (Spliff Remix) (Cut From Del Mar Set)-enTc.mp3\nMuska - Moonrise (Cut From Shiver Set)-enTc.mp3\nNaian - Eta Piscium (Cut From Nifra Set)-enTc.mp3\nNaudi - See You Soon (Original Mix) (Cut From Eximinds Set)-enTc.mp3\nNic Toms - Orbit (Cut From RandomX Set)-enTc.mp3\nNicole Scherzinger - Boomerang (Veselin Tasev Uplifting Dub Remix) (Cut From Tasev Set)-enTc.mp3\nNiko Pavlidis featuring Row - See Inside (27th Symphony Mix) (Cut From Coastline Set)-enTc.mp3\nNinesh Baby &amp; D05 - Skyze (Heever Remix) (Cut From Ronde Set)-enTc.mp3\nNoise Jackers - Fire Wire (George Acosta Mix) (Cut From Jules Set)-enTc.mp3\nO.B.M Notion with Mostfa &amp; Mostfa - The Land of Myths (Farzam Remix) (Cut From AEZ Set)-enTc.mp3\nOliver Englafjord - Solsetur (Original Mix) (Cut From Peterson Set)-enTc.mp3\nOliver Heldens - Striker (Original Mix) (Cut From Ferry Set)-enTc.mp3\nOliver V pres. AirDream 62 - Earth (Original Mix) (Cut From ReOrder Set)-enTc.mp3\nOzo Effy - Kings (Original Mix) (Cut From Effy Set)-enTc.mp3\nPlexland - Heaven's Academy (Minamoca Remix) (Cut From Minamoca Set)-enTc.mp3\nPROFF &amp; Kaspar Kochker - One More Request (August Rush Remix) (Cut From Eximinds Set)-enTc.mp3\nPvR - Refraction (Cut From Fast Dist Set)-enTc.mp3\nRobbie Van Doe - This Is It (Chris Porter Remix) (Cut From Powers Set)-enTc.mp3\nRoyksopp - Running to the Sea (Seven Lions Remix) (ABGT 043 Rip)-enTc.mp3\nRuben de Ronde &amp; Rodg - Earning Spurs (Cut From Ronde Set)-enTc.mp3\nScorpius - Doomsday (Gelardi's TFI Remix) (Cut From RandomX Set)-enTc.mp3\nSergey Shabanov - Clear Secret (Cut From RandomX Set)-enTc.mp3\nShawn Rubens - Basiell (Cut From Ronde Set)-enTc.mp3\nSied van Riel &amp; Eximinds - ID (Cut From Sied Set)-enTc.mp3\nSneijder &amp; Bryan Kearney - Proper Order (Cut From Kearney Set)-enTc.mp3\nStas Isometrica feat. Edward Lytkin - New Universe (Club Mix) (Cut From Del Mar Set)-enTc.mp3\nStephen Kirkwood - Mars One (Original Mix) (Cut From Bin Fin Set)-enTc.mp3\nStephen Kirkwood - Mars One (Original Mix) (Cut From Burrows Set)-enTc.mp3\nSunlounger - Balearic Romance (Original Mix) (Cut From Shah Set)-enTc.mp3\nSunset &amp; Myk Bee - After The Sunrise (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nSunset Heat - Hearts of Iron (Original Mix) (Cut From Suzy Set)-enTc.mp3\nTasso - Savoy (Original Mix) (Cut From Tasso Set)-enTc.mp3\nThe Cosmic Doors - Bosphorus (Original Mix) (Cut From AEZ Set)-enTc.mp3\nThomas Coastline - Crossover (Cut From Coastline Set)-enTc.mp3\nTrance Connection - Arctic Warrior (Original Mix) (Cut From Trance Connection Set)-enTc.mp3\nTranzlift vs. Aerial State - Loving You (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nTrilucid &amp; Philthy Chit - Syntax (Cut From MIKE Set)-enTc.mp3\nTsvetomir Genchev - Run &amp; Break (Original Mix) (Cut From GO Set)-enTc.mp3\nUdm - Endless World (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nUndr Cntrl Dual - Shaman (Gregorian Rain Dance Remix) (Cut From Ronde Set)-enTc.mp3\nVahad Bandari - Feel Free To Cry (The Theme) (Cut From RandomX Set)-enTc.mp3\nWestern Disco - The Sun (Paul Oakenfold Remix) (Cut From Jules Set)-enTc.mp3\nZ.E.R.O. - Absolution (Original Mix) (Cut From Tritonal Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:ddb28a8fb76a6665aeebf7cc95604927278fb805","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+5th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddb28a8fb76a6665aeebf7cc95604927278fb805","infoHashBuffer":{"type":"Buffer","data":[221,178,138,143,183,106,102,101,174,235,247,204,149,96,73,39,39,143,184,5]},"announce":[],"urlList":[]}}