{"title":"Blaming the Jews (Muslim Antisemitism) 2003 [Islam]","uid":10590498,"size":354740224,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:de0ac02afb27dfcbc0751175290504df839c9626&amp;dn=Blaming+the+Jews+%28Muslim+Antisemitism%29+2003+%5BIslam%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kidon01","files":1,"time":1405791055,"description":"Blaming the Jews, by David Aaronovitch, aired on UK Channel 4, Saturday 28th June 2003.\n\nBlaming The Jews\n\n\nSome extreme anti-Semitics maintain the Jews were behind 9/11, are responsible for the spread of AIDS and other diseases, and that they invented the Holocaust.\n\nThe Jews are also accused of murdering babies in ritual sacrifice, and of working towards a secret goal of world domination.\n\nJournalist and commentator David Aaronovitch travels to the Middle East to find out just how widespread such views are, what the causes are, and to ask what can be done to combat such thinking.\n\nTravelling between Israel and Gaza, Aaronovitch encounters a disturbing degree of hostility among the Palestinians. A trawl through recent excerpts of Palestinian TV reveals just how much animosity there is directed towards the Jews.\n\nThe problem is not exclusive to Palestine. In Egypt, the editor of the country's most respected newspaper, Al Akhram, was once prosecuted in France for distributing offensive material about the Damascus blood libel of 1840.\n\nHerein lies the problem for Aaronovitch. There are genuine and heartfelt grievances about Arab land, and the Israeli problem is a profound and complex one.\n\nBut as long as anti-Semitism is allowed to prosper, the distance between the two faiths will remain.\n\nModerate Israelis will be alienated and take a more hard-line stance, while young Muslims will continue with the lunacy of suicide bombings.\n\nIn the war in the Middle East, both faiths are losing.","torrent":{"xt":"urn:btih:de0ac02afb27dfcbc0751175290504df839c9626","amp;dn":"Blaming+the+Jews+%28Muslim+Antisemitism%29+2003+%5BIslam%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de0ac02afb27dfcbc0751175290504df839c9626","infoHashBuffer":{"type":"Buffer","data":[222,10,192,42,251,39,223,203,192,117,17,117,41,5,4,223,131,156,150,38]},"announce":[],"urlList":[]}}