{"title":"[ WIN ITA ] Paint shop pro 9 [volpebianca].rar","uid":4663328,"size":105130559,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:de3c11986cb78c92f57d80b70ab5fce56031fcb4&amp;dn=%5B+WIN+ITA+%5D+Paint+shop+pro+9+%5Bvolpebianca%5D.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lore46","files":1,"time":1232476322,"description":"Paint Shop Pro 9 ÃƒÂ¨ la nuova versione del famoso programma di fotoritocco e grafica ora disponibile anche in italiano. La confezione contiene il voluminoso manuale di oltre 500 pagine, il CD del programma, la scheda di registrazione da inviare alla Questar e un coupon Avery per ricevere in omaggio una campionatura di carte fotografiche Avery. L'installazione, richiede un po' di pazienza in quanto il programma copia su disco fisso quasi 300 MB di file. Per poter utilizzare con soddisfazione Pain Shop 8 ÃƒÂ¨ opportuno disporre di almeno 256 MB di RAM (anche se il minimo consigliato sono 128), specie se si elaborano file grafici pesanti. La presentazione ufficiale della nuova versione 8 ÃƒÂ¨ avvenuta la scorsa estate, in quel periodo era perÃƒÂ² disponibile solo la versione inglese, ora grazie alla localizzazione, sia del software che del manuale, anche gli utenti che non conoscono la lingua inglese potranno avvalersi di un potente strumento di fotoritocco e grafica come Paint Shop Pro. Per chi non lo conoscesse, oltre a rimandarvi alle recensioni delle precedenti versioni pubblicate su New On Line (leggi recensione Paint Shop 7), il software americano permette di modificare, convertire, elaborare e migliorare e stampare le immagini. Rispetto alla precedente versione, ÃƒÂ¨ stata migliorata l'interfaccia, con icone e menu che permettono di accedere ai comandi piÃƒÂ¹ frequentemente usati in modo immediato ed intuitivo. La barra e gli strumenti ÃƒÂ¨ ora raggruppata in categorie in base alla funzione che ogni strumento svolge. Tra le finestre che ÃƒÂ¨ possibile tenere aperte, c'ÃƒÂ¨ anche quella delle esercitazioni in linea. Queste ultime assistono l'utente durante le piÃƒÂ¹ comuni procedure per permettergli di raggiungere velocemente i risultati desiderati. Gli argomenti proposti sono circa 50. Per i piÃƒÂ¹ esperti sono stati invece aggiunti nuovi strumenti professionali per elaborare le immagini, come ad esempio il pennello distorsione, lo strumento di raddrizzamento, ecc. Non mancanoL'interfaccia di Paint Shop Pro 8 nuovi filtri ed effetti speciali come ad esempio quello che corregge le distorsioni delle lenti che provocano alterazioni a cuscino, a barile o fisheye. Anche le funzioni di stampa sono state migliorate: ora ÃƒÂ¨ possibile selezionare diversi modelli predefiniti che utilizzano layout di pagine comuni come A4, fogli commerciali, biglietti da visita e ovviamente carte fotografiche. Oltre ai numerosissimi formati grafici supportati giÃƒÂ  dalle precedenti versioni, ora il software gestisce anche i Jpeg 2000, i PDF e i Wireless Bitmap. Se si utilizza una fotocamera che gestisce le informazioni supplementari EXIF, come ad esempio l'ora, data, risoluzione, apertura dell'obiettivo, ecc. con Paint Shop Pro ÃƒÂ¨ possibile visualizzarle e conservarle quando le immagini si salvano nel formato proprietario PSP o nel JPG o TIFF. Per migliorare la produttivitÃƒÂ , e quindi sveltire una serie di operazioni ripetitive, ÃƒÂ¨ stato aggiunto un modulo per la creazione di script con il quale ÃƒÂ¨ possibile attivare una serie di comandi personalizzati che agiscono anche su gruppi di file. Tra le tante e nuove funzioni aggiunte segnaliamo quella per il foto ritocco che con un solo comando, che migliora le immagini agendo su luminositÃƒÂ , saturazione e bilanciamento del colore, contrasto ed altro ancora. Trattandosi di una funzione automatica va utilizzata con buon senso: in alcuni casi si ottengono ottimi risultati, in altri ÃƒÂ¨ opportuno agire manualmente sulla foto. Per chi desidera un programma di grafica di immediato utilizzo, ma che permette, grazie ai numerosi strumenti professionali, di elaborare e migliorare nel minimo dettaglio le immagini, troverÃƒÂ , senza spendere un capitale, in Paint Shop Pro 9 quel che cerca. \n\nfor more information visit www.volpebianca.org","torrent":{"xt":"urn:btih:de3c11986cb78c92f57d80b70ab5fce56031fcb4","amp;dn":"%5B+WIN+ITA+%5D+Paint+shop+pro+9+%5Bvolpebianca%5D.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de3c11986cb78c92f57d80b70ab5fce56031fcb4","infoHashBuffer":{"type":"Buffer","data":[222,60,17,152,108,183,140,146,245,125,128,183,10,181,252,229,96,49,252,180]},"announce":[],"urlList":[]}}