{"title":"Planet Earth: Ocean Deep 1080i.DivX.AC3.mkv","uid":3674148,"size":2432484794,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:df3a88e9bed962d3143f9fdb026eb663de4707bb&amp;dn=Planet+Earth%3A+Ocean+Deep+1080i.DivX.AC3.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bell0q","files":1,"time":1177654153,"description":"Planet Earth: Ocean Deep\nVideo: MKV, 3viX 4.5.1 (DivX), 1080i HD\nResolution: 1920x1080 (1.77:1)\nFPS: 29.97 fps, 6175kbps\nAudio: AC3 5.1+LFE, 48kHz, 384kbps\nBitrate: 6.40Mbps\nDuration: 49:26\nSource: HDTV, Discovery HD Theater\n\nOceans cover two-thirds of the planet yet remain largely unexplored.\n\nFor animals that dwell on the surface, or within the deepest abyss, it&amp;#039;s finding food and conserving energy that&amp;#039;s paramount.\n\nPlanet Earth travels the world to reveal the extraordinary lengths life takes in its bid to survive this immense and barren realm.\n\nOff Venezuela, a 30 tonne whale shark is filmed gorging on a school of fish rather than its normal plankton diet - proving adaptation and change is the key to survival.\n\nThe fearsome oceanic white tip shark, fast becoming a global rarity, hunts the uppermost 100 metres of the sea alone, while fast-moving pods of hundreds of dolphins charge en masse in search of prey.\n\nPlanet Earth&amp;#039;s unique overhead heli-gimbal camera reveals the impressive swimming prowess of ocean-dwelling common dolphin as they rocket at more than 30 kilometres an hour.\n\nBy night the ocean again spills into dramatic life. The nocturnal upward migration of billions of plankton near Hawaii is eagerly awaited by giant manta rays gorging in the darkness.\n\nIn Costa Rica the night hides squadrons of squid, desperately dodging the sonar of hunting spotted dolphin.\n\nDescending into the abyss, surprising techniques for conserving energy are revealed as deep sea octopus fly with wings, and bizarre vampire squid use bioluminescence to create an extraordinary colour display, designed to scare the boldest predators.\n\nThe voyage bursts into life in the deep off Mexico, with the first ever time-lapse footage taken from 2,000 metres down - eels, crabs and giant woodlice-like isopods devour a large carcass, completely consuming it within three hours.\n\nTo survive the ocean its inhabitants must know when to conserve their resources and when to burn fuel for speed.\n\nNowhere is this more apparent than in the duel-like chase of the hunting sailfish. Extraordinary images capture the moment when more than 100 of these exquisite three-metre fish gun down their prey, each seeking their turn in a perfectly choreographed dance of death.","torrent":{"xt":"urn:btih:df3a88e9bed962d3143f9fdb026eb663de4707bb","amp;dn":"Planet+Earth%3A+Ocean+Deep+1080i.DivX.AC3.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df3a88e9bed962d3143f9fdb026eb663de4707bb","infoHashBuffer":{"type":"Buffer","data":[223,58,136,233,190,217,98,211,20,63,159,219,2,110,182,99,222,71,7,187]},"announce":[],"urlList":[]}}