{"title":"Soul Calibur IV [USA][PS3][Multi5][Spanish][www.consolasatope.co","uid":5952293,"size":4348132797,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e019f2403b3f18bbee61278ee15d1190b0c1a299&amp;dn=Soul+Calibur+IV+%5BUSA%5D%5BPS3%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"consolasatope","files":47,"time":1289522588,"description":"Plataforma: PS3\nGÃƒÂ©nero: Lucha\nRegiÃƒÂ³n: USA\nDesarrollo: Namco Bandai\nDistribuciÃƒÂ³n: Namco Bandai\nIdiomas: Multi5 Incluido EspaÃƒÂ±ol\nOnline: SÃƒÂ­\nMultijugador: SÃƒÂ­\nFormato: FullBRD - 6.62 Gb\nCompresiÃƒÂ³n: Rar - 4.04 Gb\nHDD: Interno y Externo\nMÃƒÂ©todo de carga: Ps3Key Firm V4 + Open Manager 2.1I\n\nResumen:\nSoul Calibur IV es la cuarta entrega de la aclamada serie de juegos de pelea con armas Soulcalibur. Debido a que en los vÃƒÂ­deos se ha mencionado que la historia &quot;se acerca a su inevitable final&quot;, se cree que esta podrÃƒÂ­a ser la conclusiÃƒÂ³n de la trama principal, aunque Namco no ha hecho ninguna confirmaciÃƒÂ³n oficial.\n\nCaracteristicas\n\nSoulcalibur IV ha recibido varias crÃƒÂ­ticas sobre su nuevo modo de juego. Muchos personajes no cambian mucho su forma de juego en comparaciÃƒÂ³n a Soulcalibur III, tales como Cervantes, Yoshimitsu o Kilik, pero otros personajes, como Ivy, Mitsurugi o Taki han recibido grandes cambios en su modo de juego. Aunque muchos movimientos originales persisten en el juego, algunos de estos sÃƒÂ³lo pueden ser hechos en cierta posiciÃƒÂ³n que antes no se exigÃƒÂ­a. Estos cambios se deben a que ahora el juego presenta un modo multijugador en lÃƒÂ­nea.\n\nLos movimientos mÃƒÂ¡s famosos de toda la saga, que son Summon Suffering y Calamity Symphony, los cuales son dos agarres exclusivos de Ivy, han sido completamente cambiados. Algunos piensan que ahora son mÃƒÂ¡s fÃƒÂ¡ciles de hacer, pero su combinaciÃƒÂ³n, al momento de efectuarse, debe ser mucho mÃƒÂ¡s rÃƒÂ¡pida y precisa a comparaciÃƒÂ³n de los otros Soulcalibur. Pero estos cambios se deben a que uno solo de estos movimientos te quita 80 puntos de vida (cada jugador tiene 200 predeterminados), mientras un agarre normal te quita 45 - 60. El &quot;Just Input&quot; (cuando presionas la combinaciÃƒÂ³n perfectamente) de Calamity Symphony hace 100 de daÃƒÂ±o.\n\nModos De Juego\n\n * Historia: El nuevo modo Historia es muy similar para todos los personajes. Todos tienen 5 niveles y, a excepciÃƒÂ³n de Algol, todos empiezan en punto determinado y hacen su camino hacia La Torre de las Almas Perdidas. Cada historia contiene cinco niveles con diferentes enemigos y argumento ÃƒÂºnico entre ellos.\n * La Torre de las Almas Perdidas: El nuevo modo de juego de Soulcalibur IV se trata de una torre con 60 niveles de &quot;Ascenso&quot; y pisos ilimitados en &quot;Descenso&quot; (modo Survival). Cada nivel presenta cualidades ÃƒÂºnicas y efectos diferentes, como variaciones en el modo de ganar y bonus si se completa cierto objetivo durante los combates. En algunos niveles se pueden aliar hasta 3 diferentes personajes (o el mismo con diferentes trajes) para pasar por el nivel.\n * Arcade: El tÃƒÂ­pico modo de 8 niveles donde los primeros 4 encuentros son al azar, el quinto es un combate del destino (que tendrÃƒÂ¡ que ver con la historia del jugador seleccionado), el sexto es Nightmare o Siegfried (dependiendo de la alineaciÃƒÂ³n del jugador), el sÃƒÂ©ptimo siempre serÃƒÂ¡ El Aprendiz (Starkiller, que es quizÃƒÂ¡s el nivel mÃƒÂ¡s complicado del modo Arcade) y el octavo nivel es Algol. Al terminar se puntÃƒÂºa al jugador dependiendo de sus combates.\n * Entrenamiento: El tÃƒÂ­pico modo de entrenamiento de Soulcalibur.\n * Versus: Pelea contra la computadora en 5 dificultades diferentes (FÃƒÂ¡cil, Normal, DifÃƒÂ­cil, Muy DifÃƒÂ­cil, Maestro Experto) en batallas de 1 a 5 rondas o multijugador local.\n * En lÃƒÂ­nea: Ve las estadÃƒÂ­sticas mundiales del juego o pelea en lÃƒÂ­nea en 2 diferentes modos &quot;EstÃƒÂ¡ndar&quot; y &quot;Especial&quot; (en este ÃƒÂºltimo los efectos del equipo y espadas estÃƒÂ¡n activados) en peleas normales o igualadas.\n * Museo: El Museo ha sido el mÃƒÂ¡s criticado debido a su simpleza comparado con otras entregas. En ÃƒÂ©ste se albergan cinemÃƒÂ¡ticas, entradas, finales de personajes, fotos y las biografÃƒÂ­as de cada personaje. A diferencia de las demÃƒÂ¡s BiografÃƒÂ­as didÃƒÂ¡cticas de las otras entregas de Soulcalibur, en ÃƒÂ©ste las biografÃƒÂ­as muestran la uniÃƒÂ³n de personajes, enemigos y aliados, pero sÃƒÂ³lo se muestra una foto de cada personaje y su biografÃƒÂ­a (sin poder escuchar los diÃƒÂ¡logos o ver el escenario de cada personaje).\n * CreaciÃƒÂ³n de Personaje: A pesar que ahora se puede editar a cualquier personaje a gusto propio, los estilos de pelea personalizados fueron eliminados, haciendo de cada personaje personalizado un &quot;clon&quot; de otro original. TambiÃƒÂ©n aquÃƒÂ­ se pueden comprar todos los personajes desbloqueables a excepciÃƒÂ³n de el Aprendiz, Darth Vader/Yoda, Algol y los Bonus, el resto puede comprarse por 4000 de oro cada uno. Ahora puedes editar un mÃƒÂ¡ximo de 50 personajes (incluyendo personajes originales o personalizables). Los ÃƒÂºnicos personajes que no puedes ser editados en ropa y color de atuendo son Yoda, Darth Vader, El Aprendiz, Algol y los personajes Extra (Scherezade, Shura, Kamikirimusi, Angol Fear y Ashlotte) ","torrent":{"xt":"urn:btih:e019f2403b3f18bbee61278ee15d1190b0c1a299","amp;dn":"Soul+Calibur+IV+%5BUSA%5D%5BPS3%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e019f2403b3f18bbee61278ee15d1190b0c1a299","infoHashBuffer":{"type":"Buffer","data":[224,25,242,64,59,63,24,187,238,97,39,142,225,93,17,144,176,193,162,153]},"announce":[],"urlList":[]}}