{"title":"p≡p for Android","uid":15793698,"size":18046052,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:e0751d088baf53937ae185adba5e2845c58f6235&amp;dn=p%26equiv%3Bp+for+Android&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1473419884,"description":"p≡p is a cyber security solution which protects the confidentiality and reliability of communications for citizens, for public offices and for enterprises. It provides end-to-end cryptography in all common crypto-standards through the app that you install on your phone.\r\n\r\np≡p for Android makes e-mail encryption easy on mobile devices for everyone by automatic and seamless integration of end-to-end encryption. Set it up with your existing e-mail address under a minute. Send and receive as many messages as you want without any restrictions on the number of devices the p≡p app runs on.\r\n\r\np≡p supports the user with advanced automation and is fully compatible with OpenPGP\r\n\r\n★ it will automatically encrypt your e-mail and attachments, including pictures\r\n★ it can ensure no one can intercept your perfectly encrypted e-mail\r\n★ it is peer-to-peer and uses no central service\r\n★ it works with all your existing e-mail account(s)\r\n★ it can authenticate your communication partner and prevent identity theft\r\n★ it offers security and privacy by default\r\n\r\np≡p is end-to-end and supports all commonly used Android devices.\r\n\r\np≡p is easy for your recipients too – depending on their security capabilities, they can exchange encrypted messages with you.\r\n\r\nWith p≡p, you don’t need a separate account, you can send secure messages to anyone anywhere, regardless of their email provider.\r\n\r\nJust install the app and you can communicate in confidence with your peers","torrent":{"xt":"urn:btih:e0751d088baf53937ae185adba5e2845c58f6235","amp;dn":"p%26equiv%3Bp+for+Android","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0751d088baf53937ae185adba5e2845c58f6235","infoHashBuffer":{"type":"Buffer","data":[224,117,29,8,139,175,83,147,122,225,133,173,186,94,40,69,197,143,98,53]},"announce":[],"urlList":[]}}