{"title":"Dancing in the Glory of Monsters - The Collapse of the Congo and","uid":8890916,"size":1919853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0c4c4f69f6cb78db4251b3e9fd6a3e0fecfbd3f&amp;dn=Dancing+in+the+Glory+of+Monsters+-+The+Collapse+of+the+Congo+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"livhre","files":-1,"time":1378581344,"description":"At the heart of Africa is Congo, a country the size of Western Europe, bordering nine other nations, that since 1996 has been wracked by a brutal and unstaunchable war in which millions have died. And yet, despite its epic proportions, it has received little sustained media attention.\nIn this deeply reported book, Jason Stearns vividly tells the story of this misunderstood conflict through the experiences of those who engineered and perpetrated it. He depicts village pastors who survived massacres, the child soldier assassin of President Kabila, a female Hutu activist who relives the hunting and methodical extermination of fellow refugees, and key architects of the war that became as great a disaster as--and was a direct consequence of--the genocide in neighboring Rwanda. Through their stories, he tries to understand why such mass violence made sense, and why stability has been so elusive.\n\nThrough their voices, and an astonishing wealth of knowledge and research, Stearns chronicles the political, social, and moral decay of the Congolese State.","torrent":{"xt":"urn:btih:e0c4c4f69f6cb78db4251b3e9fd6a3e0fecfbd3f","amp;dn":"Dancing+in+the+Glory+of+Monsters+-+The+Collapse+of+the+Congo+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0c4c4f69f6cb78db4251b3e9fd6a3e0fecfbd3f","infoHashBuffer":{"type":"Buffer","data":[224,196,196,246,159,108,183,141,180,37,27,62,159,214,163,224,254,207,189,63]},"announce":[],"urlList":[]}}