{"title":"SHAREGO-EBOOK When Titans Clashed How the Red Army Stopped Hitle","uid":4627491,"size":5614961,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0d1da14b1201b37682391f33d656b806a67e796&amp;dn=SHAREGO-EBOOK+When+Titans+Clashed+How+the+Red+Army+Stopped+Hitle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dodgerblue","files":1,"time":1231266495,"description":"SHAREGO-EBOOK When Titans Clashed How the Red Army Stopped Hitler\n[IMG]http://i269.photobucket.com/albums/jj44/downarchive2/member2/51VYCK2D3CL.jpg[/IMG]\nWhen Titans Clashed: How the Red Army Stopped Hitler (Modern War Studies)\nUniv Pr of Kansas | 1995-12 | English | ISBN: 070060717X | 349 pages | HTML | \n\nBy the time Pearl Harbor had ripped apart America's peacetime pretensions, the German blitzkrieg had already blasted the Red Army back to the gates of Moscow. Yet, less than four years later, the Soviet hammer-and-sickle flew above the ruins of Berlin, stark symbol of a miraculous comeback that destroyed the German army and shattered Hitler's imperial designs.\n\nTold in swift stirring prose, When Titans Clashed provides the first full account of this epic struggle from the Soviet perspective. David Glantz, one of the world's foremost authorities on the Soviet military, and Jonathan House present a fundamentally new interpretation of what the Russians called the &quot;Great Patriotic War.&quot; Based on unprecedented access to formerly classified Soviet sources, they counter the German perspective that has dominated previous accounts and radically revise our understanding of the Soviet experience during World War II.\n\nPlacing the war within its wider political, economic, and social contexts, the authors recount how the determined Soviets overcame their initial disasters to defeat the most powerful army ever assembled. As they vividly show, this truly was war waged on a titanic scale, sweeping across a half-million square miles from Moscow to Berlin, featuring monumental offensives and counteroffensives, and ultimately costing both sides combined a staggering forty million casualties.\n\nTheir work offers new revelations on Soviet strategy and tactics, Stalin's role as supreme commander of the Red Army, the emergence of innovative and courageous commanders in the crucible of combat, numerous previously concealed or neglected military operations, German miscalculations on the road to the Red capital, the effect of D-Day and the &quot;second front&quot; on the Soviet effort, and the war's devastating impact on the Soviet economy and civilian population.\nAn essential volume for anyone interested in World War II or Soviet history, When Titans Clashed will change forever how we look at one of the greatest military confrontations in world history.\n\nThis book is part of the Modern War Studies series.\n[img]http://1337x.org/torrentimg-9828.png[/img]","torrent":{"xt":"urn:btih:e0d1da14b1201b37682391f33d656b806a67e796","amp;dn":"SHAREGO-EBOOK+When+Titans+Clashed+How+the+Red+Army+Stopped+Hitle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0d1da14b1201b37682391f33d656b806a67e796","infoHashBuffer":{"type":"Buffer","data":[224,209,218,20,177,32,27,55,104,35,145,243,61,101,107,128,106,103,231,150]},"announce":[],"urlList":[]}}