{"title":"Reggae - The Story of Jamaican Music - BBC","uid":13417250,"size":4469256192,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e17be443ec087b0f431cb0eb070cc04cf933218f&amp;dn=Reggae+-+The+Story+of+Jamaican+Music+-+BBC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GRNS3","files":18,"time":1454508225,"description":"Here is another nice bootleg. Check my account for more classic bootlegs.\r\n\r\nPlease enjoy, share with friends and please seed :)\r\n\r\n\r\nReggae - the story of Jamaican music\r\n\r\nProgramme 1 - Forward March \r\nProgramme 2 - Rebel Music\r\nProgramme 3 - As Raw As Ever\r\n\r\n\r\n1 - Train To Skaville / Forward March\r\n\r\nThe early roots of reggae music and its rising popularity. How music has been used to describe experiences and how these social songs were written. In the 60s', immigration from Jamaica to the United Kingdom has increased. Ska, it is taken by assault by whites. The program also covers many musical scenes that the social climate in Jamaica during the 60s'.\r\nIn the late sixties, reggae was established as pop music in the mainstream in Britain and is increasingly made in this country ... Dandy Livingstone, Eddy Grant and Greyhound, for example ...\r\n\r\n\r\n2 - Rebel Music\r\n\r\nA look at the Reggae in the 1970s, ten years after Britain gave independence to Jamaica. The disillusionment of the youth of Jamaica and the harsh economic conditions of the Islands resonate in anger in the words of Roots music.\r\nThe era of Bob Marley, the first superstar of the country, alongside Lee &quot;Scratch&quot; Perry, one of the most significant producers and also King Tubby, popularizing the Dub in remixing records.\r\nIn Britain, the black youth identifies with its root to create their own style, Reggae UK, with bands like Steel Pulse and Aswad appearance.\r\n\r\n\r\n3 - Inna Dancehall Style / As Raw As Ever\r\n\r\nThe rise of Reggae after the death of Bob Marley, including the beginning of Dancehall. In Latin, Reggae connects with the hip-hop and DJ Shaba Ranks. In the street, new styles dominate in Britain and the Nu-Roots up in Jamaica","torrent":{"xt":"urn:btih:e17be443ec087b0f431cb0eb070cc04cf933218f","amp;dn":"Reggae+-+The+Story+of+Jamaican+Music+-+BBC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e17be443ec087b0f431cb0eb070cc04cf933218f","infoHashBuffer":{"type":"Buffer","data":[225,123,228,67,236,8,123,15,67,28,176,235,7,12,192,76,249,51,33,143]},"announce":[],"urlList":[]}}