{"title":"The Body and the Arts","uid":6760223,"size":2897789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e246bb16d49d539624b0b64fdc9baa4bbfc4bedf&amp;dn=The+Body+and+the+Arts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1319188708,"description":"The Body and the Arts\nCorinne Saunders (Editor), Ulrika Maude (Editor), Jane Macnaughton (Editor)\n\nHardcover: 312 pages\nPublisher: Palgrave Macmillan (26 Mar 2009)\nLanguage English\nISBN-10: 0230552048\nISBN-13: 978-0230552043\n\nProduct Description:\n\nThe Body and the Arts focuses on the dynamic relation between the body and the arts: the body as inspiration, subject, symbol and medium. Contributors from a variety of academic and artistic disciplines explore this complex and shifting relation across a range of periods, literatures and other art forms, spanning the subjects of medicine, literature from the classical period to the present, and the visual and performing arts, including film, dance and opera. The book engages with enduring cultural issues: the materiality of the body, the tension between actual and ideal, beauty and horror, the interconnection of the history of medicine with the cultural history of the body, the complex process of negotiation between the actual human body and the artist, and the effect of science and technology on artistic representations of the body. The volume includes essays by Marina Warner, Antony Gormley and P. D. James.\n\nBook Description:\n\nSixteen essays on the dynamic relation between the body and the arts: the body as inspiration, subject, symbol and medium in medicine, literature, and the visual and performing arts","torrent":{"xt":"urn:btih:e246bb16d49d539624b0b64fdc9baa4bbfc4bedf","amp;dn":"The+Body+and+the+Arts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e246bb16d49d539624b0b64fdc9baa4bbfc4bedf","infoHashBuffer":{"type":"Buffer","data":[226,70,187,22,212,157,83,150,36,176,182,79,220,155,170,75,191,196,190,223]},"announce":[],"urlList":[]}}