{"title":"Neil Gaiman - The case of the disapearance of miss Finch [CBR]","uid":4905247,"size":26400239,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e2500666b69b9fe72e9f02c36527ccffc04bc1c2&amp;dn=Neil+Gaiman+-+The+case+of+the+disapearance+of+miss+Finch+%5BCBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1242855128,"description":"Neil Gaiman - The facts in the case of the disapearance of miss Finch [CBR]\n\nCome, come and hear of the strange and terrible tale of Miss Finch, an exacting woman befallen by mystery and abduction deep under the streets of London! New York Times bestselling author Neil Gaiman delivers another stunning hardcover graphic novel with longtime collaborator Michael Zulli (Creatures of the Night, The Sandman). This is the first comics adaptation of his popular story &quot;The Facts in the Case of the Departure of Miss Finch,&quot; which saw print only in the U.K. edition of Gaiman's award-winning work Smoke and Mirrors: Short Fictions and Illusions and was recently interpreted for his Speaking in Tongues CD. The Facts in the Case of the Departure of Miss Finch is a &quot;mostly true story&quot; that combines the author's trademark magic realism with Zulli's sumptuous paintings, and has been newly rewritten for this hardcover. Join a group of friends, with the stern Miss Finch in tow, as they enter musty caverns for a subterranean circus spectacle called &quot;The Theatre of Night's Dreaming.&quot; Come inside, get out of the pounding rain, and witness this strange world of vampires, ringmasters, illusions and the Cabinet of Wishes Fulfill'd.\n","torrent":{"xt":"urn:btih:e2500666b69b9fe72e9f02c36527ccffc04bc1c2","amp;dn":"Neil+Gaiman+-+The+case+of+the+disapearance+of+miss+Finch+%5BCBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2500666b69b9fe72e9f02c36527ccffc04bc1c2","infoHashBuffer":{"type":"Buffer","data":[226,80,6,102,182,155,159,231,46,159,2,195,101,39,204,255,192,75,193,194]},"announce":[],"urlList":[]}}