{"title":"Odd Couples by Daphne J. Fairbairn (2013) [5 Formats]","uid":10663198,"size":29051579,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3570f94e6d9fd57e981dec0f172c25308d563fc&amp;dn=Odd+Couples+by+Daphne+J.+Fairbairn+%282013%29+%5B5+Formats%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1406755340,"description":"Title: Odd Couples - Extraordinary Differences between the Sexes in the Animal Kingdom\nAuthor: Daphne J. Fairbairn\nCategory: Academic/Science/Animal Studies/Evolution\nPublisher: Princeton University Press (April 28, 2013)\nLanguage: English\nISBN-10: 0691141967\nISBN-13: 978-0691141961\n\nPromotional info/Publisher's summary - &quot;While we joke that men are from Mars and women are from Venus, our gender differences can't compare to those of other animals. For instance: the male garden spider spontaneously dies after mating with a female more than fifty times his size. Female cichlids must guard their eggs and larvae--even from the hungry appetites of their own partners. And male blanket octopuses employ a copulatory arm longer than their own bodies to mate with females that outweigh them by four orders of magnitude. Why do these gender gulfs exist? Introducing readers to important discoveries in animal behavior and evolution, Odd Couples explores some of the most extraordinary sexual differences in the animal world. From the fields of Spain to the deep oceans, evolutionary biologist Daphne Fairbairn uncovers the unique and bizarre characteristics--in size, behavior, ecology, and life history--that exist in these remarkable species and the special strategies they use to maximize reproductive success. Fairbairn describes how male great bustards aggressively compete to display their gorgeous plumage and large physiques to watching, choosey females. She investigates why female elephant seals voluntarily live in harems where they are harassed constantly by eager males. And she reveals why dwarf male giant seadevils parasitically fuse to their giant female partners for life. Fairbairn also considers humans and explains that although we are keenly aware of our own sexual differences, they are unexceptional within the vast animal world.\n\nLooking at some of the most amazing creatures on the planet, Odd Couples sheds astonishing light on what it means to be male or female in the animal kingdom.&quot;\n\nReviews: \n&quot;Balancing descriptive natural history with probing evolutionary biology, Fairbairn (Sex, Size &amp; Gender Roles, coeditor), professor of biology at the University of California Riverside, examines eight striking cases of extreme size differences between males and females of the same species. . . . The conclusion she draws from this amazing diversity is as profound as it is simple: 'there is no &quot;normal&quot; or &quot;typical&quot; pattern of sexual differentiation across the animal kingdom.'&quot; -Publishers Weekly\n\n&quot;I found reading the book like taking a holiday in a foreign land with an enthusiastic and expert guide. You will come back with good stories, and a new appreciation of the amazing diversity of life on Earth and the forces shaping it.&quot; -Suzanne Alonzo, Nature\n\nThis torrent contains the original retail EPUB as well as conversions into MOBI, AZW3, LIT, and large print PDF formats done in Calibre. The front cover image and generated metadata.opf file are also included. Please seed, and enjoy.\n","torrent":{"xt":"urn:btih:e3570f94e6d9fd57e981dec0f172c25308d563fc","amp;dn":"Odd+Couples+by+Daphne+J.+Fairbairn+%282013%29+%5B5+Formats%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3570f94e6d9fd57e981dec0f172c25308d563fc","infoHashBuffer":{"type":"Buffer","data":[227,87,15,148,230,217,253,87,233,129,222,192,241,114,194,83,8,213,99,252]},"announce":[],"urlList":[]}}