{"title":"Bob Marley Exodus '77 doc","uid":7335717,"size":4588002391,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e4003d76074919453f621118afe2901d7b07d2e2&amp;dn=Bob+Marley+Exodus+%2777+doc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1339028023,"description":"1977 was the 60th anniversary of the Russian Revolution, the 30th anniversary of the Partition of India, the 20th anniversary of the First Age of Rock'n'Roll, the 10th anniversary of Sgt Pepper and the Summer of Love. It was the year of Punk, the Queen's Jubilee and the death of Elvis. It was also the year that Bob Marley, with the album Exodus, reached the whole world.\n\nThe year 1977 was a crucial one in the life of reggae superstar Bob Marley. Forced to leave Jamaica he made an album in London, Exodus, that propelled his music and message of Rastafari across the planet.\n\nMarley's legendary concert at the Rainbow that summer took reggae music and the message of Rastafaria to a world that hitherto had been exposed to neither. The programme is a visual evocation of the world of 1977, a world that seems very far away now, and of the spirit of Marley's most significant album. It is not a film about the making of an album, it's a film about an artist and his world; about the impact of the world on Bob Marley and of Bob Marley on the world.","torrent":{"xt":"urn:btih:e4003d76074919453f621118afe2901d7b07d2e2","amp;dn":"Bob+Marley+Exodus+%2777+doc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4003d76074919453f621118afe2901d7b07d2e2","infoHashBuffer":{"type":"Buffer","data":[228,0,61,118,7,73,25,69,63,98,17,24,175,226,144,29,123,7,210,226]},"announce":[],"urlList":[]}}