{"title":"The Chronicles of Riddick","uid":8999968,"size":2463938702,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e4501d32c3404b35c5affd11191675a9bba423a8&amp;dn=The+Chronicles+of+Riddick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GzUs42o0","files":6,"time":1380932035,"description":"Pitch Black (2000)[edit]\nMain article: Pitch Black (film)\n\nThe first installment of the franchise, Pitch Black, was a lower budget production compared to the later ones. The story involved Riddick being transported to prison on the Hunter Gratzner, a commercial cargo ship. When the spaceship is damaged in the wake of a comet and makes an emergency crash landing on an isolated desert planet, Riddick escapes. However, when flying creatures begin attacking all the survivors, Riddick joins forces with the others to escape the planet. After the release of the sequel titled The Chronicles of Riddick, in the hopes of building a franchise, this film often been referred to as The Chronicles of Riddick: Pitch Black in subsequent home video re-releases. It received mixed reviews but today is considered a cult classic.\n\nThe Chronicles of Riddick (2004)[edit]\nMain article: The Chronicles of Riddick\n\nThe second feature film in the series, The Chronicles of Riddick was a considerably more expensive production and was more action oriented than its predecessor. It takes place five years after Pitch Black and involved Riddick's meeting with Jack and Imam, survivors from the first movie, his escape from the prison planet Crematoria, and his battle with the Necromonger fleet, which ended with the defeat of the Lord Marshall and Riddick taking his place. Critically it wasn't received as well as the first movie in the franchise, but the release of a director's cut DVD received strong sales and a cult following.\n\nThe Chronicles of Riddick: Dark Fury (2004)[edit]\nMain article: The Chronicles of Riddick: Dark Fury\n\nDark Fury, a made-for-DVD animated movie, acts as a bridge between the live-action films of Pitch Black and The Chronicles of Riddick. It takes place shortly after Pitch Black and involves Riddick and the other two survivors of Pitch Black, Jack and Imam, and their run-in with a mercenary ship, as well as its captain who wishes to keep Riddick frozen as part of her collection of warriors from around the universe. It received mixed reviews.","torrent":{"xt":"urn:btih:e4501d32c3404b35c5affd11191675a9bba423a8","amp;dn":"The+Chronicles+of+Riddick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4501d32c3404b35c5affd11191675a9bba423a8","infoHashBuffer":{"type":"Buffer","data":[228,80,29,50,195,64,75,53,197,175,253,17,25,22,117,169,187,164,35,168]},"announce":[],"urlList":[]}}