{"title":"Ã‚Â¡Three Amigos![1986]DVDRip.x264-m99m","uid":4719394,"size":944828463,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e49301e86b3149f0e064ed4cfcd7f32b85daa2fd&amp;dn=%C3%82%C2%A1Three+Amigos%21%5B1986%5DDVDRip.x264-m99m&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"m99m","files":2,"time":1234448329,"description":"By m99m - Demonoid\n\nREPACK EDITION / x264 - More Quality\n\nFile Information:\n\nMOVIE NAME .....[ Ã‚Â¡Three Amigos! \nYEAR ...........[ 1986 (USA)\nLANGUAGE .......[ English\nGENRE ..........[ Adventure | Comedy | Western\nRUNTIME ........[ 01:42:53\nAUDIO ..........[ MP3 | 48.0 KHz | 128 kbps | CBR (2 channels) | Stream size: 94.2 MB (10%)\nVIDEO ..........[ AVI | x264 | 23.976 FPS | 24 bits | Bit rate: 1.087 kbps | Stream size: 800 MB (89%)\nCODEC ID: ......[ H264\nQ. FRAME .......[ 0.222 bits*pixel\nRESOLUTION .....[ 608 x 336\nDAR ............[ 16/9\nSUBTITLES ......[ None \nFILES ..........[ 1 CD \nSIZE ...........[ 901 MB\nSCAN TYPE ......[ Progressive\nSOURCE .........[ DVD 100% (size of origin = 3.512 MB)\n\nCOMPANY ........[ Orion Pictures Corporation and Home Box Office\nDIRECTOR .......[ John Landis\nWRITERS ........[ Steve Martin (written by) and Lorne Michaels (written by)...\nIMDb RATE ......[ 6.0/10 | 18.921 votes \nIMDb URL .......[ http://www.imdb.com/title/tt0092086/\n\nSynopsis: Steve Martin, Chevy Chase and Martin Short are three crazy and rebels cavalier in this comedy adventure that is a real festival of laughs. Co-starring Phil Hartman, Jon Lovitz and Joe Montegna.\n\nThree out of work silent movie actors are accidentally drawn to a Mexican village that is being harassed by a gang of outlaws. The three, 'Ned', 'Lucky Day' and 'Dusty Bottoms' play 'Lone Ranger' types in their movies, but must play their parts for real now. \n\nWhen silent film stars Lucky Day, Dusty Bottoms and Ned Nederlander get fired, they take a job offer from Mexico: Doing a show with El Guapo, supposedly the most famous actor there. Traveling there in hope of getting good money, they arrive only to learn soon that El Guapo is not an actor, but a cruel gang leader suppressing people. He abducts the mayor's beautiful daughter Carmen (to be his wife) in revenge for the people's cry for help. Now, all hopes of the village folks rest on the weak shoulders of three minor-talented actors, who can't just walk off the set this time.\n\nThree actors get fired by their production company for asking to be paid. A young woman from a small village called Santa Polco sees one of their movies and thinks they are real heroes so she sends them a vague telegram in hopes of getting them to come to Santa Polco and ward off the infamous El Guapo, who has been torturing their town and stealing their booze. The amigos go to Santa Polco expecting to put on a show, but instead find out it's real, decide they do want to be real heroes, and later help the town stop El Guapo and his men from ever torchuring them again. \n\nReseÃƒÂ±a:  Spanish\nUn pequeÃƒÂ±o pueblo mejicano vive aterrorizado ante los continuos ataques de una banda de forajidos, hasta que una joven habitante decide pedir ayuda a los ÃƒÂºnicos hÃƒÂ©roes que conoce: los legendarios &quot;Tres Amigos&quot; (Steve Martin, Chevy Chase y Martin Short ). Famosos por su temeridad y osadÃƒÂ­a, estos valientes defensores de la libertad son, en realidad, tres actores de cine, que las ÃƒÂºnicas peleas que han visto en su vida han sido en los estudios de filmaciÃƒÂ³n. Pero cuando los forajidos se lanzan al ataque, los Tres Amigos, descubren que los bandidos Ã‚Â­ y sus balas Ã‚Â­ son reales. Ahora el trÃƒÂ­o tendrÃƒÂ¡ que optar entre salvar a los habitantes del pueblo y convertirse en hÃƒÂ©roes, o admitir que son un autÃƒÂ©ntico fraude.\n\nSinopse: Portuguese\nSteve Martin, Chevy Chase e Martin Short sÃƒÂ£o trÃƒÂªs loucos e rebeldes cavaleiros nesta comÃƒÂ©dia de aventura que ÃƒÂ© um verdadeiro festival de risadas. Co-estrelando Phill Hartman, Jon Lovitz e Joe Montegna. \n\nQuando uma pequena vila mexicana ÃƒÂ© aterrorizada por um conhecido fora-da-lei, uma jovem desesperada decide chamar os ÃƒÂºnicos herÃƒÂ³is que ela conhece: os lendÃƒÂ¡rios TrÃƒÂªs Amigos! Conhecidos por todos como intrÃƒÂ©pidos defensores da liberdade, estes corajosos vaqueiros de fato nÃƒÂ£o passam de atores de cinema. Outrora famosos por seus filmes de faroeste, hoje eles estÃƒÂ£o desempregados. E embora as ÃƒÂºnicas lutas de que jÃƒÂ¡ participaram na vida tenham acontecido apenas nos sets de filmagem, quando os criminosos atacam, os TrÃƒÂªs Amigos! descobrem que os bandidos e as balas de suas armas sÃƒÂ£o bem reais! Agora, para tornarem-se herÃƒÂ³is de verdade e nÃƒÂ£o afundarem sua reputaÃƒÂ§ÃƒÂ£o na lama para sempre, eles terÃƒÂ£o que salvar o vilarejo dos foras-da-lei. Se, antes, conseguirem salvar suas prÃƒÂ³prias vidas.\n\n\nMore Cast: &lt;a href=&quot; http://www.imdb.com/title/tt0092086/fullcredits#cast&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0092086/fullcredits#cast&lt;/a&gt;\n\nSoundtrack: &lt;a href=&quot; http://www.imdb.com/title/tt0092086/soundtrack&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0092086/soundtrack&lt;/a&gt;\n\nUSE DIRECT FROM PC to TV - DVI or VGA CONNECTORS","torrent":{"xt":"urn:btih:e49301e86b3149f0e064ed4cfcd7f32b85daa2fd","amp;dn":"%C3%82%C2%A1Three+Amigos%21%5B1986%5DDVDRip.x264-m99m","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e49301e86b3149f0e064ed4cfcd7f32b85daa2fd","infoHashBuffer":{"type":"Buffer","data":[228,147,1,232,107,49,73,240,224,100,237,76,252,215,243,43,133,218,162,253]},"announce":[],"urlList":[]}}