{"title":"Age-Dissimilar Couples and Romantic Relationships","uid":13144864,"size":2864323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4c15ed3c10a98e49bd4134c0b92b2894fe0dd47&amp;dn=Age-Dissimilar+Couples+and+Romantic+Relationships&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1452016954,"description":"In recent years, there has been widespread fascination with age-dissimilar, heterosexual romantic relationships. This interest is not new – these types of couples have featured in Western media for decades, even centuries – yet qualitative research into such relationships has been limited.\r\n\r\nThis book examines how the romantic relationships of age-dissimilar couples are understood. Based largely on interviews, McKenzie argues that historical shifts toward greater personal autonomy in partner selection, within relationships, and in relationship dissolution have been greatly overstated. Through her focus on age-dissimilar couples, whose increasing prevalence has often been seen to be part of this shift, she suggests that these relationships are an avenue through which shared cultural understandings of relatedness, as well as autonomy, might be further analysed. McKenzie argues for an approach that emphasises cultural continuity, and which accounts for complexity and contradiction in how age-dissimilar relationships and romantic love are understood.\r\n\r\nExamining key issues of kinship, age, and emotion, Age-Dissimilar Couples and Romantic Relationships will appeal to scholars of Cultural and Social Anthropology, Family Studies, and Sociology","torrent":{"xt":"urn:btih:e4c15ed3c10a98e49bd4134c0b92b2894fe0dd47","amp;dn":"Age-Dissimilar+Couples+and+Romantic+Relationships","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4c15ed3c10a98e49bd4134c0b92b2894fe0dd47","infoHashBuffer":{"type":"Buffer","data":[228,193,94,211,193,10,152,228,155,212,19,76,11,146,178,137,79,224,221,71]},"announce":[],"urlList":[]}}