{"title":"Montrose - Montrose [AudioFidelity Gold AFZ-028]","uid":4672546,"size":229011812,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e568b1189b45661ddc5bfcc120cc114cf08a0211&amp;dn=Montrose+-+Montrose+%5BAudioFidelity+Gold+AFZ-028%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mofie108","files":10,"time":1232789251,"description":"Not my rip. All the thanks and respect to the original ripper and uploader\n\nmofie108\n\n\nMontrose - Montrose [AudioFidelity Gold AFZ-028]\n\n\nCD FULL RANGE ONLY | EAC FLAC/CUE | 255mb Rar'd\n\nAll Scans Included\n\n\nNow this is rock music! Yeah baby! This is a one of kind album and it still stands up today as one of the rock classics of all time. The self-titled Montrose album came roaring out if the gates in 1973 and 32 years later Audio Fidelity has flattered this rock gem by releasing it on 24KT Gold Disc.\n\nRonnie Montrose had made his presence known in the Edgar Winter Group then cut his ties and decided to venture into some solo guitar work. He needed a powerful front man to sing over his heavy-duty power chords. He found a young Sammy Hagar (listed as Sam in the credits on the album sleeve) ready to rock and completely capable of handling those duties.\n\nThis is a typical LP clocking in at a fraction less than 30 minutes, which is a shame really, because every track oozes with primal raw energy. This is the kind of heart-pumping fist waving sound you that will leave wanting for more every time you hear it. The whole idea behind what Audio Fidelity does is to maintain the original album's integrity while enhancing the sound for optimal listening pleasure so you get what came out in 1973 but with a much better sound. Bill Church (bass) and Danny Carmassi (drums) was a good match for the Montrose guitar groove and they proved to be a solid rhythm section on every track, giving Montrose solid ground to lay his meaty power chords on. This does sound terrific so get ready to crank that stereo as loud as you can stand it, this is music made to play loud! Ronnie Montrose really cut loose on this album and proved he could play with the best of them. He would continue to show the world why he was one of the best guitar players around throughout the years with more great music but nothing ever seemed to match this. Neither this session nor anything like it would ever happen again unfortunately, as egos got in the way to cause tensions and finally a break up.\n\nIts too bad things started fall apart for this band into the second album, which is why this remains the best recording Ronnie Montrose put out under the Montrose heading. When you hear &quot;Rock Candy&quot; you will remember why you loved this album so much. I know I wore it out when it came out on vinyl and to hear it now on my surround sound system in all its glory is something to behold. Do not be mislead by that statement however, this is not 5.1 surround sound it's sourced from the original master tapes and converted from analog to digital. Eight tracks of some of the most powerful guitar rock you will ever hear is on this album. Its hot sweet and sticky so &quot;Make It Last&quot; because once is not enough for this music.\n\nArtist: Montrose\nTitle: Montrose\nGenre: Rock\nFormat: 24KT Gold Disc\nLabel: Audio Fidelity\n\nTracks:\n\n1. Rock The Nation (2:57)\n2. Bad Motor Scooter (3:43)\n3. Space Station No. 5 (5:17)\n4. I Don't Want It (3:02)\n5. Good Rockin' Tonight (2:57)\n6. Rock Candy (5:17)\n7. One Thing On My Mind (3:40)\n8. Make It Last (5:29)\n\nRating-10/10\n\nCredits:\n\nRonnie Montrose-guitar\nBill Church-bass\nDenny Carmassi-drums\nSam Hagar-vocals","torrent":{"xt":"urn:btih:e568b1189b45661ddc5bfcc120cc114cf08a0211","amp;dn":"Montrose+-+Montrose+%5BAudioFidelity+Gold+AFZ-028%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e568b1189b45661ddc5bfcc120cc114cf08a0211","infoHashBuffer":{"type":"Buffer","data":[229,104,177,24,155,69,102,29,220,91,252,193,32,204,17,76,240,138,2,17]},"announce":[],"urlList":[]}}