{"title":"The Bible","uid":4143141,"size":6552485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5f04b8aa7b4d924d7da7fecb6203f4fcd1f7c21&amp;dn=The+Bible&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"genevaheaton","files":1,"time":1208594048,"description":"This is the bible, you heathens.  It is sacrifying your Internets!  WIthout this the torrents be damned by the fires of Pythagorean, but with the ALLMIGHTY on your side torrents will be cleansed!  Praise Jesus!  The Virgin Mary is flying through your decentralized bandwidth to deliver load balanced packets of justice!!\n\nRejoice!  The One True God has blessed you with reading materials, conveniently stored in non-proprietary format to be read by a variety of programs; web browsers, text editors and PDF viewers alike.  An open protocol delivers the data to your hard drive with godspeed, bypassing restricted firewalls and encrypted jihad streams.\n\nDownload this and praise the highest.  Share alike, help others while helping yourself.  And now some faithful words from a friend:\n\n\\&quot;Thank God we don\\&amp;#039;t descend down from perfect Adam\\&amp;#039;&amp; Eve to sinful sinner, Brother\\&amp;#039;s Keeper, divided slave! United, hardworking-trained-brave, from dust we ascend up! Thank God for that! Our Brother\\&amp;#039;s Teacher of the Moral ABC mason Hillel taught carpenter Jesus to unite all mankind free! \n\nIf you can keep your head when all around you are losing theirs and blaming it on you! If you can trust yourself when all men doubt you, and yet make allowance for their doubting too! If you can wait and not be tired by waiting or being lied about, don\\&amp;#039;t deal in lies! 0r being hated, don\\&amp;#039;t give way to hating, and yet don\\&amp;#039;t look too good nor talk too wise! if you can dream and not make dreams your master! If you can think and not make thoughts your aim! \n\nIf you can meet with triumph or disaster and treat those two imposters just the same! If you can bear to hear the full-truth you have spoken twisted by crooks to make a trap for fools! Or watch the things that you have given your life to broken, and stoop to build them up again with worn out tools! If you can make one heap of all your winnings and risk it at one turn of pitch or toss! \n\nAnd lose and start again at your beginnings and never breathe a word about your loss! If you can force your heart, your nerve, your sinew, to serve you long after they are gone! And so hold on although there is nothing left within you except that voice that says to them \\&quot;Hold on! Hold on!\\&quot; If you can talk to crowds and keep your virtue, or walk with kings and not lose that common touch! \n\nIf neither loving friend nor enemy can hurl you; it all men count with you, but none too much! If you can work hard to teach each unforgiving minute the Moral ABC, mason Hillel taught carpenter Jesus to unite all mankind free, come hell, hate, ban, you\\&amp;#039;ll enjoy God\\&amp;#039;s spaceship Earth &amp; do great work within it, L which is more my son, you\\&amp;#039;ll be man! A man! Sure, East is East and West is West and never the twain shall meet! But there is neither East nor West, nor border, breed nor birth, once the Moral ABC unites all mankind free on God\\&amp;#039;s spaceship Earth! \n\nThen &amp; only then, no matter how rough the trip, how charged the scroll, you are the captain of thy ship, the master of thy soul! These are the days my friend, we know they\\&amp;#039;ll never end! We\\&amp;#039;ll work, sing, dance, love, marching on! Marching on! We live God s law today! We win Free speech OK! With full-truth, our only God, we rally, raise, unite the whole human race, lightning-like, in our Eternal Father\\&amp;#039;s great \n\nAll-One4od-Faith! As teaches the African astronomer Israel since the year One: \\&quot;Listen Children Eternal Father Eternal One!\\&amp;#039; \\&quot;Exceptions eternally? Absolute none!\\&quot;\\&quot;","torrent":{"xt":"urn:btih:e5f04b8aa7b4d924d7da7fecb6203f4fcd1f7c21","amp;dn":"The+Bible","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5f04b8aa7b4d924d7da7fecb6203f4fcd1f7c21","infoHashBuffer":{"type":"Buffer","data":[229,240,75,138,167,180,217,36,215,218,127,236,182,32,63,79,205,31,124,33]},"announce":[],"urlList":[]}}