{"title":"Hulk - The End","uid":7231013,"size":13166604,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e6358180f5287c9404ebbf894acd93b1644e3c80&amp;dn=Hulk+-+The+End&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"canopener","files":1,"time":1335836373,"description":"Hulk: The End is a one-shot comic book published by Marvel Comics. Written by Peter David, pencilled by Dale Keown and inked by Joe Weems, the story depicts a possible future for the Hulk like all of the other The End stories.\n\n\n\n    --------------------------     SPOILER     ---------------------------------\n\n\n\nThe story follows the narrative of Bruce Banner and the Hulk following a war which ended in a violent nuclear holocaust that only he could have survived.\n\nBanner begins the story, talking to a camera left by a robot Recorder belonging to one of The Watchers to record &quot;The Last Days of Earth&quot; as an archival lesson for other planets.\n\nWhile Banner is forced to drown in sorrow as the last human alive on Earth, wandering for years across the ruins of the old cities and remembering what he can of the world before, the Hulk (in his Rampaging Hulk form) is angry at Banner, in that with Banner he is still not alone in the World. During one of Banner's walks, he is beset upon some gigantic cockroaches, mutated by the nuclear fallout, and it is the Hulk who gets up to try to stop them.\n\nWhen Banner awakens later, he watches a video recording made by the alien camera of the cockroaches eating the Hulk alive before he heals.\n\nThe story is mainly fueled by the fact that Banner and the Hulk's desires, even at the end of the world, are still conflicted; whereas Hulk still stubbornly wishes to prove himself the strongest being on Earth, Banner merely wishes to die, attempting suicides that fail when he becomes the Hulk again.\n\nEventually, Banner falls asleep in an old cave, only to dream of a woman with the appearance of Betty Ross. In the dream, he becomes young again and they begin to make love amongst a paradise. However, when she begins to talk, saying that the two will eventually be 'like gods', Banner awakens violently.\n\nSuffering a painful heart attack, Banner realizes how much his punishment resembles that of Prometheus, the Last Titan; condemned to stay forever alive even while animals devour him. As he dies, the Hulk's persona arises in his mind. Banner pleads with the Hulk, begging him to simply let go of his conflicts - claiming that they are going to a paradise where all their dead friends are, where they will be happy. Hulk throws away this suggestion because, in his eyes, friends have always betrayed him. Amidst a thunderous storm, Hulk proclaims that all he wants is to be left alone.\n\nThe next morning, the Hulk somberly sits outside the cave, musing in his inner monologue: &quot;Banner is gone...got rid of him last night.&quot; As he remembers the confrontation, he realizes that if he were ever to change back to Banner, he would die also. The Hulk is glad, because he does not need Banner, only for the truly tragic realization to come upon him: &quot;Hulk...strongest one there is. Hulk...only one there is...Hulk feels...cold.&quot;","torrent":{"xt":"urn:btih:e6358180f5287c9404ebbf894acd93b1644e3c80","amp;dn":"Hulk+-+The+End","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6358180f5287c9404ebbf894acd93b1644e3c80","infoHashBuffer":{"type":"Buffer","data":[230,53,129,128,245,40,124,148,4,235,191,137,74,205,147,177,100,78,60,128]},"announce":[],"urlList":[]}}