{"title":"DAVY CROCKETT 1-5 (Disneyland 1954) [retr0tv]","uid":3962144,"size":520623849,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e65112eeea88245f474b08ec31736016ab1ffc45&amp;dn=DAVY+CROCKETT+1-5+%28Disneyland+1954%29+%5Bretr0tv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flixer","files":6,"time":1199514569,"description":"DAVY CROCKETT 1-5 (Disneyland 1954)\n\nstars: Fess Parker (Davy Crockett), Buddy Ebsen (Georgie Russel), Walt Disney (Himself)\n\n\n1 DAVY CROCKETT: INDIAN FIGHTER  (Disneyland s1e8: 12/15/54)\nDavy seeks a truce with his foes, the Indians. Davy Crockett and best friend Georgie Russell search for Indians that had assaulted a military outpost. They fight in skirmishes under the command of Gen. Andrew Jackson. Along the way Davy kills a bear using just his knife. Davy has to fight the Indian chief to save the life of his friend and to keep the frontier safe.\nGuest star: Basil Ruysdale (General Andrew Jackson), William Bakewell (Major Norton), Helene Stanley (Polly Crockett), Pat Hogan (Redstick)\n\n2 DAVY CROCKETT GOES TO CONGRESS  (Disneyland s1e14: 1/26/55)\nDavy and his good friend Georgie travel to Tennessee where he is asked to run for office. He declines until he is notified that his wife has died. He then runs for and wins a seat in the Nashville Legislature. He later is appointed to Congress but quits after he discovers they only wanted to use him to steal land back from the Indians.\nGuest star: Kenneth Tobey (Colonel Jim Bowie), Helene Stanley (Polly Crockett), Don Megowan (Colonel William Travis), Hans Conried (Thimblerig), Mike Mazurki (Bigfoot Mason), Pat Hogan (Chief Red Stick), Basil Ruysdael (General/President Andrew Jackson), William Bakewell (Major Tobias Norton), Jeff Thompson (Charlie Two Shirts) \n\n3 DAVY CROCKETT AT THE ALAMO  (Disneyland s1e18: 2/23/55)\nDavy and his good friend Georgie Russell join up with a gambler named Thimblerig who talks them into going to Texas. When they get there they sign on with the American Army to battle Mexico for control Texas.\nGuest star: Nick Cravat (Busted Luck), Don Megowan (William Travis), Hans Conried (Thimblerig), Kenneth Tobey (Jim Bowie) \n\n4 DAVY CROCKETT KEELBOAT RACE  (Disneyland s2e10: 11/16/55)\nDavy and his friend Georgie are fur trapping in Kentucky. They soon cross paths with Mike Fink who claims to be the best boatman around. He challenges Davy to a keelboat race to New Orleans for the right to claim the title of &quot;King of the River.&quot;\nGuest star: Frank Richards (Little Harpe), Irvin Ashkenazy (Moose), Jeff York (Mike Fink), Kenneth Tobey (Jocko), Paul Newlan (Big Harpe), Mort Mills (Sam Mason), Troy Melton (Hank), Douglas Dumbrille (Saloon Owner), Dick Crockett (Ben), Clem Bevans (Capt. Cobb) \n\n5 DAVY CROCKETT AND THE RIVER PIRATES   (Disneyland s2e13: 12/14/55)\nAfter their adventures from the keelboat race in the previous episode, Mike Fink decides it&amp;#039;s best to become friends with Davy. Davy and Mike team up with Georgie to catch some pirates that are posing as Indians.\nGuest star: Walter Catlett (Col. Plug), Hank Worden (Fiddler), Frank Richards (Little Harpe), Paul Newlan (Big Harpe), Mort Mills (Sam Mason), Irvin Ashkenazy (Moose), Clem Bevans (Cap&amp;#039;n Cobb), Kenneth Tobey (Jocko), Jeff York (Mike Fink) \n\nH264/320X240/25fps\nmp3/24kHz/48kbps/55min","torrent":{"xt":"urn:btih:e65112eeea88245f474b08ec31736016ab1ffc45","amp;dn":"DAVY+CROCKETT+1-5+%28Disneyland+1954%29+%5Bretr0tv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e65112eeea88245f474b08ec31736016ab1ffc45","infoHashBuffer":{"type":"Buffer","data":[230,81,18,238,234,136,36,95,71,75,8,236,49,115,96,22,171,31,252,69]},"announce":[],"urlList":[]}}