{"title":"The Cistercian Evolution: The Invention of a Religious Order in ","uid":6635552,"size":8420226,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e66de074d067ecde729eb27a7efd75d118d00170&amp;dn=The+Cistercian+Evolution%3A+The+Invention+of+a+Religious+Order+in+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1314544678,"description":"                                 _______________      \n                                 \\_   _____/_   |     \n                                  |    __)  |   |     \n                                  |     \\   |   |     \n                             _____\\___  /   |___|_____\n____________________________/_____/   \\/       /_____/______________________________\n\nSeed back after downloading. Contribute to the community.\n\nJoin the forum. Get most out of TPB: &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=register&amp;referrer=222663&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=register&amp;referrer=222663&lt;/a&gt;\n____________________________________________________________________________________\n\nThe Cistercian Evolution: The Invention of a Religious Order in Twelfth-Century Europe (The Middle Ages Series)\nConstance Hoffman Berman (Author)\n\nPaperback: 408 pages\nPublisher: University of Pennsylvania Press (March 23, 2010)\nLanguage: English\nISBN-10: 0812221028\nISBN-13: 978-0812221022\n\nAccording to the received history, the Cistercian order was founded in CÃƒÂ®teaux, France, in 1098 by a group of Benedictine monks who wished for a stricter community. They sought a monastic life that called for extreme asceticism, rejection of feudal revenues, and manual labor for monks. Their third leader, Stephen Harding, issued a constitution, the Carta Caritatis, that called for the uniformity of custom in all Cistercian monasteries and the establishment of an annual general chapter meeting at CÃƒÂ®teaux.\n\nThe Cistercian order grew phenomenally in the mid-twelfth century, reaching beyond France to Portugal in the west, Sweden in the north, and the eastern Mediterranean, ostensibly through a process of apostolic gestation, whereby members of a motherhouse would go forth to establish a new house. The abbey at Clairvaux, founded by Bernard in 1115, was alone responsible for founding 68 of the 338 Cistercian abbeys in existence by 1153. But this well-established view of a centrally organized order whose founders envisioned the shape and form of a religious order at its prime is not borne out in the historical record.\n\nThrough an investigation of early Cistercian documents, Constance Hoffman Berman proves that no reliable reference to Stephen's Carta Caritatis appears before the mid-twelfth century, and that the document is more likely to date from 1165 than from 1119. The implications of this fact are profound. Instead of being a charter by which more than 300 Cistercian houses were set up by a central authority, the document becomes a means of bringing under centralized administrative control a large number of loosely affiliated and already existing monastic houses of monks as well as nuns who shared Cistercian customs. The likely reason for this administrative structuring was to check the influence of the overdominant house of Clairvaux, which threatened the authority of CÃƒÂ®teaux through Bernard's highly successful creation of new monastic communities.\n\nFor centuries the growth of the Cistercian order has been presented as a spontaneous spirituality that swept western Europe through the power of the first house at CÃƒÂ®teaux. Berman suggests instead that the creation of the religious order was a collaborative activity, less driven by centralized institutions; its formation was intended to solve practical problems about monastic administration. With the publication of The Cistercian Evolution, for the first time the mechanisms are revealed by which the monks of CÃƒÂ®teaux reshaped fact to build and administer one of the most powerful and influential religious orders of the Middle Ages.\n","torrent":{"xt":"urn:btih:e66de074d067ecde729eb27a7efd75d118d00170","amp;dn":"The+Cistercian+Evolution%3A+The+Invention+of+a+Religious+Order+in+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e66de074d067ecde729eb27a7efd75d118d00170","infoHashBuffer":{"type":"Buffer","data":[230,109,224,116,208,103,236,222,114,158,178,122,126,253,117,209,24,208,1,112]},"announce":[],"urlList":[]}}