{"title":"Amnesia:The Dark Decent.iso","uid":7942941,"size":1019060224,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e6721e7ea3108e7aa8e3b64a68aaadf3df38f109&amp;dn=Amnesia%3AThe+Dark+Decent.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prodallasosoft","files":1,"time":1356042028,"description":"True survival horror games are rare these days. Games like Dead Space and the most recent Resident Evil titles can be scary but tend to be just as focused on action as they are on atmosphere. In Frictional Games' Amnesia: The Dark Descent, you get no gun. When a gruesome shambling creature rounds a corner on wobbly knees and its yawning rictus comes into focus, you can only succumb to its onslaught or flee in terror, hoping the shadows will provide safe haven. It plays more like a first-person adventure game than anything else, and borrows many of the environmental manipulation mechanics of Frictional's previous Penumbra series. It's a fairly short game, but one that's near impossible to forget.\n \nIf you've ever read an H.P. Lovecraft story before you'll find a lot that's familiar here. Much of the horror and structure of the plot is inspired by the 20th century author, as sanity is eroded the closer you draw to the sinister heart of the tale. You play as Daniel, who awakens clueless on the floor of the huge and hauntingly empty Castle Brennenburg. Soon after coming to, you discover a note written by your past self, instructing you to find and kill Alexander, the master of house. Unraveling the history of the place is part of what lures you forward, discovering how exactly you got to this point, what Alexander did to deserve an early death, and who is responsible for the grisly acts committed in the castle's depths.\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\nPlease Leave A Comment Confirming This Pack\n\nPLEASE SEED !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nAs Always,this is an iso, mount or burn,Install,and Play. Enjoy\t\t","torrent":{"xt":"urn:btih:e6721e7ea3108e7aa8e3b64a68aaadf3df38f109","amp;dn":"Amnesia%3AThe+Dark+Decent.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6721e7ea3108e7aa8e3b64a68aaadf3df38f109","infoHashBuffer":{"type":"Buffer","data":[230,114,30,126,163,16,142,122,168,227,182,74,104,170,173,243,223,56,241,9]},"announce":[],"urlList":[]}}