{"title":"The Anthony Cumia Show 2015-03-16 MP4 MP3 combo","uid":11761956,"size":297091417,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e67bab867ffe4f459572c6282b5e8e678f262961&amp;dn=The+Anthony+Cumia+Show+2015-03-16+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1426610697,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Tattoo Lou, Po Po \n\nTattoo Special\n\nEpisode 127: Monday's TACS begins with Anthony telling us about his weekend that included appearing on Red Eye, having dinner with Jim Norton as well as Chip, and doing Gavin McInnes's show &quot;Free Speech&quot;, Ant then gets an apology, talks about a video game called &quot;Virtual Rape&quot;, the callers give their opinions on it, Ant conveys his thoughts on the newest developments with the police shooting in Ferguson, plays a few news clips about it, and recaps weekend Twitter. We learn all about TACS newest sponsor &quot;Loot Crate&quot;, see a pointless and enraging kid beat down, and Ant joins Lou and tattoo artist Po Po from Tattoo Lou's in the bar area as work is being done on Jade. We find out about Jade's tattoo history, Po Po tells us how he got into the industry, talks about good and bad work, tattoo stereotypes and corrections, and the popular tats in different countries. Lou then gives us his backstory and chats about the upcoming No Limits Tattoo Show on March 21st, the old AIDS stigma that surrounded tattoos, people who get insane tats, tramp stamps, tattoo artwork changing over the years, and we wrap up by seeing fan of the show Anthony Campisi's painted TACS mic on his neck.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\n\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:e67bab867ffe4f459572c6282b5e8e678f262961","amp;dn":"The+Anthony+Cumia+Show+2015-03-16+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e67bab867ffe4f459572c6282b5e8e678f262961","infoHashBuffer":{"type":"Buffer","data":[230,123,171,134,127,254,79,69,149,114,198,40,43,94,142,103,143,38,41,97]},"announce":[],"urlList":[]}}