{"title":"Pickpocket (1959) FULL DVD (ISO) Criterion Collection","uid":7184929,"size":4510122030,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e85795b9a3cb3dd697b315713036d202f398ab22&amp;dn=Pickpocket+%281959%29+FULL+DVD+%28ISO%29+Criterion+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Auge","files":-1,"time":1334397139,"description":"Pickpocket (1959) FULL DVD (ISO) Criterion Collection\n\nI am providing important films in ISO for the film buff or novice film historian. It is nearly impossible to find torrent files that include all the extras or even important commentaries. \n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n\n1959\n75 minutes\nBlack &amp; White \n1.33:1\nSpoken Language: French \nSubtitles: English\n\n(DVD-5)\n\nDirector: \nRobert Bresson\n\nCast: \nMartin LaSalle, Marika Green, Jean Pelegri, Dolly Scal, Pierre Leymarie, Kassagi, Pierre Etaix, Cesar Gattegno, Dominique Zardi, Sophie Saint-Just\n\nDisc Features:\n* Audio commentary by film scholar James Quandt\n* New video introduction by writer-director Paul Schrader\n* The Models of Pickpocket, a 2003 documentary by filmmaker Babette Mangolte, featuring actors from the film\n* A 1960 interview with Bresson, from the French television program Cinepanorama\n* Q&amp;A on Pickpocket, with actress Marika Green and filmmakers Paul Vecchiali and Jean-Pierre Ameris fielding questions at a 2000 screening of the film\n* Footage of sleight-of-hand artist and Pickpocket consultant Kassagi, from a 1962 episode of the French television show La piste aux etoiles\n* Original theatrical trailer\n\n\nSYNOPSIS:  \nRobert Bressons incomparable tale of crime and redemption follows Michel, a young pickpocket who spends his days working the streets, subway cars, and train stations of Paris. As his compulsion grows, however, so too does his fear that his luck is about to run out. Tautly choreographed and crafted in Bressons inimitable style, Pickpocket reveals a master director at the height of his powers.\n\n*** I upload my torrents to The Pirate Bay and Demonoid, if you would like to upload one of my torrent files to another tracker feel free, all I ask is that you upload the same torrent file you downloaded by clicking on one of my links so that more seeders/peers are in the swarm.  ***\n\n*** THE BEST WAY TO MESSAGE ME IS TO COMMENT ON MY LATEST UPLOAD, I AM GETTING TOO MANY UP THERE TO MONITOR ALL OF THEM. ***\n","torrent":{"xt":"urn:btih:e85795b9a3cb3dd697b315713036d202f398ab22","amp;dn":"Pickpocket+%281959%29+FULL+DVD+%28ISO%29+Criterion+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e85795b9a3cb3dd697b315713036d202f398ab22","infoHashBuffer":{"type":"Buffer","data":[232,87,149,185,163,203,61,214,151,179,21,113,48,54,210,2,243,152,171,34]},"announce":[],"urlList":[]}}