{"title":"Peter Murphy - Love Hysteria[FLAC - LOSSLESS]","uid":3839263,"size":327399029,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e8998a35b353c0e69ce1afcc1bd847f0ed372d28&amp;dn=Peter+Murphy+-+Love+Hysteria%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"99AM","files":15,"time":1192201936,"description":"FLAC files + CUE sheet + covers\nReleased in 1988\n\n\nTrack Listing:\n1. All Night Long\n2. His Circle and Hers Meet\n3. Dragnet Drag\n4. Socrates the Python\n5. Indigo Eyes\n6. Time Has Got Nothing to Do With It\n7. Blind Sublime\n8. My Last Two Weeks\n9. Fun Time\n\nReview from AMG:\nHaving assembled, for touring purposes, what would soon be his formal backing band, the Hundred Men, and more specifically, having found a new key songwriting collaborator in ex-B. Movie keyboardist Paul Statham, Murphy created his most elegant post-Bauhaus effort to date. Love Hysteria had definite Bowie echoes, though the feeling was more late-&amp;#039;70s Berlin-era than Ziggy glam. That said, with his band turning in a variety of bright, lively performances and with sympathetic production from ex-Fall member/arranger Simon Rogers, Murphy matched the music with flair, his voice even more of a passionate croon than a powerful howl. Lead single &quot;All Night Long&quot; was something of an American breakthrough hit; its upbeat rock drive and lush keyboards are a perfect bed for Murphy&amp;#039;s performance. Other moments, such as the ringing acoustic/electric guitar combinations on &quot;Indigo Eyes&quot; and &quot;Dragnet Drag,&quot; take Murphy even further away from Bauhaus&amp;#039; shadow, though &quot;His Circle and Hers Meet&quot; and &quot;Blind Sublime&quot; have a brusquer energy. The definite highlights of the album are two majestic ballads: &quot;Time Has Got Nothing to Do With It,&quot; with a fine Statham synth line matching Murphy&amp;#039;s soaring vocals; and &quot;My Last Two Weeks,&quot; a simply wonderful romantic sentiment. If his lyrics now sometimes have the feeling of formal philosophical pronouncements, the sense of style with which he sings them saves the performances more often than not. Closing with a fun romp through Iggy Pop&amp;#039;s &quot;Funtime,&quot; saluting another one of Murphy&amp;#039;s old heroes with an appropriately strong vocal and amusing horror-movie samples, Love Hysteria shows Murphy fully coming into his own as a performer.\n\nEnjoy!","torrent":{"xt":"urn:btih:e8998a35b353c0e69ce1afcc1bd847f0ed372d28","amp;dn":"Peter+Murphy+-+Love+Hysteria%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8998a35b353c0e69ce1afcc1bd847f0ed372d28","infoHashBuffer":{"type":"Buffer","data":[232,153,138,53,179,83,192,230,156,225,175,204,27,216,71,240,237,55,45,40]},"announce":[],"urlList":[]}}