{"title":"Tim McGraw - Felt Good On My Lips (2nafish)","uid":6046238,"size":147265540,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e8fb2aa198e1be21ff2fa7882e98be7bf54f7695&amp;dn=Tim+McGraw+-+Felt+Good+On+My+Lips+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1292563168,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Felt Good on My Lips&quot; is the title of a song written by Brett Beavers, Jim Beavers, Brett Warren and Brad Warren, and was recorded by American country music singer Tim McGraw. It was released in September 2010 as the lead single from his compilation album Number One Hits.\n\nSongwriter Brett Beavers wrote &quot;Felt Good on My Lips&quot; with his brother, Jim Beavers, as well as Brett Warren and Brad Warren (also known as The Warren Brothers). In an interview with The Boot, Jim said that Brett provided the idea of writing with The Warren Brothers, and Brett Warren based the song around a bass guitar riff that Jim played.\n\n&quot;Felt Good on My Lips&quot; was released to radio in September 2010. It will be included on a compilation album titled Number One Hits, which will include all of McGraw's number-one singles as well as &quot;Felt Good on My Lips&quot; and a remix of &quot;Indian Outlaw&quot;.\n\nThe song debuted at number 33 on the Hot Country Songs charts dated for the week ending October 9, 2010. It is the second-highest debuting single of his career, behind only &quot;Grown Men Don't Cry&quot;, which entered the same chart at number 30. It also debuted at #26 on the U.S. Billboard Hot 100 chart for the week of December 15, 2010. It also debuted at #36 on Canadian Hot 100 chart for the week of December 19, 2010.\n\nNumber One Hits is the fourth greatest hits album by American country artist Tim McGraw. It was released in the United States on November 30, 2010 through Curb Records. The album's first single, &quot;Felt Good on My Lips&quot; was released as the albums lead single, and has become a top 10 hit.\n\nSamuel Timothy &quot;Tim&quot; McGraw (born May 1, 1967) is an American country singer and actor. Many of McGraw's albums and singles have topped the country music charts, leading him to achieve total album sales in excess of 40 million units. He is married to country singer Faith Hill and is the son of former baseball player Tug McGraw. His trademark hit songs include &quot;Indian Outlaw&quot;, &quot;Don't Take the Girl&quot;, &quot;I Like It, I Love It&quot;, &quot;Something Like That&quot;, &quot;It's Your Love&quot; (featuring his wife, Faith Hill), and &quot;Live Like You Were Dying&quot;.\n\nMcGraw had eleven consecutive albums debut at Number One on the Billboard albums charts. Twenty-one singles hit No. 1 on the Billboard Hot Country 100 chart. Three singles became the No. 1 country song of the year (&quot;It's Your Love&quot;, &quot;Just To See You Smile&quot;, and &quot;Live Like You Were Dying&quot;). He has won 3 Grammys, 14 Academy of Country Music awards, 11 Country Music Association (CMA) awards, 10 American Music Awards, and 3 People's Choice Awards. His Soul2Soul II Tour with Faith Hill is the highest grossing tour in country music history, and one of the top five among all genres of music.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e8fb2aa198e1be21ff2fa7882e98be7bf54f7695","amp;dn":"Tim+McGraw+-+Felt+Good+On+My+Lips+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8fb2aa198e1be21ff2fa7882e98be7bf54f7695","infoHashBuffer":{"type":"Buffer","data":[232,251,42,161,152,225,190,33,255,47,167,136,46,152,190,123,245,79,118,149]},"announce":[],"urlList":[]}}