{"title":"SPRING_SUMMER_FALL_AND_2003_XVID[chetang]","uid":8065058,"size":1308600437,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e904df7c7dd20c28aaa9cc8f120e11a2a245b30d&amp;dn=SPRING_SUMMER_FALL_AND_2003_XVID%5Bchetang%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChetanG","files":-1,"time":1359156507,"description":"Storyline\n\nIn the midst of the Korean wilderness, a Buddhist master patiently raises a young boy to grow up in wisdom and compassion, through experience and endless exercises. Once the pupil discovers his sexual lust, he seems lost to contemplative life and follows his first love, but soon fails to adapt to the modern world, gets in jail for a crime of passion and returns to the master in search of spiritual redemption and reconciliation with karma, at a high price of physical catharsis..\n\n\nOne Reviewers Comments:\n\nThis film left me speechless, and I still have a hard time putting how I feel about this movie into words. After seeing it the first time in the theater, my friend and I couldn't bring ourselves to say a word to each other...not even in the car on the ride back. The second time I saw it, after purchasing it, another friend and I walked around the campus for half an hour in silence. The third time, a friend and I sat in silence in her room for an hour after the movie was over. This film is that profound, touching, and moving.\n\nSpring, Summer, Fall, Winter...Spring is the most beautiful movie I have ever seen. Visually it is fantastic, though several films surpass it in this aspect. However, the film manages to speak directly to the soul (or...failing to believe in the soul...something deep inside anyone watching it), and this is where it's beauty lies. Parts are so affecting that a painful nostalgia for a place you never knew overwhelms you.\n\nI am sorry I cannot be more helpful...the quality that makes this movie so wonderful is well beyond words for me.","torrent":{"xt":"urn:btih:e904df7c7dd20c28aaa9cc8f120e11a2a245b30d","amp;dn":"SPRING_SUMMER_FALL_AND_2003_XVID%5Bchetang%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e904df7c7dd20c28aaa9cc8f120e11a2a245b30d","infoHashBuffer":{"type":"Buffer","data":[233,4,223,124,125,210,12,40,170,169,204,143,18,14,17,162,162,69,179,13]},"announce":[],"urlList":[]}}