{"title":"Aristotle's Categories and Porphyry","uid":6576930,"size":3967188,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9a1cb1acc1154bdd7c10787c0021547f6890b1c&amp;dn=Aristotle%5C%27s+Categories+and+Porphyry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1312239663,"description":"Aristotle's Categories and Porphyry By Christos Evangeliou\nPublisher: B.r.i.l.l Academic 1997 | 215 Pages | ISBN: 9004085386 | PDF | 3.78 MB\n\n\n\nAristotle's doctrine of categories is important for the history of Hellenic and Western philosophy. He used it skilfully for reformulating and resolving many traditional problems of logical, ontological, epistemological and ethical import. In his hands the doctrine also became a powerful tool for criticizing the Presocratics and the Academics. The latter remained divided in their opinions about it to the end of the third century A.D.\n\nPlotinus was the last Platonist to criticize Aristotle's categories, especially in their ontological pretensions. Ironically, it was Porphyry, Plotinus' most brilliant disciple, who put an end to the prolonged controversy about the merit of Aristotle's categorial doctrine by favorably commenting on it. Thereafter, the doctrine became part of the Neoplatonic School curriculum. In this respect, Porphyry initiated a new policy of reconciliation between Platonism and Aristotelianism.\n\nThis work is a systematic study of Porphyry's interpretation of Aristotle's doctrine of categories. In view of Plotinus's sharp criticism of it, Porphyry's sympathetic treatment of this doctrine appears problematic. By textual analysis and critical argument, this study attempts to elucidate the question of how and why the two philosophers differ in their approaches to the problem which Aristotle's categories presented to them.","torrent":{"xt":"urn:btih:e9a1cb1acc1154bdd7c10787c0021547f6890b1c","amp;dn":"Aristotle%5C%27s+Categories+and+Porphyry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9a1cb1acc1154bdd7c10787c0021547f6890b1c","infoHashBuffer":{"type":"Buffer","data":[233,161,203,26,204,17,84,189,215,193,7,135,192,2,21,71,246,137,11,28]},"announce":[],"urlList":[]}}