{"title":"Strike Witches (Complete Collection)","uid":10069534,"size":8793335342,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e9dfaff399d1c9e61e3d84398efdedafb795f23e&amp;dn=Strike+Witches+%28Complete+Collection%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SpyroBoyEternal","files":-1,"time":1398831156,"description":"Format: 720p MP4 \nNote: OVA is in MKV format. \n\n- Season 1: Episodes 1 - 12(End) + OVA\n- Season 2: Episodes 1 - 12(End)\n- Movie\n\n\n\nSet in an alternate Earth in the mid twentieth century, Strike Witches tells the story of a fight to protect the world using a combination of magic and technology in a fictional recreation of events occurring in World War II with the national armies joining forces to confront an overwhelming alien threat together instead of fighting among themselves. Most battles featured in the franchise are fictional recreations of real conflicts of that time, with the human army taking the role of the Allied Forces, and the Neuroi assuming the side of the Axis Powers.\n\nThe titular Strike Witches are young women with high magical potential who are recruited into military organizations around the world to fight against the enigmatic Neuroi, which began an invasion of unprecedented scale on human territory in 1939. This puzzling enemy force has appeared frequently and without warning in many areas across the world throughout history. The weapons of the Neuroi mostly take on forms similar to aircraft, but their most troubling tactic is the spreading of a corrosive miasma. Not only do normal humans have no defense against this miasma, but the remnants of the land affected by it are processed by the Neuroi into new weapons, crumbling huge sections of former nations into the sea. As the miasma seems to be unable to spread across large bodies of water, humanity has designated such areas as their main lines of defense.\n\nTo bring out their potential for use in battle, each Witch equips a unique machine onto their legs: the Striker Unit. With the Striker Unit equipped, they gain the ability to fly and their tapped magical potential provides the strength to utilize weapons far too heavy and powerful for a normal person. A defensive field is also created that can protect the Witches from the Neuroi's miasma, as well as other physical weaponry, making them humanity's trump card in the war. The franchise's main media focuses on the 501st Joint Fighter Wing, defending the Britannian home islands, in the first season, as a parallel to the Battle of Britain, and struggling to retake an occupied Italian peninsula in the second season as a parallel to the late stages of the Adriatic Campaign. In the feature film, the 501st join forces to repel an enemy offensive near the Rhine in a fashion similar to the events of the Battle of the Bulge.","torrent":{"xt":"urn:btih:e9dfaff399d1c9e61e3d84398efdedafb795f23e","amp;dn":"Strike+Witches+%28Complete+Collection%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9dfaff399d1c9e61e3d84398efdedafb795f23e","infoHashBuffer":{"type":"Buffer","data":[233,223,175,243,153,209,201,230,30,61,132,57,142,253,237,175,183,149,242,62]},"announce":[],"urlList":[]}}