{"title":"PodWorks 2.9.6 with CORE keygen","uid":5379873,"size":1487283,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e9fbff7440262b6813d42621dfc7c128ef57c04c&amp;dn=PodWorks+2.9.6+with+CORE+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1266695734,"description":"Official Web Site: &lt;a href=&quot; http://www.scifihifi.com/podworks/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.scifihifi.com/podworks/&lt;/a&gt;\n\nPodWorks is a Mac OS X application that compensates for the iPod's only downside: Apple only allows you to copy songs to your iPod. If you have two Macs and want to use your iPod to transfer music from one to the other, or you only store your music and videos on your iPod and need to copy them back onto your hard drive after a disk failure, you are out of luck!\nThis is where PodWorks comes in: it allows you to copy songs and videos from any iPod or iPhone to any Mac running OS X 10.4 or higher. Its important features include:\n\n* iPhone support: PodWorks recognizes and allow transfers from your iPhone.\n \n* Superior performance: Many other standalone iPod song transfer utilities work by reading song data out of every song on the iPod--a slow process. PodWorks, by contrast, reads its data directly from the iPod's internal database, resulting in nearly instantaneous display of your song list.\n \n* More metadata: Since PodWorks can read from the iPod's internal database, it can also display and sort by song &quot;metadata&quot; not available through ID3 (including Date Added, Play Count, and Star Rating).\n\n* iTunes integration: In addition to copying songs to the Finder, PodWorks can send songs, playlists (registered version only), and metadata (star ratings, play counts, track numbers, etc.) directly to iTunes. It can also filter its song list to show you only the songs on the iPod that are not present in your iTunes library.\n \n* Playlists: PodWorks recognizes your iPod's playlists. Entire playlists can be copied to your computer with a single drag.\n\n* Song Playback: PodWorks allows you to preview songs before you copy them by playing them directly off the iPod (not yet available for iPhone).\n \n* Strong organizational capabilities: Copying large numbers of files can get messy, so PodWorks can automatically sort transferred files into directories and change their filenames according to your preferences.\n \n* Portability: PodWorks can be placed on your iPod for convenient access away from your home computer. It will work when run off the iPod, and will remember its registration information even when connected to a previously unknown machine.\n \nSystem Requirements:\n  \nOS X.4 and above\n2.9.6: Minor fixes for Snow Leopard compatibility.\n\n--&gt;&gt; PLEASE SEED &lt;&lt;--\n\n\n","torrent":{"xt":"urn:btih:e9fbff7440262b6813d42621dfc7c128ef57c04c","amp;dn":"PodWorks+2.9.6+with+CORE+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9fbff7440262b6813d42621dfc7c128ef57c04c","infoHashBuffer":{"type":"Buffer","data":[233,251,255,116,64,38,43,104,19,212,38,33,223,199,193,40,239,87,192,76]},"announce":[],"urlList":[]}}