{"title":"NubileFilms - Angel Smalls ** NEW 23 January 2016 **","uid":13287973,"size":184717720,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:eaacf8301f8f9cbad8c8ea134d6b5957d4e22734&amp;dn=NubileFilms+-+Angel+Smalls+%2A%2A+NEW+23+January+2016+%2A%2A&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SudoSu","files":1,"time":1453563721,"description":"\nhttp://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――   \nhttp://imgpremium.com/image/gMi \nhttp://imgpremium.com/image/gM4\r\n\r\nSmall Boobs, Shaved Pussy, Short Girls, Bras, Hardcore, Thongs, High Heels, Girl-Boy, Blowjob, \r\n\r\nLusty coed Angel Smalls stares at herself in the mirror as she tries to decide what to wear. Starting with a lacy thong and matching bra, she slips a dress with a skirt so short it barely covers her ass over her head. The finishing touch is a pair of heels that add inches to her tiny frame. She has only barely decided that she is ready for seduction when Ryan Driller joins her in the bedroom and lets her know that she doesn't have to wait for the sex that she craves.\r\n\r\nAfter removing the dress that Angel has just put on, Ryan cups the blonde's little boobs while making sure to spend plenty of time fondling her rock hard nipples. While one hand continues its exploration of Angel's tit, the other slides beneath her thong to sample the wetness of her slick bald slit. Knowing that Ryan wants a taste of what he feels, Angel is happy to lead him to the bed so that she can relax while he does all the work.\r\n\r\nWhen Ryan pulls aside her thong and presses the first of many long kisses to her snatch, Angel lets her head fall back onto the bed in sheer joy. Knowing that his lover enjoys every moment of oral sex, Ryan makes sure to take his time while lapping and licking at every one of Angel's tender spots.\r\n\r\nHappy to repay the favor, Angel switches spots with Ryan so that she's the one in charge and then takes her time teasing her lover with long sweeps of her tongue up his shaft that gradually lead to her first taste of the tip. Ryan can't get enough of watching his tiny lover gobble his cock, especially as she takes him into her mouth as far as she can in a deep throat blowjob that leaves him dying for more.\r\n\r\nAs much as Angel knows that she could suck Ryan's cock all day, her throbbing pussy demands better action. Crawling up her lover's body, Angel positions herself so that Ryan's dick is right at her fuck hole and then slides down. As soon as she's settled she starts pumping her hips, holding nothing back as she rides her stud until her whole body flutters with pleasure.\r\n\r\nThe feel of Angel's pulsing pussy walls around his cock drives Ryan wild and prompts him to take control. Flipping Angel onto her back, he settles himself between her thighs and drives into her with long powerful strokes that are meant to hit every one of Angel's happy places. When he flips Angel again so that she is on her hands and knees, her moans of ecstasy let him know that he has finally found exactly the right position to totally rock her world!\r\n\r\nKnowing that Ryan is right on the edge of his own climax, Angel doesn't hesitate. As soon as she gets off, she turns to face her lover so that she can aim his cock towards her eager mouth to take as much of his cum as she can. Once she has licked Ryan's stiffie clean, Angel rolls onto her side to play with the sticky evidence of his love.\r\n\r\nMore exclusive porn at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:eaacf8301f8f9cbad8c8ea134d6b5957d4e22734","amp;dn":"NubileFilms+-+Angel+Smalls+%2A%2A+NEW+23+January+2016+%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaacf8301f8f9cbad8c8ea134d6b5957d4e22734","infoHashBuffer":{"type":"Buffer","data":[234,172,248,48,31,143,156,186,216,200,234,19,77,107,89,87,212,226,39,52]},"announce":[],"urlList":[]}}