{"title":"Bob Dylan - Tempest (2012) [24 bit FLAC] vinyl","uid":8313120,"size":1513257851,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eb02caa624d33708b04a7c5dc29a60bb88250dea&amp;dn=Bob+Dylan+-+Tempest+%282012%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1364520879,"description":"  Bob Dylan - Tempest (2012) [24 bit FLAC] vinyl\n\n  Released: 2012\n  Source: 88725457601 / Europe\n  Genre: Pop/Rock\n  Style: Folk, Singer/Songwriter\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Duquesne Whistle \n  A2. Soon After Midnight \n  A3. Narrow Way \n  B1. Long And Wasted Years \n  B2. Pay In Blood \n  B3. Scarlet Town \n  C1. Early Roman Kings \n  C2. Tin Angel \n  D1. Tempest \n  D2. Roll On John \n\n  Fifty years after Bob Dylan's debut album appeared, we get Tempest. Since he returned to recording original material on 1997's Time Out of Mind, he's been rambling through American musical styles -- blues, country, folk, rockabilly, swing -- that were popular before he was even on the scene. Tempest continues the exploration, but more urgently than on Modern Times and Together Through Life. It's a gritty, cantankerous record with abundant images of violence, lust, and humor, though the latter is often black. His protagonists settle scores with lovers, enemies, and power brokers; they're often self-aggrandizing and self-deprecating simultaneously. Most of these are story-songs, though none but &quot;Tempest&quot; tracks in a linear fashion. &quot;Duquesne Whistle&quot; opens nostalgically with steel and acoustic guitars playing a swing melody reminiscent of Bob Wills. When the band enters, it becomes a rockabilly shuffle with teeth. &quot;Soon After Midnight&quot; is a ballad with hazardous warnings (&quot;...Two-Timing Slim/Who's every heard of him?/I'll drag his corpse through the mud&quot;). &quot;Narrow Way&quot; is a blues wailer that faintly looks back at &quot;Maggie's Farm.&quot; Dylan's lyric contradictions are in full force; the song asks unanswerable questions while expressing rage and vulnerability (&quot;...Even death has washed its hands of you&quot; and &quot;Put your arms around me, where they belong&quot;). &quot;Pay in Blood&quot; is a rocking venomous boast with one of his more memorable refrains: &quot;I pay in blood, but not my own.&quot; &quot;Early Roman Kings&quot; is a basic rewrite of Muddy Waters' &quot;Mannish Boy.&quot; David Hidalgo's old-world accordion plays the signature swaggering, razor-sharp guitar riff underscoring the notion that the blues are universal, timeless. Dylan's nasty rasp fueled by lust, vengeance, and power is balanced by his wicked humor: &quot;I can strip you of life, strip you of breath/I can ship you down, to the house of death...I ain't dead yet, my bell still rings/I keep my fingers crossed like the early Roman kings.&quot; Musically, &quot;Tin Angel&quot; looks back to &quot;Man in the Long Black Coat&quot; for a frame. Lyrically, this is Dylan at his storytelling best; its twists and turns would be right at home on Blood on the Tracks and Desire -- and it would have made a great closer. Sadly, that's not the case. The nearly 14-minute, 45-verse title cut retells the story of the Titanic with references to history -- and the James Cameron film. Hearing it once is enough. &quot;Roll on John,&quot; Dylan's elegy for friend John Lennon, closes the set. He uses a slew of Lennon's own lyrics as a tribute. The end result is moving but clumsy. These last two cuts aside, Tempest is still a damn fine album. Dylan is in mostly excellent form -- even when sloppy; it sounds like he's having the time of his life.","torrent":{"xt":"urn:btih:eb02caa624d33708b04a7c5dc29a60bb88250dea","amp;dn":"Bob+Dylan+-+Tempest+%282012%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb02caa624d33708b04a7c5dc29a60bb88250dea","infoHashBuffer":{"type":"Buffer","data":[235,2,202,166,36,211,55,8,176,74,124,93,194,154,96,187,136,37,13,234]},"announce":[],"urlList":[]}}