{"title":"Star Trek TOS s01e11e12 FANEDIT Isolation 900p 6ch x265 HEVC","uid":13191457,"size":461642254,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:eb14ba0f7b0e6af72ea7b223de3c9899fdb1949f&amp;dn=Star+Trek+TOS+s01e11e12+FANEDIT+Isolation+900p+6ch+x265+HEVC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bsg4you","files":3,"time":1452442632,"description":"Star.Trek.TOS.s01e11e12.FANEDIT.The.Menagerie.Isolation.900p.6ch.x265.HEVC\r\n\r\nTHIS TORRENT USES X265 HEVC (High Efficiency Video Coding) VIDEO\r\nPLEASE USE A PLAYER THAT SUPPORTS X265 HEVC VIDEO LIKE VLC, POTPLAYER, ETC\r\n\r\nTHIS IS A FANEDIT OF STAR TREK S01E11 AND S01E12 THE MENAGERIE\r\nALMOST ALL OF THE CAGE PORTIONS WITH THE ORIGINAL PIKE WERE REMOVED\r\n\r\nStar Trek s1e11 s1e12 The Menagerie Isolation FANEDIT\r\nvideo: 1200X900 HEVC crf=21 preset=medium\r\naudio: 6-channel surround sound HE-AAC 256Kbps\r\n47m 26s 461,597,031bytes\r\n  http://www.imdb.com/title/tt0394904/  \r\n  http://www.imdb.com/title/tt0708472/  \r\n\r\nThis is a FANEDIT of Star Trek The Original Series episodes s01e11 and s01e12: The Menagerie. This fanedit's main change is removing most of The Cage portions of the two videos. If a viewer is watching the series in order, The Cage would come first and shortly after The Menagerie would repeat most of material from The Cage. If a viewer just wanted to watch the new material in The Menagerie, this fanedit should work nicely. This is the version with the much nicer special effects and generally looks very good.\r\n\r\nCHANGES:\r\n- Almost all of The Cage material is removed except when zooming in and out of the hearing view screen, when someone is doing voice over or for a few seconds to make a smooth edit\r\n- Establishing shots were retained since they contain the remastered special effects\r\n- The opening music/credits for s01e12 part2 were removed\r\n- The s01e12 part2 opening that summarizes s01e11 part1 with Kirk's narration was retained since it has some new footage and Kirk's voice over is new but the end of the summary was was removed since it lacks new footage or dialog\r\n- Both end credit sequences were retained but placed at the end of the fanedit with s01e11 part1 first and s01e12 part2 second\r\n- Commercial breaks/fades were mostly removed except for the pause after the opening credits and a couple of fade ins\r\n\r\nPlease check out other releases of Gotham, MST3K, Rifftrax, Battlestar Galactica, DC Comics, documentaries, Star Trek Enterprise and more at:\r\n  https://thepiratebay.se/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:eb14ba0f7b0e6af72ea7b223de3c9899fdb1949f","amp;dn":"Star+Trek+TOS+s01e11e12+FANEDIT+Isolation+900p+6ch+x265+HEVC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb14ba0f7b0e6af72ea7b223de3c9899fdb1949f","infoHashBuffer":{"type":"Buffer","data":[235,20,186,15,123,14,106,247,46,167,178,35,222,60,152,153,253,177,148,159]},"announce":[],"urlList":[]}}