{"title":"Cry of the Sea by D G Driver (retail) {dwg}","uid":10988064,"size":5112604,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb9f8e2934834f8f347100ccfd995ab7ab085e37&amp;dn=Cry+of+the+Sea+by+D+G+Driver+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1409950339,"description":"Juniper Sawfeather is choosing which college to attend after graduation from West Olympia High School next year. She wants to go to San Diego to be far away from her environmental activist parents. They expect her to think the way they do, but having to be constantly fighting causes makes it difficult to be an average seventeen-year-old high school student. Why do her parents have to be so &quot;out there?&quot; Her feelings on the subject are changed when she and her father rush to the beach after a reported oil spill. As they document the damage, June discovers three humans washed up on the beach, struggling to breathe through the oil coating their skin. At first she thinks they must be surfers, but as she gets closer, she finds out that these aren't humans at all. They're mermaids! Now begins a complex story of intrigue, conspiracy and manipulation as June, her parents, a marine biologist and his handsome young intern, her best friend, the popular clique at school and the oil company fight over the fate of the mermaids. This title is published by Melange Books LLC and is distributed worldwide by Untreed Reads.","torrent":{"xt":"urn:btih:eb9f8e2934834f8f347100ccfd995ab7ab085e37","amp;dn":"Cry+of+the+Sea+by+D+G+Driver+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb9f8e2934834f8f347100ccfd995ab7ab085e37","infoHashBuffer":{"type":"Buffer","data":[235,159,142,41,52,131,79,143,52,113,0,204,253,153,90,183,171,8,94,55]},"announce":[],"urlList":[]}}