{"title":"ADOBE PHOTOSHOP PLUGINS [thethingy]","uid":5956901,"size":20082807,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eca5e84edc421faf4609f76bd12af1dfdc02ae22&amp;dn=ADOBE+PHOTOSHOP+PLUGINS+%5Bthethingy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"thethingy","files":-1,"time":1289762615,"description":"ADOBE PHOTOSHOP PLUGINS \n\nArtizen Photoshop Plug-Ins\n\nArtizen Dramatic v3.0 \n\nArtizen Dramatic v3.0 is a dynamic Photoshop plug-in filter which gives photographers an enormous amount of control over the detail, colour and contrast of a photo in a single filter. \n\nDramatic easily achieves breathtaking shots by utilizing state of the art multi scale technology that adds depth where contrast is low and exposes detail in low exposed areas of an image. In addition to this, Dramatic has a full set of colour functions that allow users to create striking black and white or vibrant colour results.\n\nGetting the results you want has never been easier, zip through our 24 built-in presets or create and share your own with friends and family. \n\nDramatic is one of the few Photoshop plug-ins that can work with High Dynamic Range images, resulting in the most detailed breathtaking results. This support is not limited to HDR, which enable Dramatic to work with your past, present and future work flows ensuring you always get the most out of your photos. \n\nArtizen Natural v3.0 \n\nArtizen Natural v3.0 is a powerful Photoshop plug-in filter which gives photographers an enormous amount of control over the detail, colour and contrast of a photo in a single filter to produce the most realistic results.\n\nNatural filter easily achieves realistic shots by utilising state of the art multi scale technology that exposes the natural beauty of your photos without giving it a cartoonish look. In addition to this, Natural has a full set of colour functions that allow users to create striking black and white or vibrant colour results.\n\nGetting the results you want has never been easier, zip through our 26 built-in presets or create and share your own with friends and family. \n\nNatural is a state of the art filter, it is also one of the few filters that support 8, 16 and 32bit HDR images, allowing Natural to get the most detailed breathtaking results but still look like it came straight from your camera. This support also enables Natural to work with your past, present and future work flows ensuring you always get the most out of your photos regardless of what type of photo it is.\n\nArtizen PanoTransform\n\nArtizen PanoTransform plug-in filter rotates mirror ball and panoramic photos in 3D space. Now produce stunning panoramic images easier and faster than before.\n\nPanoTransform translates your 2D mirror ball and panoramic photos into 3D space, rotates the 3D values and then converts it back to a 2D image.\n\nAlways produce perfect 360x360 panoramic image. Rather than taking dozens of photos and stitching them together to produce a panoramic image, take 2 photos of a mirror ball at different angles from each other and then mask them together to remove the photographer. PanoTransform is needed to rotate one of the mirror ball photo's to perfectly match the first photo.   &lt;a href=&quot;\nhttp://www.virustotal.com/file-scan/report.html?id=67ab5aa7fda298014f8206800a422d756f5ce70951df3c39c8af5ae118dc8cee-1289758947&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/file-scan/report.html?id=67ab5aa7fda298014f8206800a422d756f5ce70951df3c39c8af5ae118dc8cee-1289758947&lt;/a&gt;\n\nYou need Photoshop installed first;\n\nPhotoshop CS5 Extended;  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5628169&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5628169&lt;/a&gt;\n\nPhotoshop CS5 Extended in eLearning Suite;  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5702621&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5702621&lt;/a&gt;\n\nPhotoshop CS5 Extended in Technical Communication Suite;  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5699267&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5699267&lt;/a&gt;\n\nPhotoshop CS5 Extended in CS5 Production Premium;  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5649900&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5649900&lt;/a&gt;\n\nPhotoshop CS5 Extended in CS5 Design Premium;  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5529111&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5529111&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:eca5e84edc421faf4609f76bd12af1dfdc02ae22","amp;dn":"ADOBE+PHOTOSHOP+PLUGINS+%5Bthethingy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eca5e84edc421faf4609f76bd12af1dfdc02ae22","infoHashBuffer":{"type":"Buffer","data":[236,165,232,78,220,66,31,175,70,9,247,107,209,42,241,223,220,2,174,34]},"announce":[],"urlList":[]}}