{"title":"Applied Plastics Engineering Handbook {BBS}","uid":6754083,"size":15679861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecd700103782fdc302ea4ea71d68873e09ce8b4e&amp;dn=Applied+Plastics+Engineering+Handbook+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1318975694,"description":"A practical reference for all plastics engineers who are seeking to answer a question, solve a\n\nproblem, reduce a cost, improve a design or fabrication process, or even venture into a new\n\nmarket. Applied Plastics Engineering Handbook covers both polymer basics - helpful to bring\n\nreaders quickly up to speed if they are not familiar with a particular area of plastics processing -\n\nand recent developments - enabling practitioners to discover which options best fit their\n\nrequirements. Each chapter is an authoritative source of practical advice for engineers, providing\n\nauthoritative guidance from experts that will lead to cost savings and process improvements.\n\nThroughout the book, the focus is on the engineering aspects of producing and using plastics. The\n\nproperties of plastics are explained along with techniques for testing, measuring, enhancing and\n\nanalyzing them. Materials and additives are described as well as their characteristics and effects.\n\nThe technologies and machinery used in processing operations are covered with reference to\n\nproduct design. And recent developments in a cross-section of applications demonstrate in a\n\npragmatic way, the opportunities as well as the limitations of plastics.\n\n. Practical introductions to both core topics and new developments make this work equally valuable for newly qualified plastics engineers seeking the practical rules-of-thumb they don't teach you in school, and experienced practitioners evaluating new technologies or getting up to speed on a new field.\n\n. The depth and detail of the coverage of new developments enables engineers and managers to gain knowledge of, and evaluate, new technologies and materials in key growth areas such as biomaterials and nanotechnology.\n\n. This highly practical handbook is set apart from other references in the field, being written by engineers for an audience of engineers and providing a wealth of real-world examples, best practice guidance and rules-of-thumb.\nProduct Details\n\n    * Hardcover: 574 pages\n    * Publisher: William Andrew; 1 edition (August 9, 2011)\n    * Language: English\n    * ISBN-10: 1437735142\n    * ISBN-13: 978-1437735147","torrent":{"xt":"urn:btih:ecd700103782fdc302ea4ea71d68873e09ce8b4e","amp;dn":"Applied+Plastics+Engineering+Handbook+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecd700103782fdc302ea4ea71d68873e09ce8b4e","infoHashBuffer":{"type":"Buffer","data":[236,215,0,16,55,130,253,195,2,234,78,167,29,104,135,62,9,206,139,78]},"announce":[],"urlList":[]}}