{"title":"Ivan.Vasilevich.menyaet.professiyu.(1973)","uid":3625248,"size":732239872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ed0b90cc92c1489a57e7b6af32a20785c0b73f3a&amp;dn=Ivan.Vasilevich.menyaet.professiyu.%281973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timberlax","files":1,"time":1172271080,"description":"This is a NEW TORRENT. I lost the old one and had to create a new one to seed again. Sorry for the inconvenience. You have to re-download this torrent if you still have the other one. Same movie: Russian + English subtitles. Enjoy!\n\nVery funny old Russian movie (1973). Has Russian spoken language and I have finally made it with English subtitles. Humor is a universal language and this masterpiece was one of the highlights of director genius Leonid Gaidai. Please spread around and enjoy!\n\nThe movie begins in 1973 Moscow, where Engineer Shurik (Aleksandr Demyanenko) is working on a time machine in his apartment. By accident, he sends Ivan Vasilevich Bunsha (Yuri Yakovlev), an apartment building manager, and George Miloslavksy (Leonid Kuravlev), a small-time burglar, back into the 16th century, the time of Ivan IV, a.k.a. Ivan the Terrible. The pair is forced to disguise themselves, with Bunsha dressing up as Ivan IV. At the same time, the real Ivan IV (also brilliantly played by Yuri Yakovlev) is sent by the same machine into Shurik&amp;#039;s apartment, where he has to deal with modern-day life while Shurik tries to fix the machine so that everyone can be brought back to their proper place in time. As the police (tipped off by a neighbor who was burgled by Miloslavky) close in on Shurik, who is frantically trying to repair the machine, the cover of Bunsha and Miloslavsky is blown and they have to fight off the palace guards, who find out that Bunsha is not the real Ivan IV. The movie ends with some surprising twists!","torrent":{"xt":"urn:btih:ed0b90cc92c1489a57e7b6af32a20785c0b73f3a","amp;dn":"Ivan.Vasilevich.menyaet.professiyu.%281973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed0b90cc92c1489a57e7b6af32a20785c0b73f3a","infoHashBuffer":{"type":"Buffer","data":[237,11,144,204,146,193,72,154,87,231,182,175,50,162,7,133,192,183,63,58]},"announce":[],"urlList":[]}}