{"title":"Charles Dickens - A Christmas Carol - Patrick Stewart","uid":9334306,"size":81875078,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:edc83fe55f08dd61fd063d8fa830e9dc0758a9ef&amp;dn=Charles+Dickens+-+A+Christmas+Carol+-+Patrick+Stewart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1386827103,"description":"Source: 1991 2-CD Set Original Recording 320cbr\n-\nPlease note that there are two special settings on the MP3 files in this collection\n-\nSkip Shuffle - If you have this audio book on your music player and shuffle songs none of these audio book tracks will play.\n-\nRemember Position - If you hit the stop button when the track is resumed later it will begin to play where it left off. \n\n-\nAlbum Display - When viewing this audio book in your music player you will see one album with cover art with 2 discs inside. The view from the factory is typically one album for each disc and that makes for sloppy.\n\n- Big Papi\n-\nBy taking a rest HALL OF FAME on October 19, 2000\n\n[quote]Firstly I have a bit of a retraction to make. I have often said that books that have been recorded, and even worse abridged, are not worth the time of the listener, and not what the writer originally intended. In this case the opposite is true. Mr. Dickens often performed portions of his work, and if you can spot the abridgments in this performance, you are very cognizent of every line of the piece.\nMr. Stewart is well known for his television role of Captain Picard. He is also an award winning thespian, and a long-term veteran of London's Royal Shakespeare Company. He has performed &quot;A Christmas Carol&quot; on stage in London, and New York City, and the elements shared were the highest recognition of his peers, and sold out shows.\nI had the privilege to see Mr. Stewart perform his Olivier Award Winning one-man show, and it was extraordinary. The Disc will bring you his voice, and while it cannot match the presence of this Actor, the listener is missing less than you might expect.\nThe disc cannot replace the live performance. Mr. Stewart's performance is done on stage with so little in addition to his voice, short of being there this is tremendous. When on stage there are no sets, just 4 pieces of wooden furniture that he moves about, as he needs. There are no costumes, as he appeared is contemporary dress. The lighting is minimal, so when you can only listen you still have the heart of the performance. There is no extravaganza on stage, no over produced ready-made soundtrack. There is one extremely talented man, relaying one of the greatest writer's works to you.\nThere are dozens of roles to play, he plays them all, and when a conversation takes place between multiple characters, you will think you hear multiple actors.[/quote]","torrent":{"xt":"urn:btih:edc83fe55f08dd61fd063d8fa830e9dc0758a9ef","amp;dn":"Charles+Dickens+-+A+Christmas+Carol+-+Patrick+Stewart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc83fe55f08dd61fd063d8fa830e9dc0758a9ef","infoHashBuffer":{"type":"Buffer","data":[237,200,63,229,95,8,221,97,253,6,61,143,168,48,233,220,7,88,169,239]},"announce":[],"urlList":[]}}