{"title":"Micheal Topper New Thunderbird Chronicles Magazines","uid":5441573,"size":97508324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eeff69f6f97deaf9657d11dbcb8c5eca90a72323&amp;dn=Micheal+Topper+New+Thunderbird+Chronicles+Magazines&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ecolord","files":22,"time":1268899885,"description":"Michael J. Topper [nickname: MT]? is the author of some of the most outstanding esoteric literature currently seen on the market. According to his own writings, he started his spiritual career together with his wife (he calls her &quot;AAA&quot;) by practicing a lot of meditation and other &quot;commonly well known&quot; techniques in the beginning of the 70's. At the end of the 70's his hard work reached a sort of culmination point when after an intense meditation session they were left with a permanent faculty of &quot;aura reading&quot;.\n\n&quot;This faculty proved to be far more powerful than any [other faculty] about which they'd read, including the celebrated [Aura-reading] faculty of Leadbetter, et. al.&quot;\n\nWhat followed were some more years of intense work from both MT and AAA with these now-visible multidimensional energies; they did a lot of &quot;primary experimentation&quot; with these energies in order to figure out how they work.\n\nEventually, after some more years, they figured out a real lot about these energies and e.g. how to align them. For example, a theme that is constantly re-appearing over and over again in MT's writings is his axiom that human consciousness is [artificially] being limited due to its current low-level mind/body-integration; and a higher mind/body integration could be reached by raising one's kundalini energy, which is locked at the base of the spine.\n\nSubsequently MT and AAA claim that they have reached a state as high as Enlightenment; and in 1988, MT started to produce books, audio tapes and a magazine (&quot;TNTC - The New Thunderbird Chronicle&quot;). During this time (that is, from 1988 up to 1993 or perhaps 1994) a staggering amount of information arose from MT whose quality is simply breathtaking.\n\nIn 1993, MT and AAA stated they were under occult siege - negative beings of higher dimensions from Orion wanted to shut down MT's communication. Since then, not much was ever heard from MT or AAA again.\n\nHowever, in these few productive years (1988 to approx. 1993) MT/AAA poured out well over 700 pages of first-class &quot;transdimensional&quot; information, and no less than 90 (or so) audio tapes with all sort of uncommon information. &lt;a href=&quot;\nhttp://southerncrown.tribe.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://southerncrown.tribe.net&lt;/a&gt; \tRSS Feed what is XML?","torrent":{"xt":"urn:btih:eeff69f6f97deaf9657d11dbcb8c5eca90a72323","amp;dn":"Micheal+Topper+New+Thunderbird+Chronicles+Magazines","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeff69f6f97deaf9657d11dbcb8c5eca90a72323","infoHashBuffer":{"type":"Buffer","data":[238,255,105,246,249,125,234,249,101,125,17,219,203,140,94,202,144,167,35,35]},"announce":[],"urlList":[]}}