{"title":"John Barleycorn Reborn .V.A(2007)[FLAC]","uid":6833438,"size":924630976,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:efb8707ad267c85a15bf5bb8c11c1a9113b10792&amp;dn=John+Barleycorn+Reborn+.V.A%282007%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":42,"time":1321944147,"description":" &lt;a href=&quot;http://img7.imageshack.us/img7/6885/r10704371189861452.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img7.imageshack.us/img7/6885/r10704371189861452.jpg&lt;/a&gt;\n\nJohn Barleycorn Reborn: Dark Britannica [2007] Cold Spring / CSR84CD\n\n\n1-01. The Horses Of The Gods - John Barleycorn (3:56)\n1-02. The Owl Service - North Country Maid (2:40)\n1-03. The Story - The Wicker Man (2:31)\n1-04. Damh The Bard - Spirit Of Albion (4:16)\n1-05. Mary Jane - Twa Corbies (5:14)\n1-06. Andrew King - Dives And Lazarus (6:30)\n1-07. The Triple Tree - Three Crowns (5:38)\n1-08. Sol Invictus - To Kill All Kings (5:01)\n1-09. Sieben - Ogham On The Hill (Remix) (4:04)\n1-10. Sharron Kraus - Horn Dance (3:31)\n1-11. Charlotte Greig, Johan Asherton - Lay The Bent To The Bonny Broom (7:55)\n1-12. Pumajaw - The Burning Of Auchindoun (5:44)\n1-13. Peter Ulrich - The Scryer &amp; The Shewstone (5:07)\n1-14. Alphane Moon - Where The Hazel Grows (4:31)\n1-15. English Heretic - Hippomania (6:51)\n1-16. Far Black Furlong - Icy Solstice Eye (3:28)\n2-01. The Anvil - John Barleycorn Must Die (4:37)\n2-02. Tinkerscuss - To Make You Stay (2:55)\n2-03. The Straw Bear Band - Trial By Bread &amp; Butter (3:37)\n2-04. Electronic Voice Phenomena - The Sorrow Of Rimmon (3:56)\n2-05. The Purple Minds Of Lazeron - Dragonfly (4:21)\n2-06. Sand Snowman - Stained Glass Morning (5:56)\n2-07. The A. Lords - Summerhouse (5:11)\n2-08. Kitchen Cynics - The Guidman's Ground (4:19)\n2-09. Quickthorn - PewPew (2:33)\n2-10. Clive Powell - Reed Sodger (4:20)\n2-11. Venereum Arvum - Child 102 Willie And Earl Richard's Daughter (7:33)\n2-12. Drohne - Nottamun Town (6:55)\n2-13. Stormcrow - Gargoyle (6:16)\n2-14. Doug Peters - Pact (4:21)\n2-15. While Angels Watch - Obsidian Blade (5:07)\n2-16. Xenis Emputae Travelling Band - John Barleycorn: His Life, Death And Resurrection (4:51)\n2-17. Martyn Bates - The Resurrection Apprentice (2:31)\n\nObjectivity be damned, it just can't be done! When presented with a collection of tracks dubbed Dark Britannica, sorry, but all pretence at neutrality must be abandoned. This is certainly at least one of the best collections of the year, and a unique experiment that succeeds superbly.\n\nBrought to you by Woven Wheat Whispers, John Barleycorn Reborn's remit of dark traditional and tradition-based British music does not necessarily focus on negativity and gloom as the wording might suggest. It is more an exploration of the less &quot;pretty&quot; side of the genre, with no attempts at expurgation and a freedom for the musicians to express that side of the music and themselves. As a result, the set contains a great variety of arrangements from acoustic to folk rock to electronica and beyond, and a combination of ancient and newly written material that fits together easily.\n\nOne of the few negatives of the set is that the actual writers of each track aren't directly credited, so in some cases it's hard to be sure if the song is old or new. The downloadable cover notes sometimes do give this information in the blurb for a track, but this can involve a bit of a search as opposed to having the information simply credited along with the title. Still, maybe it's a good thing to just let this timeless music speak for itself in that sense.\n\nTo do any sort of track-by-track analysis would keep us all here for hours, so perhaps I'll expand more generally. I kept notes as I listened through the whole set and the first thing to say is that at no time did it seem a chore to listen to so many songs a number of times; in fact it helped many of them become favourites more quickly. It's also interesting that although I had never heard of 99 percent of the performers before, it made absolutely no difference to the enjoyment of the recordings, as well it shouldn't! A lot of the material itself is maybe not the expected fare (no 'Tam Lin' for example), which may or may not show an intention to focus on the lesser-known songs, but it also proves the abundance of music in the genre in the first place. Not to mention its flexibility in withstanding the various interpretations that different artists place upon it.\n\nThe obvious inclusion is the almost-title track 'John Barleycorn', which appears in a few different forms. The first version by The Horses Of The Gods begins the entire set, with a foreboding and arresting arrangement that sets the scene well. The second version by The Anvil has quite a different feel, more melodic with distorted guitar and menacing overtones.\n\nIn overall terms, each disc is on a particular theme. Disc The First focuses on birth, though there is still plenty of death on display in, for example, Mary Jane's wonderful folk rock rendition of 'Twa Corbies', and 'To Kill All Kings' by Sol Invictus, which is more electronic folk though still traditional-sounding. Again and as is often the case throughout, &quot;menacing&quot; seems an appropriate description, too. Other highlights include the rousing 'Spirit Of Albion' by Damh The Bard and the downright spooky 'Hippomania' from English Heretic, another electronic piece with threatening drums, violin and electric guitar.\n\nA number of the songs have a medieval feel with instruments to match, such as Sharron Kraus' 'Horn Dance' and Peter Ulrich's 'The Scryer and The Shrewstone', the latter being a story song featuring recorder and crumhorn in a creative arrangement. It's unfair to omit any particular track because, even though there is wide variety in musical approach and even recording quality, there is not one piece that makes me want to skip it on first or subsequent listening. However, let's move on regardless.\n\nThe theme of Disc The Second is death. It is British traditional music after all, so the subject is an obvious and appropriate one. This also features a recording of the title track, but quite different from the others. 'John Barleycorn: His Life, Death &amp; Resurrection' as performed by Xenis Emputae Travelling Band (AKA Phillip Legard) has a different tune, and the arrangement of three voices and percussion leading into a mysterious-sounding mix of accordion, acoustic guitar and percussion is unique.\n\nThe mix of styles continues from Disc 1, ranging from the gentle, flowing 'To Make You Stay' by Tinkerscuss (with gorgeous vocals and almost a Pentangle feel to it) to the thundering folk rock of Obsidian Blade's 'While Angels Watch'. 'Nottamun Town' by Drohne is perhaps a more obvious choice of song, but again the arrangement is unexpected -- contemporary, electronic and foreboding, with some hurdy gurdy and a bit of folk/rap included for good measure! One of my personal highlights of the volume.\n\nRecorders feature on a couple of tracks: Sand Snowman's 'Stained Glass Morning', an attractive acoustic song with melodic female vocals and a classic sort of Incredible String Band sound, and 'PewPew' by Quickthorn, a slower piece with two recorders in counterpoint, along with hammer dulcimer and laconic vocals, adding up to a sparse, medieval sound.\n\nThere are 17 songs in all on disc two, and although there are a few that I don't see necessarily fitting into the death theme, they all work together well. The final track by Martyn Bates is an evocative instrumental recorded exclusively for the set.\n\nThe set is given the following general description: &quot;An exploration of the seasons and their turning through the birth, death and rebirth of John Barleycorn, as observed in the fields, grain and ale.&quot; The story of Barleycorn, a personification of the process of turning barley into ale, contains all the sort of mystery and danger that informs a lot of the tracks on John Barleycorn Reborn; not least his arising from death and misfortune to have the last laugh.\n\nThese CDs are designed not just as an enjoyable listening experience, as if that wasn't enough, but as a call to arms to those who celebrate Dark Britannica to come into the light and reclaim their place in the world. If the end result brings the overall feel of this music to the wider world, with the attendant embracing of the mysterious spirituality inherent in life, then bring it on!\n\ncd  ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/about/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/about/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:efb8707ad267c85a15bf5bb8c11c1a9113b10792","amp;dn":"John+Barleycorn+Reborn+.V.A%282007%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efb8707ad267c85a15bf5bb8c11c1a9113b10792","infoHashBuffer":{"type":"Buffer","data":[239,184,112,122,210,103,200,90,21,191,91,184,193,28,26,145,19,177,7,146]},"announce":[],"urlList":[]}}