{"title":"Stop Wasting Your Time Blaming Others for Your Life","uid":13440801,"size":442909,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f017d45c159ca146fef54ae033a406d28c6f40cb&amp;dn=Stop+Wasting+Your+Time+Blaming+Others+for+Your+Life&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1454701126,"description":"Are you facing a difficult situation and don’t know how to get unstuck or move forward? \r\nDo you feel limited by your past or current circumstance? \r\nDo you want to make a change in your life, but don’t how or where to start? \r\n\r\nStop Wasting Your Time Blaming Others for Your Life will help you overcome difficult situations, live beyond your labels and limitations, and take full responsibility for your Life, Relationships, and Career! \r\n\r\nAdvice columnist and personal success coach, Tamara Hartley, shares her personal life stories and lessons learned to help others get unstuck and move forward in their lives. Known for her candid and transparent style, Tamara is not afraid to talk about and openly share the real-life issues and sticky situations that many people face. \r\n\r\nTamara has dealt with obstacles, setbacks, and wore many of society’s labels. From being a teenage mother; a single parent raising four children; being married, separated, and divorced; to balancing a career, family, and education. She knows first-hand what it’s like to feel stuck, stagnant, and unsure of the next move. Tamara is a living witness that it is possible to overcome any circumstance to achieve personal success and live the life of your dreams. \r\n\r\nStop Wasting Your Time Blaming Others for Your Life will help you overcome difficult situations, live beyond your labels and limitations, and take full responsibility for your Life, Relationships, and Career! \r\n\r\nThis interactive book and workbook are designed to help readers embrace their journey and take responsibility for their results. At the end of each chapter is an opportunity for readers to reflect on areas of their life and make new and better choices that move them closer to their goals and the life of their dreams","torrent":{"xt":"urn:btih:f017d45c159ca146fef54ae033a406d28c6f40cb","amp;dn":"Stop+Wasting+Your+Time+Blaming+Others+for+Your+Life","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f017d45c159ca146fef54ae033a406d28c6f40cb","infoHashBuffer":{"type":"Buffer","data":[240,23,212,92,21,156,161,70,254,245,74,224,51,164,6,210,140,111,64,203]},"announce":[],"urlList":[]}}