{"title":"[SoM]Scoprendo Forrester[DvdRip-Divx4-Ita-Mp3]","uid":4402467,"size":904148102,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f10b64ff9988d457ee307071f2a727106231f8f9&amp;dn=%5BSoM%5DScoprendo+Forrester%5BDvdRip-Divx4-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1221773456,"description":"Jamal Wallace ÃƒÂ¨ uno studente del Bronx con una grande passione per la letteratura e un altrettanto grande amore per il basket. Casualmente entra in contatto con William Forrester, uno scrittore che vinse il Premio Pulitzer con l&amp;#039;unico libro pubblicato. Era poi scomparso e nessuno ne aveva saputo piÃƒÂ¹ nulla. A lui, che diviene il suo maestro, Jamal sottopone un racconto che viene giudicato positivamente. Il ragazzo ha ricevuto un&amp;#039;offerta di borsa di studio da una prestigiosa istituzione privata. Ma c&amp;#039;ÃƒÂ¨ un ostacolo: il docente di letteratura trova il suo testo troppo pregevole e non crede che un ragazzo del Bronx possa arrivare a tanto. Pertanto ÃƒÂ© meglio che resti al suo posto e pensi al basket. Nel frattempo anche Forrester trova un aiuto in Jamal. Riesce a uscire di nuovo dall&amp;#039;appartamento in cui si era autorecluso. Il ragazzo perÃƒÂ² non riesce a risollevare le sorti della propria squadra e tutto sembra risolversi negativamente quando... Gus Van Sant mantiene fermo il proprio sguardo sugli individui al margine e sulle etÃƒÂ  di passaggio. Questa volta lo fa con alle spalle un produttore/attore decisamente straordinario: Sean Connery. Il regista non solo non esaspera i toni ma sottolinea la propria continuitÃƒÂ  autoriale con un cameo affidato a Matt Damon.  Will Hunting ÃƒÂ¨ ancora presente cosÃƒÂ¬ come sono realmente presenti nel mondo ragazzi dotati che avrebbero ancora una voglia che il luogo comune dÃƒÂ  per ormai estinta: quella di studiare per migliorarsi.","torrent":{"xt":"urn:btih:f10b64ff9988d457ee307071f2a727106231f8f9","amp;dn":"%5BSoM%5DScoprendo+Forrester%5BDvdRip-Divx4-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f10b64ff9988d457ee307071f2a727106231f8f9","infoHashBuffer":{"type":"Buffer","data":[241,11,100,255,153,136,212,87,238,48,112,113,242,167,39,16,98,49,248,249]},"announce":[],"urlList":[]}}