{"title":"Miley Cyrus - Bangerz [24bit FLAC] vinyl","uid":11367967,"size":739923657,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f12f56b0612de107579aef671bbc43638e1f5438&amp;dn=Miley+Cyrus+-+Bangerz+%5B24bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1415060909,"description":"\n  Miley Cyrus - Bangerz [24bit FLAC] vinyl\n\n  Genre: Pop\n  Style: Dance\n  Source: 2013 RCA Records 88883-79261-1 Deluxe Edition LP\n  Codec: FLAC\n  Bit rate: ~ 1,500 \n  Bit depth: 24\n  Sample rate: 48 kHz\n\n  A1 Adore You 4:38 \n  A2 We Can't Stop 3:51 \n  A3 SMS (Bangerz) 2:49 \n  A4 4x4 3:11 \n  B1 My Darlin' 4:03 \n  B2 Wrecking Ball 3:41 \n  B3 Love Money Party 3:39 \n  B4 #Getitright 4:24 \n  C1 Drive 4:15 \n  C2 FU 3:51 \n  C3 Do My Thang 3:45 \n  C4 Maybe You're Right 3:33 \n  D1 Someone Else 4:48 \n  D2 Rooting For My Baby 3:20 \n  D3 On My Own 3:52 \n  D4 Hands In The Air 3:22 \n\n  Rip info (not my rip)\n\n  Kenwood KD-65F Full Automatic Linear Tracking Turntable\n  Audio Technica 1001 Needle And Cartridge\n  Numark PPD DM1750RM Preamp / Mixer\n  Creative Sound Blaster Audigy SE 5.1 24 Bit Sound Card\n\n  Review\n\n  After the release of Can't Be Tamed, Miley Cyrus took a break from singing and focused on her film career for a few years, allowing her to make a big comeback to music at the tender age of 20. Like so many Disney starlets, Cyrus needed to distance herself from her tween pop past; Can't Be Tamed tiptoed toward a more adult persona, but Bangerz kicks down the doors. This is her first non-Disney album, and in many ways it feels like a debut, an R&amp;B and hip-hop-tinged coming-out party that introduces Miley as an A-list pop star. Bangerz's guest list is packed with star producers, including Pharrell Williams and Mike WiLL Made It, and vocalists like Britney Spears, who cameos on the fizzy &quot;SMS (Bangerz).&quot; Cyrus has taken cues from more established pop stars in the past -- Can't Be Tamed often evoked Ke$ha -- but one of the models for this album is clearly Rihanna. Miley's summer 2013 hit &quot;We Can't Stop&quot; was even originally offered to Rihanna, and they share a nasally buzz in their singing and a commitment to partying in their songs (if possible, &quot;Love Money Party&quot; sounds even more like a Rihanna-be than &quot;We Can't Stop&quot;). Bangerz's take on R&amp;B is most convincing when it's balanced with Cyrus' country and pop roots, as on the Pharrell productions &quot;4x4,&quot; an improbable but entertaining piece of country-rap featuring Nelly, and &quot;#GETITRIGHT,&quot; which is so bouncy it almost sounds innocent despite Miley's insistence that she wants to be naughty. Cyrus and company also spend plenty of time sampling other early-2010s trends, whether it's the wobbly, dubstep-like synths on &quot;Drive&quot; or the EDM-leaning ballad &quot;Someone Else,&quot; but on every track, she sounds more mature than ever before. Despite its flashier moments, there are also plenty of ballads, something hinted at by the album's second single, &quot;Wrecking Ball.&quot; Bangerz even opens with a slow song (the unabashedly romantic &quot;Adore You&quot;), which in its own way is almost as bold a move as the publicity events that preceded the album's release. Brassy empowerment jams like &quot;Maybe You're Right,&quot; &quot;Do My Thang,&quot; and &quot;FU&quot; sell Cyrus as an independent woman, and the album accomplishes that mission: Bangerz transforms Miley into a pop star who won't -- and can't -- be ignored as she rings in her twenties","torrent":{"xt":"urn:btih:f12f56b0612de107579aef671bbc43638e1f5438","amp;dn":"Miley+Cyrus+-+Bangerz+%5B24bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f12f56b0612de107579aef671bbc43638e1f5438","infoHashBuffer":{"type":"Buffer","data":[241,47,86,176,97,45,225,7,87,154,239,103,27,188,67,99,142,31,84,56]},"announce":[],"urlList":[]}}