{"title":"DVD Photo Slideshow Pro 7.96-serial incl","uid":4628766,"size":25629559,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f1a2a25b6fc98fb0435ceab46245e8987d38d2fe&amp;dn=DVD+Photo+Slideshow+Pro+7.96-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmb2012","files":2,"time":1231311076,"description":"DVD Photo Slideshow Pro description\t \n\n \n\nSupports over 260 amazing transition effects with better Pan &amp; Zoom effect and better anti-flickering filter.\n\nThis software allows you to create entertaining photo slideshows you can watch on TV with the help of your DVD or CD burner. With one click, DVD Photo Slideshow creates an exciting photo slide show complete with music, motion menus and transition effects. \n\nWith DVD Photo Slideshow you can quickly and easily produce professional-looking photo slideshow DVD disc and share the slide show on home big screen TV with standard DVD player in the comfort of your living room. \n\nWith a few minutes of work, you'll have an eye-catching slide show that will run on nearly any DVD players. \n\nDVD Photo Slideshow Pro supports DVD, SVCD and VCD 2.0 as the output disc format, supports over 260 amazing transition effects with better Pan &amp; Zoom effect and better anti-flickering filter, supports adding background music directly from music CD and adding text Macro such as photo album name, photo file name, date, etc. \n\nDVD Photo Slideshow Pro also supports sub-title and Art-clips for each photo slide which adds amazing special effects for the slideshow. \n\nHere are some key features of &quot;DVD Photo Slideshow Pro&quot;:\n\nÃ‚Â· Designed to be easy enough for anyone in the family to use \nÃ‚Â· High quality DVD output : photo or picture look great on TV \nÃ‚Â· Support designing your own Hollywood-style video and motion menus \nÃ‚Â· Decorate your photos with your own text, art clips \nÃ‚Â· Customize transition effects, Pan &amp; Zoom for individual slide \nÃ‚Â· Support amazing SWF Flash album themes, titles and credits for slideshow \nÃ‚Â· All-in-One: Photo editing, Creating slide show with music, Burning DVD disc.\n\n\n\nWhat's New in This Release: [ read full changelog ]\n\nÃ‚Â· Adds time hint on previewing title and credit of album.\nÃ‚Â· Fixed error of burning VCD 2.0 still image.\nÃ‚Â· Fixed error of burning DVD disc occasionally.\nÃ‚Â· Fixed others minor bugs.\n\n\nWin/All","torrent":{"xt":"urn:btih:f1a2a25b6fc98fb0435ceab46245e8987d38d2fe","amp;dn":"DVD+Photo+Slideshow+Pro+7.96-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1a2a25b6fc98fb0435ceab46245e8987d38d2fe","infoHashBuffer":{"type":"Buffer","data":[241,162,162,91,111,201,143,176,67,92,234,180,98,69,232,152,125,56,210,254]},"announce":[],"urlList":[]}}