{"title":"FantasyMassage - Cassidy Klein (A Soapy Massage)","uid":12957726,"size":298974639,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f1f5633c0ee323a96612d913ee0d7e9eaf067366&amp;dn=FantasyMassage+-+Cassidy+Klein+%28A+Soapy+Massage%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EndYou","files":1,"time":1449806603,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/ud\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Cassidy Klein\r\nName movie: A Soapy Massage\r\nNPP site and the site: FantasyMassage.com\r\n\r\nYear: 2015\r\nGenre: Kissing, Pussy Licking, Close Up, Brunette, Shower, Handjob, Blowjob, Hardcore, Foot Massage, Natural Tits, Massage, Bath, Bubble Butt, Cum on Pussy, Pilots\r\nDuration: 00:29:31\r\n\r\nIt's Cassidy Klein and Derrick Pierce's wedding anniversary, and Derrick wants to make something special out of it. Unfortunately, Cassidy does not feel like going through the whole same sex routine; Derrick pumping her wet pussy for a few minutes, cumming then hoping in the shower ... She needs more than just a quick fix, regardless of their anniversary, she just is not into it. Derrick tires to figure out what he can do to please his wife, she suggests having sex in the shower, since they've never done it before. Derrick knows what he needs to do in order to sexually fulfill his wife beyond her wildest expectations.\r\n\r\nDerrick fills the bathtub with warm water and bubbles, lighting romantic candles; a scene fit for a queen. He calls her in to the bathroom, promising her an evening of pampering and bliss, including a massage in the shower and bathtub. Cassidy is without words, blown away at Derrick's efforts to make her feel more than special. This is going to be an anniversary they will never forget!\r\n\r\nThe lovers undress, and Derricks sweeps Cassidy off of her feet, carrying her away into the shower. He lathers her exquisite boobs and ass, massaging every inch of her body. Her sexuality rises as she can not control herself but to touch Derrick's hard cock and latch onto it with her mouth. But it is her day today, as Derrick leads her towards the bathtub, pampering her back, feet and most importantly, her pussy. Cassidy climbs onto Derrick's cock, ridding his stiff rod, moaning in pleasure, dripping wet from her multiple orgasms.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 960x544 (16: 9) 29.97fps 1149kbps\r\nAudio: AAC 44100Hz stereo 192kbps","torrent":{"xt":"urn:btih:f1f5633c0ee323a96612d913ee0d7e9eaf067366","amp;dn":"FantasyMassage+-+Cassidy+Klein+%28A+Soapy+Massage%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1f5633c0ee323a96612d913ee0d7e9eaf067366","infoHashBuffer":{"type":"Buffer","data":[241,245,99,60,14,227,35,169,102,18,217,19,238,13,126,158,175,6,115,102]},"announce":[],"urlList":[]}}