{"title":"Flannery O'Connor - The Habit of Being (pdf)","uid":8664865,"size":4967618,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2afcc247c0f3cfe9a884e5a85585fa2aeb93227&amp;dn=Flannery+O%27Connor+-+The+Habit+of+Being+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373392248,"description":"Flannery O'Connor - The Habit of Being (Farrar, Straus and Giroux, 1979). 617 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nBig collection of Flannery O'Connor's letters. An essential book.\n\n\ndescription:\n\nWinner of the National Book Critics Circle Special Award\n\n&quot;I have come to think that the true likeness of Flannery O'Connor will be painted by herself, a self-portrait in words, to be found in her letters . . . There she stands, a phoenix risen from her own words: calm, slow, funny, courteous, both modest and very sure of herself, intense, sharply penetrating, devout but never pietistic, downright, occasionally fierce, and honest in a way that restores honor to the word.&quot; - Sally Fitzgerald, from the Introduction\n\n\nReview\n\n&quot;To compare her with the great letter writers in our language may seem presumptuous and would have elicited from her one of her famous steely glances, but Byron, Keats, Lawrence, Wilde and Joyce come irresistibly to mind: correspondence that gleams with consciousness.&quot;\n\n--The New York Times\n \n\n&quot;These hundreds of letters give O'Connor's tough, funny, careful personality to us more distinctly and movingly than any biography probably would... Remarkable and inspiring.&quot;\n\n--Kirkus Reviews\n\n\nAbout the Author\n\nFlannery O'Connor was born in Savannah, Georgia, in 1925. When she died at the age of thirty-nine, America lost one of its most gifted writers at the height of her powers. O'Connor wrote two novels, Wise Blood (1952) and The Violent Bear It Away (1960), and two story collections, A Good Man Is Hard to Find (1955) and Everything That Rises Must Converge (1964). Her Complete Stories, published posthumously in 1972, won the National Book Award that year, and in a 2009 online poll it was voted as the best book to have won the award in the contest's 60-year history. Her essays were published in Mystery and Manners (1969). In 1988 the Library of America published her Collected Works; she was the first postwar writer to be so honored. O'Connor was educated at the Georgia State College for Women, studied writing at the Iowa Writers' Workshop, and wrote much of Wise Blood at the Yaddo artists' colony in upstate New York. She lived most of her adult life on her family's ancestral farm, Andalusia, outside Milledgeville, Georgia.","torrent":{"xt":"urn:btih:f2afcc247c0f3cfe9a884e5a85585fa2aeb93227","amp;dn":"Flannery+O%27Connor+-+The+Habit+of+Being+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2afcc247c0f3cfe9a884e5a85585fa2aeb93227","infoHashBuffer":{"type":"Buffer","data":[242,175,204,36,124,15,60,254,154,136,78,90,133,88,95,162,174,185,50,39]},"announce":[],"urlList":[]}}