{"title":"Bible Stories for Children #1 - MP3 version","uid":4693277,"size":734474295,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f2eac8ca9e8b1df44952c4ced0fbfb4c4ed33327&amp;dn=Bible+Stories+for+Children+%231+-+MP3+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ruthchiun","files":24,"time":1233468875,"description":"Bible Stories (Dramatized) for children.  To purchase the tapes or CDs, please visit the following website: &lt;a href=&quot; http://yourstoryhour.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://yourstoryhour.org/&lt;/a&gt;\n\nThis is the MP3 format.\n\n\nThis is the first series which contain the following stories:\n\nAdam and Eve:  Adam and Eve.  This is the story of creation and the fall of man.\n\nCain &amp; Abel and The Man Who Believed What God Said (Part 1):  Cain &amp; Able.  The story of the world's first murderer.   \n\nCain &amp; Abel and The Man Who Believed What God Said (Part 1):  The Man Who Believed What God Said (Part 1)  Noah and the flood.\n\nThe Man Who Believed What God Said (Part 2):  The Man Who Believed What God Said (Part 2).  The completion of the story of Noah and the flood.\n\nThe Temple Tower:  The Temple Tower.  The story of construction and destruction of the Tower of Babel.\n\nThe Call of Abraham:  The Call of Abraham.  God calls Abraham to leave Ur and leads him to a new land.\n\nThe Three Strangers:  The Three Strangers.  Abraham receives a visit from heavenly messengers.\n\nSodom:  Sodom.  The story of Sodom and Gomorrah and how the angles go to save Lot's family.\n\nThe Supreme Test:  The Supreme Test.  Abraham is asked to sacrifice his son Isaac.\n\nThe Strange Romance:  The Strange Romance.  Abraham sends his servant to find a wife \nfor his son Isaac.\n\nThe Unlike Twins:  The Unlike Twins.  Isaac and Rebecca have twin boys, Esau and Jacob.  Jacob takes Esau's birthright by deception.\n\nThe Cheating Twin Cheated:  The Cheating Twin Cheated.  Jacob flees from Esau and works for his uncle Laban.  Jacob is tricked into marrying Leah.  Jacab also marries Rachel.\n\nThe Mystery of the Disappearing Idols:  The Mystery of the Disappearing Idols.  Jacob decides to leave Laban's camp and take his family back to Canaan.  Before they leave camp Rachel steals her father's idols.\n\nThe Case of the Wrestling Twin:  The Case of the Wrestling Twin.  Jacob is distressed about meeting his brother Esau.  He spends the night in prayer and wresling with an Angel. \n\nThe Coat Of Many Colors:  The Coat of Many Colors.  Jacob play favorites with his sons.  This causes jealousy between Joseph and his brothers and they sell Joseph as a slave.\n\n\nMrs. Potiphar and the Dungeon:  Mrs. Potiphar and the Dungeon.  Joseph, now a slave in Egypt, is accused of something he did not do and is thrown in prison.\n\nThe King's Butler and the King's Baker:  The King's Butler and the King's Baker.  Joseph, now in prison, interprets the dream of two fellow prisoners.\n\nThe King and the Slave:  The King and the Slave.  After interpreting Pharaoh's dream, Joseph is made prime minister of Egypt.\n\nThe Unreasonable Prime Minister:  The Unreasonable Prime Minister.  Joseph's brother's go to Egypt to buy food during the famine.\n\nThe Governor's Mysterious Feast:  The Governor's Mysterious Feast.  Joseph plans a feast for his brother's.\n\nThe Long Delayed Reunion:  The Long Delayed Reunion.  Joseph is finally reunited with his father.\n\nA Deliverer is Born:  A Deliverer is Born.  This story begins with Moses' birth, his discovering by the princess.\n\nMoses Fulfills His Destiny:  Moses Fulfills His Destiny.  The Lord calls Moses to service for Him.\n\nThe King with the Heart of Stone:  The King with the Heart of Stone.  Pharaoh will not let the Isrealites go to worship in the wilderness so God sends plagues to Egypt.\n\nMiracles by the Sea:  Miracles by the Sea.  Moses is now leading the Isrealites to the promise land with the Egyptians following.  God parts the Red Sea.\n\n\n\nHope your family enjoys them as much as mine does.","torrent":{"xt":"urn:btih:f2eac8ca9e8b1df44952c4ced0fbfb4c4ed33327","amp;dn":"Bible+Stories+for+Children+%231+-+MP3+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2eac8ca9e8b1df44952c4ced0fbfb4c4ed33327","infoHashBuffer":{"type":"Buffer","data":[242,234,200,202,158,139,29,244,73,82,196,206,208,251,251,76,78,211,51,39]},"announce":[],"urlList":[]}}