{"title":"Call - In paradisum Pieter Jan Leusink, dirigent   Juultje TBS","uid":6412834,"size":4689527061,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f3314cbf807488a69a0ed25c95df2214d47fc355&amp;dn=Call+-+In+paradisum+Pieter+Jan+Leusink%2C+dirigent+++Juultje+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"juutje","files":-1,"time":1306057000,"description":"Call - In paradisum\n\n\nCALL\nThe Bach Orchestra of the Netherlands\nAndrÃƒÂ© Pouwer, piano\nPieter Jan Leusink, dirigent \n\n\nDe eerste DVD en CD opname van CALL is spectaculair en enerverend. De audio opnamen werden gemaakt in de beroemde POWER SOUND STUDIOS in Amsterdam. Arrangementen met groot orkest zijn gemaakt door top arrangeur AndrÃƒÂ© Pouwer. In september werden beelden gemaakt rondom het meer van Bolsena in ItaliÃƒÂ«. Decor: de eeuwenoude steden: Montefiascone, Tuscania, Bagnoregio en het meer van Bolsena. Centraal staat de unieke Santa Maria della Rosa kerk uit 900 na Christus.  \n\nKlassieke toppers zoals het beroemde Air van Bach, Ave verum van Mozart, Sanctus en In Paradisum uit het Requiem van Gabriel FaurÃƒÂ© en Ave Maria van Schubert door de mannen van CALL. Sacrale uitvoeringen van het Ave Maria van Caccini door Resie Vahsen en Martinus Leusink. Erna Hemming, Soundmixshow winnares brengt een bijzondere vertolking van Gabriellas Sang uit de film 'As it is in heaven'. Speciaal: Olga Zinovieva zingt in het water van het meer van Bolsena bij ondergaande zon de wereldberoemde Vocalise van Rachmaninoff. Populaire Songs o.a.: het Keltische Scarborough Fair en Orinoco Flow van Enya. Resie, Olga, Erna, Marjolein, Martinus, Ferdinand, Jelle, Arjan, Jaap, Reinhardt en Herjan zullen u verrassen!\n\nEnglish\n\nThe first DVD and CD recording of CALL is spectacular and exciting. The audio recordings were made ??in the famous POWER SOUND STUDIOS in Amsterdam. Arrangements were made ??with a large orchestra by top arranger Andre Pouwer. In September, imaged around Lake Bolsena in Italy. Decor: the ancient cities: Montefiascone, Tuscania, Bagnoregio and Lake Bolsena. Central to the unique church of Santa Maria della Rosa 900 AD.\n\nClassical famous celebrities such as the Air by Bach, Ave Verum by Mozart, Sanctus and In Paradisum from Requiem by Gabriel FaurÃƒÂ© and Schubert Ave Maria by the men of CALL. Sacred versions of the Ave Maria by Caccini Resie VAHS and Martinus Leusink. Erna Hemming, Soundmixshow winner brings a special rendition of Gabriellas Sang from the film &quot;As It Is In Heaven '. Special: Olga Zinovieva sings in the water of Lake Bolsena at sunset the famous Vocalise by Rachmaninov. Popular Songs include: Scarborough Fair Celtic and Orinoco Flow by Enya. Resie, Olga, Erna, Marjoram, Martinus Ferdinand, Jelle, Arjan, Jaap, Reinhardt Herjan will surprise you!\n &lt;a href=&quot;\nhttp://www.pieterjanleusink.nl/nl/nieuws.asp?administratieID=285&amp;menu=dvdinparadisum1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pieterjanleusink.nl/nl/nieuws.asp?administratieID=285&amp;menu=dvdinparadisum1&lt;/a&gt;\n\n\n\nTracklist:\n1 Ave Maria - Fr. Schubert\n2. Air - J.S. Bach\n3. Agnus Dei - G. Puccini\n4. Vocalise - S. Rachmaninoff\n5. Ave verum - W.A. Mozart\n6. Ave Maria - G. Caccini\n7. Sanctus - G. Faure\n8. Pie Jesu - G. Faure\n9. In Paradisum - G. Faure\n10.Blowing in the Wind\n11.Gabriellas Sang\n12.O mio Babbino - G. Puccini\n13.Scarborough Fair - Welsh Folksong\n14.Swing low, sweet Chariot - Spiritual\n15.You were there\n16.Nothing Compares 2U\n17.Orinoco Flow\n\n \t\n Category\t:\tVideo\n Format\t:\tDVD5\n Source\t:\tRetail\n Subtitle\t:\tNo Subs\n Genre\t:\tMusic \t\t \t \t\t\n Size\t:\t4.73 GB\n\n[IMG]http://i845.photobucket.com/albums/ab16/hortencia9/plaatjes%20film/1175816490_www-animaatjes-nl.gif[/IMG]\n\nEnjoy The Music\n \t\n","torrent":{"xt":"urn:btih:f3314cbf807488a69a0ed25c95df2214d47fc355","amp;dn":"Call+-+In+paradisum+Pieter+Jan+Leusink%2C+dirigent+++Juultje+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3314cbf807488a69a0ed25c95df2214d47fc355","infoHashBuffer":{"type":"Buffer","data":[243,49,76,191,128,116,136,166,154,14,210,92,149,223,34,20,212,127,195,85]},"announce":[],"urlList":[]}}