{"title":"[1080p].HandsOnHardcore - Beata Undine","uid":7498271,"size":2123387074,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f42eb94daec10e2ee7e491a303c792c7e8030717&amp;dn=%5B1080p%5D.HandsOnHardcore+-+Beata+Undine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kelvin09","files":1,"time":1343941928,"description":"HandsOnHardcore - Beata Undine (Meeting the Trouser Monster!)\n\n   &lt;a href=&quot;\nhttp://www.picrak.com/viewer.php?file=95917835696267166232.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picrak.com/viewer.php?file=95917835696267166232.jpg&lt;/a&gt;\n\n   &lt;a href=&quot;\nhttp://www.picrak.com/viewer.php?file=09958252064115605451.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picrak.com/viewer.php?file=09958252064115605451.jpg&lt;/a&gt;\n\n\nBeata Undine is in for a very large treat at the end of her pleasant date with Ian Scott! Taking her back to his apartment, he gets the well-read, academically inclined young lady (she's studying the Greek and Roman classics at college) into the mood for lovin' by showing her a book of erotic stories from the nineteenth century, a volume that has been passed down in his family from grandfather to father to son...or rather, we should say, from stud to stud to stud! Because what was also passed down to Ian was a genetic inheritance of studhood, i.e. a gigantic pecker, which Beata discovers to her delight once the book is put aside and she extracts the already throbbing and stiffened phallus from IanÎ“Ã‡Ã–s shorts! It fills the hands of the scholarly and bespectacled girl with delight, as she licks the tip and takes it into her mouth. Standing up, the pair kiss as Beata continues to stroke his trouser monster...yes, thatÎ“Ã‡Ã–s the phrase, she thinks, Î“Ã‡Â£trouser monster,Î“Ã‡Â¥ but itÎ“Ã‡Ã–s something she uses affectionately indeed as she lays him back on the bed and kneels before the altar of his incredible dick, the kind of penis she and her girlfriends back in the dormitory often fantasized about but never hoped to meet. Or &quot;meat!!&quot; she puns to herself with naughty satisfaction. Finally she takes off her glasses as she prepares the sausage with her mouth for its imminent entry into her lucky snatch. Beata straddles IanÎ“Ã‡Ã–s crotch and rubs her mound against his pulsing prick, then she lifts it up and slides it into her hole. What bliss! Ohmigosh heÎ“Ã‡Ã–s so thick and not only that, so good with this damn thing! He lifts her up and fucks her against the wall, then he gets her in doggie style and powers into her pie from behind. Every hot inch of his ravishing rod fills her not only with physical delight, but the kind of excitement that goes into the emotional, spiritual, and mythic realms! This is like being mated with someone out of Greek mythology, something so huge! The words Î“Ã‡Â£fuck me fuck me fuck me!Î“Ã‡Â¥ donÎ“Ã‡Ã–t seem adequate to her emotions as he bangs her with all his enormous excellence, perhaps even spoiling her for other men! But that is the price a woman pays when she mates with someone whose endowment approaches that of a demigod! Î“Ã‡Â£Oh please I have to suck it more before it cums!Î“Ã‡Â¥ she cries, getting back on her knees for more face time, before riding it some more like the dirty cowgirl heÎ“Ã‡Ã–s made her into! She just canÎ“Ã‡Ã–t wait to receive all the lovely cum as it sprays out of that shaft!!","torrent":{"xt":"urn:btih:f42eb94daec10e2ee7e491a303c792c7e8030717","amp;dn":"%5B1080p%5D.HandsOnHardcore+-+Beata+Undine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f42eb94daec10e2ee7e491a303c792c7e8030717","infoHashBuffer":{"type":"Buffer","data":[244,46,185,77,174,193,14,46,231,228,145,163,3,199,146,199,232,3,7,23]},"announce":[],"urlList":[]}}