{"title":"The New American Militarism: How Americans Are Seduced by War [b","uid":8715549,"size":8178034,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4613a04ad8ad9f56db26cd5dd6417be23f6f277&amp;dn=The+New+American+Militarism%3A+How+Americans+Are+Seduced+by+War+%5Bb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1374280821,"description":"\n\nPublication Date: April 22, 2013 | ISBN-10: 0199931763 | ISBN-13: 978-0199931767 | Edition: Updated Edition\nIn this provocative book, Andrew Bacevich warns of a dangerous dual obsession that has taken hold of Americans, both conservatives and liberals alike. It is a marriage of militarism and utopian ideology, of unprecedented military might wed to a blind faith in the universality of American values. This mindset, Bacevich warns, invites endless war and the ever-deepening militarization of U.S. policy. It promises not to perfect but to pervert American ideals and to accelerate the hollowing out of American democracy.\n\nIn The New American Militarism, Bacevich examines the origins and implications of this misguided enterprise. He shows how American militarism emerged as a reaction to the Vietnam War, when various groups in American society -soldiers, politicians on the make, intellectuals, strategists, Christian evangelicals, even purveyors of pop culture-came to see the revival of military power and the celebration of military values as the antidote to all the ills besetting the country as a consequence of Vietnam and the 1960s. The upshot, acutely evident in the aftermath of 9/11, has been a revival of vast ambitions, this time coupled with a pronounced affinity for the sword. Bacevich urges Americans to restore a sense of realism and a sense of proportion to U.S. policy. He proposes, in short, to bring American purposes and American methods-especially with regard to the role of the military-back into harmony with the nation's founding ideals.\n\nFor this edition, Bacevich has written a new Afterword in which he considers how American militarism has changed in the past five years. He explores in particular how this ideology has functioned under Barack Obama, who ran for president on a campaign based on hope for change and for a new beginning. Despite such rhetoric, Bacevich powerfully suggests, the attitudes and arrangements giving rise to the new American militarism remain intact and inviolable as ever.\n\nAbout the Author\n\nAndrew J. Bacevich is Professor of History and International Relations at Boston University. A graduate of West Point and a Vietnam Veteran, he has a doctorate in history from Princeton and was a Bush Fellow at the American Academy in Berlin. He is the author of several books, including Washington Rules: America's Path to Permanent War, and the New York Times best-seller The Limits of Power.\n\n\nPaperback: 304 pages\nPublisher: Oxford University Press, USA; Updated Edition edition (April 22, 2013)\nLanguage: English\nISBN-10: 0199931763\nISBN-13: 978-0199931767\n\n &lt;a href=&quot;\nhttp://www.amazon.com/The-New-American-Militarism-Americans/dp/0199931763/ref=sr_1_1?ie=UTF8&amp;qid=1373811468&amp;sr=8-1&amp;keywords=new+american+militarism&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-New-American-Militarism-Americans/dp/0199931763/ref=sr_1_1?ie=UTF8&amp;qid=1373811468&amp;sr=8-1&amp;keywords=new+american+militarism&lt;/a&gt;\n\n\nTags: america, usa, united states, war, 3gw, 4gw, conventional, unconventional, sf, sfg, sog, pentagon, dod, perpetual war, military, militaristic, history, war studies, domestic policy, policy, public policy, war culture, security studies, conflict studies, conflict, study, unilateralism, superpower, global power, world politics, power politics, machtpolitik, iraq, afghanistan, pacific, atlantic, asia, europe, nato, anzus, Libya, Syria, Saddam, Hussein, Saddam Hussein, Bathist, post cold war, cool war, rebalance, rebalancing, pivot,","torrent":{"xt":"urn:btih:f4613a04ad8ad9f56db26cd5dd6417be23f6f277","amp;dn":"The+New+American+Militarism%3A+How+Americans+Are+Seduced+by+War+%5Bb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4613a04ad8ad9f56db26cd5dd6417be23f6f277","infoHashBuffer":{"type":"Buffer","data":[244,97,58,4,173,138,217,245,109,178,108,213,221,100,23,190,35,246,242,119]},"announce":[],"urlList":[]}}