{"title":"wizard of oz- oz 2 disc boxset xvids by winker@kidzcorner-1337x","uid":6035485,"size":1713696181,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f5aaf8754f3933f03b372ffd485220445a612e1a&amp;dn=wizard+of+oz-+oz+2+disc+boxset+xvids+by+winker%40kidzcorner-1337x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alanwatson","files":-1,"time":1292217779,"description":"&quot;We're Not In Kansas Anymore.&quot;\n\nWe click our heels in anticipation. There's no place like home and no movie like this one. From generation to generation, The Wizard Of Oz brings us together - kids, grown-ups, families, friends. The dazzling land of Oz, a dream-come--true world of enchanted forests, dancing scarecrows and singing lions, wraps us in its magic with one great song-filled adventure after another.\n\nBased on L. Frank Baum's treasured book series, The Wizard Of Oz was judged the best family film of all time by American Film Institute. And this never-before-seen restoration looks and sounds better than ever. We invite you to embark for the Emerald City on the most famous road in movie history. Dorothy (Judy Garland), Scarecrow (Ray Bolger), Tin Woodman (Jack Haley) and Cowardly Lion (Bert Lahr) await you on the Yellow Brick Road and &quot;Over the Rainbow.&quot;\n----------------------------------------\n\nreturn to oz\n\nAlthough the original one is a classic which everyone knows about this is still a very fun film to watch with some great new characters. There's Tick Tock, Jack Pumpkinhead and the Gump. Mombi still freaks me out with her head in the cabinet and the creepy Wheeler's. I think in some ways its better than the original but only because its not a musical so you don't get song every 10mins like the original. This film is defently underrated and I'm sure kids today will enjoy it.","torrent":{"xt":"urn:btih:f5aaf8754f3933f03b372ffd485220445a612e1a","amp;dn":"wizard+of+oz-+oz+2+disc+boxset+xvids+by+winker%40kidzcorner-1337x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5aaf8754f3933f03b372ffd485220445a612e1a","infoHashBuffer":{"type":"Buffer","data":[245,170,248,117,79,57,51,240,59,55,47,253,72,82,32,68,90,97,46,26]},"announce":[],"urlList":[]}}