{"title":"Jimi Hendrix Live At Woodstock (With Extras!) BluRay-MKV","uid":5872673,"size":6317709887,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f61e25daea1723213791f1cdb92a3a319acc0278&amp;dn=Jimi+Hendrix+Live+At+Woodstock+%28With+Extras%21%29+BluRay-MKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CrankJr","files":7,"time":1286512386,"description":"This is the Full BluRay Movie in MKV format &amp; Some DVD &quot;Extras&quot; on AVI ripped from the BluRay set. .. A real treat for Hendrix fans &amp; all Rock fans !!! ... It is BluRay but NOT in 16:9 aspect ratio since the original film was not shot that way but in more of a 4:3 aspect ratio. .. They appear to have shot the whole film (Interviews &amp; concert footage)in that same aspect for continuity etc. I guess. ...Otherwise, Video &amp; Sound quality is PRISTINE &amp; probably the next best thing to being there !!! See details &amp; Link Below for more! ENJOY !!!\n---------------------------------------------------------------------------\n---------------------------------------------------------------------------\n\n\n\n*See Here for Complete details &amp; stills from BluRay !   &lt;a href=&quot;\nhttp://www.blu-ray.com/movies/Jimi-Hendrix-Live-at-Woodstock-Blu-ray/2132/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.blu-ray.com/movies/Jimi-Hendrix-Live-at-Woodstock-Blu-ray/2132/&lt;/a&gt;\n\n\nJimi Hendrix: Live at Woodstock features all of the existing film footage from Jimi Hendrix's unforgettable August 1969 Woodstock concert newly re-edited and presented uninterrupted and in its original performance sequence. It features never before seen version of &quot;Foxey Lady,&quot; &quot; Message To Love,&quot; &quot;Hey Joe,&quot; &quot;Spanish Castle Magic,&quot; and &quot;Lover Man.&quot; The audio soundtrack now includes a new previously unavailable 5.1 and 2.0 stereo soundtrack mixed by Eddie Kramer, Jimi's original engineer.\n\n\n\nUniversal Music brings Jimi Hendrix Live from Woodstock to the Bluray format in a fine looking 1080p/AVC encode, framed in a 1:42:1 video window. This concert video is shot documentary style, and for a nearly forty year old performance, the video is quite good, if not variable in quality. The first thing you will notice is the fine sheen of grain that is overlaid during the concert footage. It varies in intensity, but never takes away from the viewing experience. It does remind you that you are watching a film instead of a video. Colors are well saturated, and have a really nice pop to them. The colorful clothes of the time show all of the primary and secondary colors, with all of their hues as well. Contrast is quite nice, with whites appearing white, and not bleached or overblown. Black levels are steady and sufficiently deep, and when combined with the contrast level creates a very nice punchy picture. Detail and fine detail are quite good as you can see every strand of lose hair, the detail in Hendrix's rings; you notice the muddy canopy covering the stage, imperfections of Hendrix's skin, and the individual thread work on his Dashiki. Longs shots also have very nice detail, as you can see individual people going far back into long shots. If I have one issue with this disc, it lies in the color telecine work. Concert photographs and the SD DVD clearly show Hendrix wearing a reddish/pink headband. Here it is almost orange, and that makes me just a bit curious if this transfer coloring is accurate. For its age, the video looks really good.","torrent":{"xt":"urn:btih:f61e25daea1723213791f1cdb92a3a319acc0278","amp;dn":"Jimi+Hendrix+Live+At+Woodstock+%28With+Extras%21%29+BluRay-MKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f61e25daea1723213791f1cdb92a3a319acc0278","infoHashBuffer":{"type":"Buffer","data":[246,30,37,218,234,23,35,33,55,145,241,205,185,42,58,49,154,204,2,120]},"announce":[],"urlList":[]}}