{"title":"Ancient Scandinavia - 1st Edition (2015).pdf Gooner","uid":12267806,"size":187840739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f64a1c5e2888b163a9ee77c18d71ae687236fc01&amp;dn=Ancient+Scandinavia+-+1st+Edition+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1440259732,"description":"Publisher: Oxford University Press; 1 edition (July 10, 2015)\nLanguage: English\nISBN-10: 0190231971\nISBN-13: 978-0190231972\n\nScandinavia, a land mass comprising the modern countries of Denmark, Sweden, and Norway, was the last part of Europe to be inhabited by humans. Not until the end of the last Ice Age when the melting of huge ice sheets left behind a fresh, barren land surface, about 13,000 BC, did the first humans arrive and settle in the region. The archaeological record of these prehistoric cultures, much of it remarkably preserved in Scandinavia's bogs, lakes, and fjords, has given us a detailed portrait of the evolution of human society at the edge of the inhabitable world. \n\nIn this book, distinguished archaeologist T. Douglas Price provides a history of Scandinavia from the arrival of the first humans to the end of the Viking period, ca. AD 1050. The first book of its kind in English in many years, Ancient Scandinavia features overviews of each prehistoric epoch followed by illustrative examples from the region's rich archaeology. An engrossing and comprehensive picture of change across the millennia emerges, showing how human society evolved from small bands of hunter-gatherers to large farming communities to the complex warrior cultures of the Bronze and Iron Ages, cultures which culminated in the spectacular rise of the Vikings at the end of the prehistoric period. The material evidence of these past societies--arrowheads from reindeer hunts, megalithic tombs, rock art, beautifully wrought weaponry, Viking warships--give vivid testimony to the ancient peoples of Scandinavia and to their extensive contacts with the remote cultures of the Arctic Circle, Western Europe, and the Mediterranean","torrent":{"xt":"urn:btih:f64a1c5e2888b163a9ee77c18d71ae687236fc01","amp;dn":"Ancient+Scandinavia+-+1st+Edition+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f64a1c5e2888b163a9ee77c18d71ae687236fc01","infoHashBuffer":{"type":"Buffer","data":[246,74,28,94,40,136,177,99,169,238,119,193,141,113,174,104,114,54,252,1]},"announce":[],"urlList":[]}}