{"title":"ProCapture - Camera And Panorama v1.5.3 Final bobiras2009","uid":7596834,"size":8896842,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f6f52007c65d2171916a76210c158e47f87f07dc&amp;dn=ProCapture+-+Camera+And+Panorama+v1.5.3+Final+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346716413,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nProCapture adds advanced features to the Android camera experience. Multiple advanced shooting modes supported: Timer, Burst, Reduced Noise, WideShot and Panorama.\n\nFeatures :\n\n    Panorama mode automatically links together up to 12 photos to produce a high resolution panoramic image providing the ability to zoom in on small details. Output panorama has the highest resolution and best quality among competitors. \n    WideShot mode automatically links together 3 photos to produce a high resolution wide image. \n    Reduced Noise mode captures 2 photos and combines them in order to reduce noise in the photo by about 30%. \n    Shoot better photos with 2 different on-screen composition aids: grid and Fibonacci spiral. \n    Real-time on-screen histogram helps you get better exposed photos. \n    Simple UI with easy access to all features. \n    On-screen remaining photos indicator. \n    Ability to configure volume buttons for zoom or photo capture. \n    Save to internal or external storage (please email us if external storage is not supported on your phone). \n    Easily switch to external video app (does nothing in case no video app is present)\n\nWhat's in this version: (Updatead : Sep 3, 2012)\n\n    Added preference to make wideshot/panorama resolution higher\n    Fixed wideshot/panorama to work with front facing cameras\n    Added preference to disable autofocus in macro mode if it's causing blurry shots\n    Added shortcut to external camcorder under the menu button\n    Fixed issue with Galaxy Note ICS crashing after taking wideshot/panorama\n    Fixed issue with on-screen zoom disappearing when switching from front to back camera\n\nRequired Android O/S : 2.2+\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:f6f52007c65d2171916a76210c158e47f87f07dc","amp;dn":"ProCapture+-+Camera+And+Panorama+v1.5.3+Final+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6f52007c65d2171916a76210c158e47f87f07dc","infoHashBuffer":{"type":"Buffer","data":[246,245,32,7,198,93,33,113,145,106,118,33,12,21,142,71,248,127,7,220]},"announce":[],"urlList":[]}}