{"title":"BBC Panorama - WiFi: A Warning Signal","uid":3693862,"size":244012316,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f759699c708ba7b5a2a60994176e84dcba62ba47&amp;dn=BBC+Panorama+-+WiFi%3A+A+Warning+Signal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hermes4040","files":1,"time":1179791886,"description":"BBC Panorama - Wi-Fi: a warning signal\n\nBritain is in the grip of a Wi-Fi revolution with offices, homes and classrooms going wireless - but there is concern the technology could carry health risks.\n\nThe Government insists Wi-Fi is safe, but a Panorama investigation shows that radio frequency radiation levels in some schools are up to three times the level found in the main beam of intensity from mobile phone masts.\n\nThere have been no studies on the health effects of Wi-Fi equipment, but thousands on mobile phones and masts.\n\nThe radiation Wi-Fi emits is similar to that from mobile phone masts. It is an unavoidable by-product of going wireless.\n\nIn the last 18 months another two million of us in the UK have begun using Wi-Fi.\n\nEntire cities have become what are known as wireless hotspots.\n\nPrecautionary approach\n\nIn 2000, Sir William Stewart, now chairman of the Health Protection Agency, headed the government&amp;#039;s inquiry into the safety of mobile phone masts and health. He felt the scientific research was sufficient to apply a precautionary approach when siting masts near schools.\n\n\tI am asking schools to consider very seriously whether they should be installing Wi-Fi networks now and this will make them think twice or three times before they do it\nPhilip Parkin, Professional Association of Teachers\nDuring that same year, the government sold off the 3G licences for Â£22.5bn.\n\nSir William recalls: &quot;We recommended, because we were sensitive about children... that masts should not necessarily impact directly on areas where children were exposed, like playgrounds and that.&quot;\n\nBut what about Wi-Fi? The technology is similar to mobile phone masts and in use in 70 per cent of secondary schools and 50 per cent of primary schools.\n\nPanorama visited a school in Norwich, with more than 1,000 pupils, to compare the level of radiation from a typical mobile phone mast with that of Wi-Fi in the classroom.\n\nReadings taken for the programme showed the height of signal strength to be three times higher in the school classroom using Wi-Fi than the main beam of radiation intensity from a mobile phone mast.\n\nThe findings are particularly significant because children&amp;#039;s skulls are thinner and still forming and tests have shown they absorb more radiation than adults.\n\nSafety limits\n\nThe readings were well beneath the government&amp;#039;s safety limits - as much as 600 times below - but some scientists suspect the whole basis of our safety limits may be wrong.\n\nPanorama spoke to a number of scientists who questioned the safety limits and were concerned about the possible health effects of such radiation.\n\n&quot;If you look in the literature, you have a large number of various effects like chromosome damage, you have impact on the concentration capacity and decrease in short term memory, increases in the number of cancer incidences,&quot; said Professor Olle Johansson of the Karolinska Institute in Sweden.\n\nAnother scientist, Dr Gerd Oberfeld, from Salzburg is now calling for Wi-Fi to be removed from schools.\n\nHe said: &quot;If you go into the data you can see a very very clear picture - it is like a puzzle and everything fits together from DNA break ups to the animal studies and up to the epidemiological evidence; that shows for example increased symptoms as well as increased cancer rates.&quot;\n\nThe clear advice from Sir William Stewart to the government on mobile phone masts was that the beam of greatest intensity should not fall on any part of the school grounds, unless the school and parents agreed to it.\n\nYet the levels tested in the classroom from Wi-Fi were much higher - three times the highest level of the mast.\n\nPanorama contacted 50 schools at random - and found not one had been alerted by the government to any possible health effects.\n\nPhilip Parkin, general secretary of the Professional Association of Teachers said: &quot;I think schools and parents will be very worried about it...\n\n&quot;I am asking schools to consider very seriously whether they should be installing Wi-Fi networks now and this will make them think twice or three times before they do it.\n\n&quot;I think the precautionary approach doesn&amp;#039;t seem to have worked because it is being rolled out so rapidly...\n\n&quot;It&amp;#039;s a bit like King Canute. We can&amp;#039;t stop the tide and I am afraid if schools are told that there is a serious health implication for having these networks in schools, it is going to be a very serious matter to say to schools, you have to switch them off.&quot;\n\nLow power\n\nAt Washington state university, Professor Henry Lai, a biologist respected by both sides of the argument says he has found health effects at similar levels of radiation to Wi-Fi.\n\nHe estimates that of the two to three thousand studies carried out over the last 30 years, there is a 50-50 split - half finding an effect with the other half finding no effect at all.\n\nBut the Health Protection Agency has said Wi-Fi devices are of very low power - much lower than mobile phones.\n\nThe Government says there is no risk and is backed up by the World Health Organisation which is robust in its language saying there are &quot;no adverse health effects from low level, long-term exposure&quot;.\n\nThe scientist responsible for WHO&amp;#039;s position is Dr Mike Repacholi, who headed up the health organisation&amp;#039;s research programme into radio frequency radiation.\n\nHe was also the founder of the International Committee on Non-Ionizing Radiation Protection (ICNIRP).\n\nHe said the statement of &quot;no adverse health effects&quot; was based on the weight of evidence.\n\nIn order for a health effect to be established it must mean it has been repeated in a number of laboratories using very good study techniques. The findings of any published studies had been put in the mix before reaching a conclusion, he said.\n\n&quot;It is called a weight of evidence approach - and if that weight of evidence is not for there being an effect or not being an effect that is the only way you can tell whether there really is an adverse health effect,&quot; he said.\n\nWi-Fi: a warning signal, Panorama, Monday, 8.30pm, BBC1.\nVOTE Are you concerned about wi-fi safety? Yes No Results are indicative and may not reflect public opinion\nStory from BBC NEWS: &lt;a href=&quot;\nhttp://news.bbc.co.uk/go/pr/fr/-/1/hi/programmes/panorama/6674675.stm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://news.bbc.co.uk/go/pr/fr/-/1/hi/programmes/panorama/6674675.stm&lt;/a&gt;\n\nPublished: 2007/05/20 16:02:46 GMT\n\nÂ© BBC MMVII\n\n[HerMes Digital Media]","torrent":{"xt":"urn:btih:f759699c708ba7b5a2a60994176e84dcba62ba47","amp;dn":"BBC+Panorama+-+WiFi%3A+A+Warning+Signal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f759699c708ba7b5a2a60994176e84dcba62ba47","infoHashBuffer":{"type":"Buffer","data":[247,89,105,156,112,139,167,181,162,166,9,148,23,110,132,220,186,98,186,71]},"announce":[],"urlList":[]}}