{"title":"Brandtson - Discography (1998-2006) [FLAC]","uid":10095906,"size":2286646061,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f78ac3e9264cdd50e192ae8c40b669edb0c1297e&amp;dn=Brandtson+-+Discography+%281998-2006%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"politux","files":-1,"time":1399251209,"description":"\n  Brandtson - Discography (1998-2006) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative, Emo\n  Source: CD (log + cue + art)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  1998 Letterbox\n  1999 The Fallen Star Collection\n  2000 Trying to Figure Each Other Out EP\n  2002 Death and Taxes EP\n  2002 Dial in Sounds\n  2004 Send Us a Signal\n  2006 Hello, Control\n\n  Cleveland emo quartet Brandtson was originally comprised of singer/guitarist Myk Porter, guitarist Matt Traxler, bassist John Sayre, and singer/drummer Jared Jolley. After appearing on Steadfast Records' Radiowaves and Gibberish various-artists compilation in 1997, the group signed with Deep Elm, contributing to the label samplers Records for the Working Class and A Million Miles Away: Emo Diaries, Vol. 2 before closing out 1998 with their debut full-length, Letterbox. The second Brandtson LP, Fallen Star Collection, followed in 1999 and the band's pop-tinged indie rock continued with Trying to Figure Each Other Out, released a year later. The EP Death and Taxes was issued in January 2002, before the aggressive full-length Dial in Sounds appeared that summer, offering more harmonies and stronger melodies than previous efforts. A split with Camber and Seven Storey Mountain was also released in 2002.\n\n  With their Deep Elm contract up, Brandtson signed with The Militia Group in 2004. Teaming up with producer Ed Rose for the fourth time, their label debut, Send Us a Signal, offered even more of the band's trademark melodic power pop and rock. Sayre decided to part ways with the group in July 2005, and he was soon replaced on bass by another Clevelander, Adam Boose, who had been fronting the local synth rock band Furnace St. Starting work on album number five after their first lineup change in almost a decade, Brandtson looked to reinvigorate their sound, approaching the writing process from a different angle and embracing Boose's background in electronic music. The resulting experimental and dance-ready Hello, Control appeared next in May 2006.\n\n  *Thanks to the original uploaders and rippers.","torrent":{"xt":"urn:btih:f78ac3e9264cdd50e192ae8c40b669edb0c1297e","amp;dn":"Brandtson+-+Discography+%281998-2006%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f78ac3e9264cdd50e192ae8c40b669edb0c1297e","infoHashBuffer":{"type":"Buffer","data":[247,138,195,233,38,76,221,80,225,146,174,140,64,182,105,237,176,193,41,126]},"announce":[],"urlList":[]}}