{"title":"Minks - Tides End (2013) [FLAC]","uid":8802081,"size":273427232,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f8011454154e76849684306dc4d8fd8c87062d27&amp;dn=Minks+-+Tides+End+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1376233286,"description":"\n  Minks - Tides End (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Pop, Shoegaze, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Romans \n  02 Everything's Fine \n  03 Margot \n  04 Playboys of the Western World\n  05 Weekenders\n  06 Painted Indian\n  07 Hold Me Now \n  08 Doomed And Cool\n  09 Ark Of Life\n  10 Tides End \n\n  After the departure of Amalie Bruun for Ex-Cops, Shaun Kilfoyle did some heavy retooling of Minks' music. Shaking off the college rock murk of By the Hedge, Tides End finds him and the rest of the band polishing their debut album's potential into a set of songs that are poppier and more poetic. Kilfoyle and company dive deeper into the synth-pop/chillwave elements they flirted with on their debut; this focus on keyboards feels effortless thanks to producer Mark Verbos, who spent years immersed in Berlin's thriving dance music scene. This crisper sound is matched by pithier songwriting: Lines like &quot;Happy birthday/Can I poison your drink?&quot; add a mordant wit to the bouncy album opener &quot;Romans,&quot; while &quot;Summer's over/She's leaving with you&quot; gives the lie to the title of &quot;Everything's Fine.&quot; Kilfoyle is still as fond of layering nostalgic musical allusions as he was on By the Hedge, but on Tides End he edits them into even more wistful -- and catchy -- pop confections. &quot;Margot&quot; is filled with breezy longing that's so potently hooky that it could have been a hit single in the '80s, while &quot;Hold Me Now&quot;'s hovering guitar fuzz and soaring melody owes more to My Bloody Valentine than to the Thompson Twins. \n\n  Kilfoyle bends and blends eras with particular skill on &quot;Doomed and Cool,&quot; where his celebration of John Hughes-style teenage hedonism evokes New Order as well as M83's Saturdays = Youth. Like M83's music, Tides End often feels like a memory of a memory; Kilfoyle wrote most of these songs in near isolation, inspired by a decaying coastal estate (which became the album's namesake) that he discovered while holed up in Long Island's East End. Doomed romances and boarded-up beach houses become fodder for a different kind of dream pop, where the songs are populated by people chasing illusions and fleeting happiness. Kilfoyle illustrates their stories with upper-crust details that evoke Vampire Weekend, or what F. Scott Fitzgerald might have created if he'd been an indie pop songwriter. Like Fitzgerald, Kilfoyle might be at his best when pointing out the bittersweet ironies of blissfully ignorant privilege on songs such as &quot;Playboys of the Western World&quot; and &quot;Weekenders,&quot; where a seemingly endless span of idyllic weekends is crystallized in one perfectly sunny instant. Tides End is so smooth that some of its nuances may be lost at first, but before it slips away, it takes listeners on a deceptively breezy and surprisingly affecting journey through moments that can't last.","torrent":{"xt":"urn:btih:f8011454154e76849684306dc4d8fd8c87062d27","amp;dn":"Minks+-+Tides+End+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8011454154e76849684306dc4d8fd8c87062d27","infoHashBuffer":{"type":"Buffer","data":[248,1,20,84,21,78,118,132,150,132,48,109,196,216,253,140,135,6,45,39]},"announce":[],"urlList":[]}}