{"title":"After Agincourt  (BBC Drama 1988)","uid":7675936,"size":47438426,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f92d01d228c4d559e64f9c2b543268bc0f6f6144&amp;dn=After+Agincourt++%28BBC+Drama+1988%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucybabe","files":2,"time":1348693978,"description":"AFTER AGINCOURT by Peter Mottley\n\nSt. Crispin's Day 1415 as seen through the eyes of Pistol, a common soldier.\n\nMusic composed by Bob White and played by Alistair Mclachlan (bass), Stephen Boxer (bassoon), and Paul Patrick (percussion).\nDirected by Alfred Bradley.\n\n\nThis is a fascinating monologue: war as seen through the eyes of a soldier who fought at Agincourt, played by Bob Hoskins  [Pistol, a Common Soldier] and produced by Alfred Bradley. It was broadcast on Radio 3, 15 Nov 1988, and was repeated in a slightly amended version (45minutes instead of 50) on World Service. It gives a very vivid account of the events surrounding Agincourt, and what it was like during the battle.\n\nThe piece was very favourable reviewed in the Observer, the Times, the Sunday Telegraph and the Guardian. It's a moving piece about a society much more harsh and bloody than our own.\n\nFootnote - AFTER AGINCOURT is given a footnote in the Arden edition of Henry V, as an alternative view of Henry the Hero.\n\n\nARTICLE FROM DAILY TELEGRAPH, Oct 05\n(Parts of the following are paraphrased from Angus Watson's interview with Richard Head, 8 Oct 05, Daily Telegraph)\n\n....with the advent of the longbow, any man who could shoot a squirrel at 100 paces could join the army and receive a decent wage. Longbows offered the first large-scale change for social mobility.\n\nIn October 1415, Henry V and 6,000 men, on an ill-advised journey through France, half-starved and suffering from dysentery, came upon the much larger French army. Richard Head, a modern maker of longbows from Melksham, comments ... &quot;the English were in terrible condition, facing between 60,000 and 100,000 men&quot;.\n\nThe English were on a slope flanked by woods. Of the 6,000, 5,000 were archers, lightly armoured. Some were not wearing armour; many were not wearing trousers because of dysentery. As well as a bow, each man had a either a sword, a n axe, a dagger or a long-handled hammer. The French were heavily armoured, many carrying a new, heavy two-handed sword.\n\nHenry opened the battle by marching his archers forward so that the enemy were in range. They put long sharpened stakes in the ground as an obstacle to the cavalry.\n\nThe French cavalry attacked, going uphill through thick mud. The English archers began firing, around 12 arrows a minute, at their slowly moving targets. So accurate were they that most of the French were hit in the head. Other bowmen aimed at the horses, causing panic.\n\nThe cavalry were followed by the foot soldiers, weighed down by their armour, and pushed forward in the confusion by 30,000 of their own side, who couldn't see what was going on. The slaughter continued. In some parts of the field the dead were in banks six feet high.\n\nIn one incident, a Frenchman shook his fist at the English from 100 paces away. Twenty arrows were fired at him, 18 of which pierced his forearm.\n\nToday's archers find drawing a bow with a pull weight of 50 lbs difficult. The longbow's pull weight was 120lbs - 150lbs. Archers were hefty individuals, and arrows could easily pierce armour.\n\nNigel Deacon, Diversity website.\n\n-------------------------File Information-----------------------------\nBroadcast BBC R3: 15th November 1988\nMPEG 1.0 Layer 3 - 128 kbps mp3 ï¿½ 44 khz - Joint Stero, CRC\nDuration: 50 Mins\nSource: Usenet - thanks to the original uploader","torrent":{"xt":"urn:btih:f92d01d228c4d559e64f9c2b543268bc0f6f6144","amp;dn":"After+Agincourt++%28BBC+Drama+1988%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f92d01d228c4d559e64f9c2b543268bc0f6f6144","infoHashBuffer":{"type":"Buffer","data":[249,45,1,210,40,196,213,89,230,79,156,43,84,50,104,188,15,111,97,68]},"announce":[],"urlList":[]}}