{"title":"abgx360 abgx v1.0.2 (Official Wave 4 Stealth Patching!)","uid":5157918,"size":5068776,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:fbd995451481eaea5f383661497b6043c74c0eaa&amp;dn=abgx360+abgx+v1.0.2+%28Official+Wave+4+Stealth+Patching%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wave10","files":1,"time":1257963638,"description":"abgx360 v1.0.2\n&gt;&gt; abgx360(info) v1.0.2 has been officially released.\n\n* Changes affecting all platforms:\n- Added support for 4th Wave PFI/Video\n- Added support for SS v2\n- Added the new check for DMI corruption which the database has been using since 2009/06/14\n- Added ability to at least try to verify the game data when no Xex/SS ini is available and we're not going to AutoFix\n- Added support for Avatar Awards\n- Added option to select your preferred language to use when displaying strings from the Xex title resource\n- Added drag &amp; drop support for the GUI Input panel\n- Added option to embed images in the HTML source code as data URIs for better portability (when using HTML output)\n- Added JavaScript to HTML output that allows you to check off achievements and see the achieved text (especially useful when the how-to text is vague)\n- Added a Donate button to the GUI so you can help me pay the bills and continue working on improvements :)\n- Removed &quot;Look for verified files in the local folder only&quot; option from the GUI. I can't tell you how many people have checked this box without reading it because they saw it in a tutorial or someone else told them to do it, and then they can't figure out why abgx360 says you need to enable online functions. Please stop writing/following tutorials! Just read the Quickstart topics, the tutorial is right there.\n- Checking for updates to GameNameLookup.csv is now optional (the csv was eating 50% of our bandwidth and you probably don't need it anyway since the game name can be retrieved directly from the Xex)\n- Fixed a bug where folders would be considered files when parsing the ISO filesystem on some recent games\n- Fixed a bug where default.pe (a temporary file used when decompressing a compressed default.xex) wasn't being deleted automatically\n- Fixed a bug where unicode code point 160 (no-break space) would be displayed in a CLI window as &quot; ?&quot; instead of &quot; &quot;\n- Small changes to the way some messages are displayed (harder to miss)\n\n* Changes affecting Windows:\n- Now storing data files in the AppData folder to prevent errors related to permissions and UAC. You can open the GUI and hit Ctrl+F to find out where your StealthFiles are now stored and optionally have it opened for you. abgx360 will still check for Video ISOs in the old install directory first though, so you don't need to move that 3rd Wave Video ISO if you have it saved there already.\n- Using libcurl 7.19.6 which should hopefully fix some strange connection problems affecting a small percentage of users\n\n* Changes affecting Linux/BSD:\n- Fixed a bug on 64 bit systems which made it impossible to read PFI/Video exceptions from abgx360.dat\n- Added code to the unix version of kbhit() to prevent hanging when abgx360 is launched as a background process\n\n* Changes affecting Mac OS X:\n- Fixed a bug where abgx360 would fail to launch if you supplied a filename that contained an apostrophe\n- Changed the dark gray text used for things like achievement type to normal gray since it was actually showing up black (invisible on a black background)\n- Removed GUI option to &quot;Use Terminal font characters&quot; (this refers to a Windows font which replicates CP437 characters and not Terminal.app)\n\n* Special Note: It's recommended to wait for iXtreme LT (Lite Touch) before you play any more backups or originals on an unbanned console flashed with custom firmware.\n\nOfficial Site:\nDownload: here\nDiscuss this news item on our forums: forums.xbox-scene.com\n\nSpread News: (PermaLink) - (Digg) - (Netscape) - (del.icio.us) - (Slashdot) - (Technorati)\n(Wednesday 11 November 2009 11:54 EST) - (Category: Xbox) - (Posted by:: XanTium)\n\n\n\n\nFinally!!!\n\nNote: This download does not include the Video ISO needed for Wave 4 Games. You can get it from:  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5158068&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5158068&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:fbd995451481eaea5f383661497b6043c74c0eaa","amp;dn":"abgx360+abgx+v1.0.2+%28Official+Wave+4+Stealth+Patching%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbd995451481eaea5f383661497b6043c74c0eaa","infoHashBuffer":{"type":"Buffer","data":[251,217,149,69,20,129,234,234,95,56,54,97,73,123,96,67,199,76,14,170]},"announce":[],"urlList":[]}}