{"title":"SAS Zombie Assault 4 v1.8.0 mod [apkpita]","uid":14781734,"size":120218781,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:fd2a9ac9919cbb09f253eaad92c064a9cae7aa16&amp;dn=SAS+Zombie+Assault+4+v1.8.0+mod+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1464992499,"description":"A virus outbreak on a distant trans-federation planet unleashes horrors from humanity's past. A powerful, rapidly growing zombie horde threatens the very existence of humankind, and the only ones capable of fighting back are the highly skilled, highly weaponized special forces of the S A S. Choose from 3 unique character classes, maximize the fully customizable skill tree, and select from hundreds of weapons and armor pieces to build the ultimate zombie killing hero. Play dynamic, challenging levels in single player or 4 player cooperative multiplayer and give our ravaged civilization its last best hope for survival.\r\n\r\nTwo new events available! Apocalypse and Last Man Standing will test your zombie blasting skills!\r\nPurge the undead! Awesome upgradeable guns and armor, unique class skills, and 4 player co-op! Play the most intense zombie shooter on mobile, from the makers of Bloons TD 5.\r\n\r\nINTENSE ACTION\r\nZombies swarm the screen, exploding into bits under your hail of bullets. Each of the 17 unique zombie types have special attacks and behavior, and they can evolve - manifesting terrifying new powers as you progress through the game. And just when you think you've beat them all, savage boss zombies hunt you down, puking out acid worms or storming after you in rage mode. Learn their strengths and weaknesses as you lead the action across 7 story-driven maps with varying victory conditions.\r\n\r\nUNBEATABLE 4 PLAYER CO-OP\r\nQuickmatch with up to 3 other players of similar level and use the custom skills and weapons chosen by all players to form an effective fire team. Coordinate auto-turret placements, high level room-clearing powers like Assault Team, Aerial Bombardment, and Zombie Antidote, and move physics objects to create temporary cover while you paint the room red.\r\n\r\nHEAPS OF EPIC LOOT\r\nOver 160 incredible guns and armor pieces are locked up tight inside increasingly rare strongboxes that you can find in secret rooms or on the mangled remains of your enemies. Your loadout includes a pistol and two rifle class weapons - choose from fast firing submachine guns, devastating shotguns, high damage assault rifles, brutal machine guns, flamethrowers, rocket launchers, lightning guns, and more. Armor up for protection against physical, thermal, and chemical attacks, then round out your arsenal with auto-turrets, grenades, and special high damage ammo to rip through the undead before they rip through you.\r\n\r\nAMAZING RPG-STYLE UPGRADES\r\nThe Assault, Medic, and Heavy Gunner classes each have unique upgrade trees, giving each character 19 skills to customize. Hundreds of guns and armor pieces have a range of grades and a powerful RED version when you reach high levels. In addition you can add powerful augmentations to your guns and gear which enhance core properties like damage and rate of fire, but can also improve reload time, resist damage, and heal.\r\n\r\nSAS: Zombie Assault 4 is recommended for players 12 years of age and older, and the fantasy violence, gibs, and zombie blood are to be expected given the survival theme. We have included a &quot;Gore&quot; setting on the Options screen specifically for young or sensitive players, and this removes the blood and gibs when Gore is toggled Off.\r\n\r\nDownload for free and play SAS: Zombie Assault 4 now!\r\n\r\nWhat’s new:\r\nNew Contract added!\r\nA new, stronger type of zombie has started to appear in remote areas of some infected planets. These new infected are more dangerous than regular zombies, but killing them gives far more xp than usual.\r\nContracts are starting to come in to eliminate these new threats. Make sure you check the available contracts regularly for your chance to do your part for the protection of the galaxy and earn yourself some bonus xp in the process.\r\n\r\nMod Info:\r\nUnlimited money\r\nLots of Revive tokens\r\nUnlocked save slots\r\n\r\nRequirements: Android OS 2.3.3 and up","torrent":{"xt":"urn:btih:fd2a9ac9919cbb09f253eaad92c064a9cae7aa16","amp;dn":"SAS+Zombie+Assault+4+v1.8.0+mod+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd2a9ac9919cbb09f253eaad92c064a9cae7aa16","infoHashBuffer":{"type":"Buffer","data":[253,42,154,201,145,156,187,9,242,83,234,173,146,192,100,169,202,231,170,22]},"announce":[],"urlList":[]}}