{"title":"DILWALE (2015)-BD Rip -HEVC 1080p-x265 AC3 ESubs-4 7 GB-DDR","uid":13838109,"size":5062691463,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:fd2d57606ce282d362375984d7d7fdd2997f7905&amp;dn=DILWALE+%282015%29-BD+Rip+-HEVC+1080p-x265+AC3+ESubs-4+7+GB-DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":3,"time":1457782284,"description":"DDR Presents\r\n\r\n\r\nDilwale(2015)\r\n(A film by Rohit Shetty)\r\n\r\nHindi - BD.Rip- 1080p - 1920x816 (2.35:1)- 4.7 GB - x.265.AC3.Esubs- 2 Hrs:33 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/anqC\r\n \nhttp://extraimago.com/image/anqk \nhttp://extraimago.com/image/anqH \nhttp://extraimago.com/image/anqF \nhttp://extraimago.com/image/anqD \nhttp://extraimago.com/image/anq5 \nhttp://extraimago.com/image/anqg \nhttp://extraimago.com/image/anqX \nhttp://extraimago.com/image/anqP \nhttp://extraimago.com/image/anqG \nhttp://extraimago.com/image/anqr \nhttp://extraimago.com/image/anqp \nhttp://extraimago.com/image/anqY\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/anym\r\n\r\nSynopsis:\r\nRaj (Shahrukh Khan) is a car modifier in Goa and adores his younger brother Veer (Varun Dhawan). Veer is in love with Ishita (Kriti Sanon). In the process, Raj learns that Ishita is the sister of Meera (Kajol) whom he once loved, but separated in bitter circumstances.\r\n\r\nIn flashback we learn that Raj, once known as Kaali and Meera were the children of two feuding families, in Bulgaria (of all places!). Kali was the adopted son of Randhir (Vinod Khanna) and did all the dangerous work for him. Meera's father was Malik (Kabir Bedi)the arch enemy of Randhir. The two don't know the other's antecedents but fall in love. The feud reaches a stage when Randhir and Malik kill each other. Meera thinks Kali has killed her father and starts to hate him. A heartbroken Kali then returns to India and becomes Raj, in Goa.\r\n\r\nThere are a few more dons like King (Bomman Irani) and Veer falls foul of him. Raj then reverts to being Kali and takes on King.\r\n\r\nMeera naturally opposes the match between Veer and Ishita. The misunderstadings finally are cleared up and Meera learns the truth about her father's death. Thereafter all of them are reunited, decide to foget the past and live happily ever after.\r\n\r\nComments:\r\nIf you are confused after reading the summary, think of what you will be when you see the movie. The first thought that occurred to me was how did two, not one, Dons get to Bulgaria and why in an alien land, they start feuding instead of supporting each other. The Bulgarians are obviously a tolerant lot, for they seem to let two half witted Indian Dons flourish in their country! Then, how is it that in this film no one knows the identity of the other? Isn't that the first thing you would try to find out? And wouldn't it be the simplest thing to do?\r\n\r\nThe goofy plot means that no one really does justice to it. The old chemistry between Shahrukh and Kajol is evident, but even they cannot make sense of the sheer stupidity of the story line. Others simply give up! Ultimately, it is the exotic location and the fine cinematography in outdoor scenes that makes the movie bearable, but the two and a half hours is a stretch on one's credulence.\r\n\r\nUploader's Notes:\r\nThe Blu_ray was much better than the DVD that was published earlier. There is still a lot of saturation and the wealth of detail had been masked by the saturated colours. We have reduced the saturation, improved the average Luminance and the result is this rip.\r\nWe are uploading two versions of HEVC rips of this Blu-Ray. In both the video is the same, but the Audio is different. In the first, we have included 7.1 Channel ATMOS-TrueHD audio (which alone is over 6 GB) and the second has plain vanilla AC3 with 5.1 Channel. Please download as per your audio equipment.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4535650/\r\n\r\n\r\nMake sure it is Genuine DDR release @ ExtraTorrent.com\r\n                  \nhttps://extratorrent.cc/                  \nhttps://extratorrent.com/                  \nhttp://extratorrent.ws/                  \nhttps://etproxy.com/                  \nhttps://extratorrentlive.com/                  \nhttps://extratorrentonline.com/                  \nhttps://etmirror.com/                  \nhttps://extratorrent.works/                  \nhttps://extratorrent.date/\r\n\r\n\r\nShare your Images with:\r\n                  \nhttp://extraimago.com/\r\n\r\nHelp us by donating with Bitcoin: 1XeH1kKXWYbzZcFHokGiZ4d3MWW5WyXzU","torrent":{"xt":"urn:btih:fd2d57606ce282d362375984d7d7fdd2997f7905","amp;dn":"DILWALE+%282015%29-BD+Rip+-HEVC+1080p-x265+AC3+ESubs-4+7+GB-DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd2d57606ce282d362375984d7d7fdd2997f7905","infoHashBuffer":{"type":"Buffer","data":[253,45,87,96,108,226,130,211,98,55,89,132,215,215,253,210,153,127,121,5]},"announce":[],"urlList":[]}}