{"title":"Flood Legends - Charles Martin","uid":11773216,"size":274280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:feecbb08445143c39dd7d891ab8548073434fa52&amp;dn=Flood+Legends+-+Charles+Martin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427158343,"description":"\nThe story of the Deluge - or the Global Flood of Noah - permeates nearly every culture in the world in some way, shape, or form. While details vary between the different cultures, the same basic elements, occur in all versions. In &quot;Flood Legends&quot; you will discover:\n\n-Detailed analysis of myth, legend, and historical details that are clues for a common, global event\n-Unique research from a comparative study supporting the biblical history\n\nDespite the striking similarities of these accounts, some mythologists have looked at the minor differences in the stories and declared: &quot;This never happened!&quot;\n\nThere is another alternative - to accept that the different versions all refer to the same event - passed on from generation to generation, through various developing cultures. Through these legends, this epic event has remained woven into the tapestry of cultural history - sharing not just the story of survival, but the power of obedience, and the fulfillment of God's enduring promise.\n\n\nAbout the author:\nCharles Martin explores flood mythology from around the world and presents a compelling argument for it pointing to clues of a global flood event. He received his B.A. in Comparative Literature from the University of Virginia in Charlottesville. He and his wife live in Richmond, VA","torrent":{"xt":"urn:btih:feecbb08445143c39dd7d891ab8548073434fa52","amp;dn":"Flood+Legends+-+Charles+Martin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feecbb08445143c39dd7d891ab8548073434fa52","infoHashBuffer":{"type":"Buffer","data":[254,236,187,8,68,81,67,195,157,215,216,145,171,133,72,7,52,52,250,82]},"announce":[],"urlList":[]}}